<?php
// *   Аўтар: "БуслікДрэў" ( https://buslikdrev.by/ )
// *   © 2016-2024; BuslikDrev - Усе правы захаваны.

eval(base64_decode('aWYgKCFpc3NldCgkdGhpcy0+ZGF0YVsnYnVzX2NhY2hlX3ZlcnNpb24nXSkpIHsNCgkkdGhpcy0+ZGF0YVsnYnVzX2NhY2hlX3ZlcnNpb24nXSA9ICcxLjAnOw0KCWlmICh2ZXJzaW9uX2NvbXBhcmUoVkVSU0lPTiwgJzQuMC4wJywgJz49JykpIHsNCgkJJGZpbGUgPSBESVJfRVhURU5TSU9OIC4gJ2J1c19jYWNoZS9hZG1pbi9jb250cm9sbGVyL21vZHVsZS9idXNfY2FjaGUucGhwJzsNCgl9IGVsc2VpZiAodmVyc2lvbl9jb21wYXJlKFZFUlNJT04sICcyLjMuMCcsICc+PScpKSB7DQoJCSRmaWxlID0gRElSX0FQUExJQ0FUSU9OIC4gJ2NvbnRyb2xsZXIvZXh0ZW5zaW9uL21vZHVsZS9idXNfY2FjaGUucGhwJzsNCgl9IGVsc2Ugew0KCQkkZmlsZSA9IERJUl9BUFBMSUNBVElPTiAuICdjb250cm9sbGVyL21vZHVsZS9idXNfY2FjaGUucGhwJzsNCgl9DQoJaWYgKGlzX2ZpbGUoJGZpbGUpKSB7DQoJCWluY2x1ZGVfb25jZSgkZmlsZSk7DQoJCSR0aGlzLT5kYXRhWydidXNfY2FjaGVfdmVyc2lvbiddID0gKGNsYXNzX2V4aXN0cygnQnVzQ2FjaGUnKSA/IChuZXcgQnVzQ2FjaGUobmV3IFJlZ2lzdHJ5KCkpKS0+dmVyc2lvbiA6ICR0aGlzLT5kYXRhWydidXNfY2FjaGVfdmVyc2lvbiddKTsNCgl9DQp9'));

// Heading
$_['heading_title'] = '<b>Буслік Кеш <span style="color:limegreen">Full</span></b> v' . $this->data['bus_cache_version'];
$_['heading_description'] = '';

// Tab
$_['tab_setting'] = 'Налаштування';
$_['tab_cache'] = 'Кешування';
$_['tab_pagespeed'] = 'PageSpeed';
$_['tab_image'] = 'Зображення';
$_['tab_html'] = 'Розмітка шаблону - HTML';
$_['tab_css'] = 'Стилі - CSS';
$_['tab_js'] = 'Скрипти - JS';
$_['tab_database'] = 'Оптимізація бази даних';
$_['tab_export'] = 'Експорт';
$_['tab_import'] = 'Імпорт';
$_['tab_cron'] = 'Cron';
$_['tab_documentation'] = 'Документація';
$_['tab_support'] = 'Технічна підтримка';

// Text
$_['text_extension'] = 'Розширення';
$_['text_module'] = 'Модулі';
$_['text_edit'] = 'Редагування';
$_['text_min'] = 'Від';
$_['text_max'] = 'До';
$_['text_yes'] = 'Так';
$_['text_no'] = 'Ні';
$_['text_enabled'] = 'Увімкнено';
$_['text_disabled'] = 'Вимкнено';
$_['text_all'] = ' --- Все --- ';
$_['text_none'] = ' --- Не вибрано --- ';
$_['text_select'] = ' --- Виберіть --- ';
$_['text_select_all'] = 'Виділити все';
$_['text_unselect_all'] = 'Зняти виділення';
$_['text_width'] = 'Ширина';
$_['text_height'] = 'Висота';
$_['text_install'] = 'Встановлення модуля...';
$_['text_uninstall'] = 'Видалення модуля...';
$_['text_uninstall_files'] = 'Видалення файлів модуля...';
$_['text_uninstall_files_log'] = 'Звіт про видалення файлів модуля';
$_['text_ocmod_clear'] = 'Чистка модифікаторів...';
$_['text_ocmod_clearlog'] = 'Чистка лога модифікаторів...';
$_['text_ocmod_refresh'] = 'Оновлення модифікаторів...';
$_['text_cache_clear'] = 'Чистка кеша...';
$_['text_processing'] = 'Обробка';
$_['text_loading'] = 'Завантаження';
$_['text_start'] = 'Старт';
$_['text_continue'] = 'Продовжити';
$_['text_pause'] = 'Пауза';
$_['text_restart'] = 'Рестарт';
$_['text_link'] = 'Посилання';
$_['text_default'] = 'За замовчуванням';
$_['text_guest'] = 'Гість';
$_['text_dir_1'] = 'Дело на ліво';
$_['text_dir_2'] = 'Зліва направо';
$_['text_path'] = 'Шлях';
$_['text_no_results'] = 'Немає даних';
$_['text_confirm'] = 'Ви впевнені?';
$_['text_version'] = 'Версія';
$_['text_cache_status_2'] = 'Так, якщо не кешуються контролери та моделі';
$_['text_cache_clear_blog_category'] = 'При редагуванні категорій блогу';
$_['text_cache_clear_blog_article'] = 'При редагуванні статей блогу';
$_['text_cache_clear_category'] = 'При редагуванні категорій';
$_['text_cache_clear_information'] = 'Під час редагування інформаційних сторінок';
$_['text_cache_clear_manufacturer'] = 'При редагуванні виробників';
$_['text_cache_clear_product'] = 'При редагуванні товару';
$_['text_cache_clear_time'] = 'Після закінчення встановленого часу (не рекомендується, але якщо шкода грошей на згадку, то вам можна)';
$_['text_pagespeed_image_webp_convert_1'] = 'Генерувати через GD';
$_['text_pagespeed_image_webp_convert_2'] = 'Генерувати через ImageMagick';
$_['text_pagespeed_min_1'] = 'Об\'єднувати файли';
$_['text_pagespeed_min_2'] = 'Прибрати коментарі';
$_['text_pagespeed_min_3'] = 'Прибрати прогалини';
$_['text_pagespeed_min_4'] = 'Прибрати перенесення рядків';
$_['text_pagespeed_min_5'] = 'Прибрати <!-- //--> в інлайн скриптах';
$_['text_pagespeed_transfer_1'] = 'Вгору';
$_['text_pagespeed_transfer_2'] = 'Вниз';
$_['text_pagespeed_transfer_3'] = 'У файл стиснення посилання вгорі';
$_['text_pagespeed_transfer_4'] = 'У файл стиснення посилання внизу';
$_['text_export_import_format_sql'] = 'SQL';
$_['text_export_import_format_json'] = 'JSON';
$_['text_export_import_format_csv'] = 'CSV';
$_['text_export_import_format_xls'] = 'XLS';
$_['text_export_import_format_xlsx'] = 'XLSX';
$_['text_export_import_format_xml'] = 'XML';
$_['text_export_import_format_yml'] = 'YML';
$_['text_export_import_copy_1'] = 'Jet Cache v23+';
$_['text_export_import_copy_2'] = 'XYz оптимізер v1.4+';
$_['text_export_import_copy_3'] = 'Lighting';
$_['text_export_import_copy_4'] = '';
$_['text_support_stats_loading'] = 'Іде завантаження статистики - чекайте!';
$_['text_support_stats_success'] = 'Статистика успішно завантажена!';
$_['text_support_stats_danger'] = 'Помилка завантаження статистики!';
$_['text_support_cache_total'] = 'Кількість файлів кешу:';
$_['text_support_cache_size'] = 'Розмір файлів кешу:';
$_['text_support_cache_minify_total'] = 'Кількість файлів кешу js та css:';
$_['text_support_cache_minify_size'] = 'Розмір файлів кешу js та css:';
$_['text_support_image_total'] = 'Кількість файлів зображень:';
$_['text_support_image_size'] = 'Розмір всього файлів зображень:';
$_['text_support_image_cache_total'] = 'Кількість ресайз копій зображень:';
$_['text_support_image_cache_size'] = 'Розмір ресайз копій зображень:';
$_['text_support_session_total'] = 'Кількість сесій:';
$_['text_support_session_size'] = 'Розмір файлів сесій:';
$_['text_support_session_db_total'] = 'Кількість записів сесій у БД:';
$_['text_support_session_db_size'] = 'Розмір записів сесій у БД:';
$_['text_support_session_cart_total'] = 'Кількість записів сесій гостьових кошиків у БД:';
$_['text_support_session_cart_size'] = 'Розмір записів сесій гостьових кошиків у БД:';
$_['text_support_disc_total'] = 'Усього пам\'яті на диску:';
$_['text_support_disc_free'] = 'Вільного місця на диску:';
$_['text_support_debug_2'] = 'Так і перетворювати кеш css, js';
$_['text_support_debug_3'] = 'Так і показувати швидкість контролерів';
$_['text_support_debug_4'] = 'Так і показувати швидкість моделей';
$_['text_support_debug_5'] = 'Так і показувати data-busloadinglazy-id';
$_['text_support_debug_6'] = 'Так і показувати bus_ajax_id';
$_['text_author'] = 'Автор: <a href="https://buslikdrev.by/" title="Товари ремісничого виробництва" rel="noreferrer noopener" target="_blank">БуслікДрев</a>. тех. підтримка: <a href="https://liveopencart.ru/buslikdrev" title="Технічна допомога у вирішенні проблем, пов\'язаних з модулем" rel="noreferrer noopener" target="_blank">ТУТ</a>.';
$_['text_corp'] = '© 2016-' . date('d.m.Y') . '; <a href="https://buslikdrev.by/" title="BuslikDrev" rel="noreferrer noopener" target="_blank">BuslikDrev</a> - Всі права захищено.';

// Entry
$_['entry_status'] = 'Статус';
$_['entry_store'] = 'Магазин';
$_['entry_cache_status'] = 'Включити кешування сторінок';
$_['entry_cache_con'] = 'Параметри config';
$_['entry_cache_ses'] = 'Параметри session';
$_['entry_cache_cok'] = 'Параметри cookie';
$_['entry_cache_par'] = 'Параметри обмеження';
$_['entry_cache_onrot'] = 'Параметри роботи';
$_['entry_cache_rot'] = 'Параметри виключення';
$_['entry_cache_customer'] = 'Кешувати для авторизованих користувачів?';
$_['entry_cache_cart'] = 'Кешувати кошик';
$_['entry_cache_cart_count'] = 'Кешувати за наявності товару в кошику';
$_['entry_cache_controller'] = 'Кешування функцій контролерів';
$_['entry_cache_controller_ajax'] = 'Ajax завантаження функцій контролерів';
$_['entry_cache_model'] = 'Кешування функцій моделей';
$_['entry_cache_engine'] = 'Обробник кешу';
$_['entry_cache_engine_mine'] = 'Свій обробник кешу';
$_['entry_cache_oc'] = 'Контролювати кеш OpenCart';
$_['entry_cache_expire'] = 'Час життя кешу OpenCart';
$_['entry_cache_expire_controller'] = 'Час життя кешу контролерів';
$_['entry_cache_expire_model'] = 'Час життя кешу моделей';
$_['entry_cache_expire_all'] = 'Час життя кешу сторінок';
$_['entry_cache_size_limit'] = 'Розмір кешу';
$_['entry_cache_count'] = 'Кількість доступного кешу';
$_['entry_cache_clear'] = 'Автоматичне чищення кешу';
$_['entry_pagespeed_status'] = 'Включити оптимізацію (PageSpeed)';
$_['entry_pagespeed_onrot'] = 'Параметри роботи';
$_['entry_pagespeed_rot'] = 'Параметри виключення';
$_['entry_pagespeed_image_lazy_load'] = 'Включити Lazy load зображень';
$_['entry_pagespeed_image_first_boot_status'] = 'Включити First Boot зображень';
$_['entry_pagespeed_image_first_boot_onrot'] = 'Параметри роботи First Boot';
$_['entry_pagespeed_image_first_boot_rot'] = 'Параметри виключення First Boot';
$_['entry_pagespeed_image_w_h'] = 'Включити атрибути ширини та висоти';
$_['entry_pagespeed_image_webp_status'] = 'Включити підджержування WebP зображень';
$_['entry_pagespeed_image_webp_convert'] = 'Конвертувати зображення в WebP і назад';
$_['entry_pagespeed_image_webp_quality'] = 'Стиск WebP зображень';
$_['entry_pagespeed_html_lazy_load'] = 'Включити Lazy load html';
$_['entry_pagespeed_html_replace_before'] = 'Заміна в html-коді до стиснення';
$_['entry_pagespeed_html_replace_after'] = 'Заміна в html-коді після стиснення';
$_['entry_pagespeed_html_min'] = 'Стискати html-код';
$_['entry_pagespeed_html_min_tags'] = 'Видалення відступів зліва від тегів';
$_['entry_pagespeed_css_replace_before'] = 'Заміна в css-коді до стиснення';
$_['entry_pagespeed_css_replace_after'] = 'Заміна в css-коді після стиснення';
$_['entry_pagespeed_css_min'] = 'Стискати css-код';
$_['entry_pagespeed_css_min_links'] = 'Посилання на css файли';
$_['entry_pagespeed_css_min_download'] = 'Посилання на css файли для скачування';
$_['entry_pagespeed_css_min_exception'] = 'Вилучення зі стиснення css';
$_['entry_pagespeed_css_min_font'] = 'Предзавантаження шрифтів або зображень';
$_['entry_pagespeed_css_min_convert'] = 'Конвертація з коду у файл';
$_['entry_pagespeed_css_min_display'] = 'Font-Display';
$_['entry_pagespeed_css_inline_transfer'] = 'Перемістити інлайн css-код';
$_['entry_pagespeed_css_inline_exception'] = 'Виняток із перенесення інлайн css-коду';
$_['entry_pagespeed_css_events'] = 'Події для запуску css-коду';
$_['entry_pagespeed_css_critical'] = 'Включити збирання критичних стилів';
$_['entry_pagespeed_css_critical_all'] = 'Збирати стилі по всіх елементах';
$_['entry_pagespeed_css_critical_offset'] = 'Відсічення збору від висоти екрана';
$_['entry_pagespeed_css_critical_time'] = 'Відстрочка часу';
$_['entry_pagespeed_css_critical_elements'] = 'Елементи стилів';
$_['entry_pagespeed_css_critical_links'] = 'Посилання на сторінки збору критичних стилів';
$_['entry_pagespeed_css_style'] = 'Стиль';
$_['entry_pagespeed_js_replace_before'] = 'Заміна в js-коді до стиснення';
$_['entry_pagespeed_js_replace_after'] = 'Заміна в js-коді після стиснення';
$_['entry_pagespeed_js_min'] = 'Стискати js-код';
$_['entry_pagespeed_js_min_links'] = 'Посилання на js файли';
$_['entry_pagespeed_js_min_download'] = 'Посилання на js файли для скачування';
$_['entry_pagespeed_js_min_exception'] = 'Вилучення зі стиснення js';
$_['entry_pagespeed_js_inline_event'] = 'Відкласти завантаження інлайн js-коду';
$_['entry_pagespeed_js_inline_event_time'] = 'Час до автозапуску інлайн js-коду';
$_['entry_pagespeed_js_inline_transfer'] = 'Перемістити інлайн js-код';
$_['entry_pagespeed_js_inline_transfer_onrot'] = 'Переносити інлайн js-код';
$_['entry_pagespeed_js_inline_exception'] = 'Виняток із переносу інлайн js-коду';
$_['entry_pagespeed_js_events'] = 'Події для запуску js-коду';
$_['entry_pagespeed_js_script'] = 'Скрипт';
$_['entry_database_status'] = 'Режим налаштування';
$_['entry_database_speed_site'] = 'Перевірити швидкість сайту';
$_['entry_database_links'] = 'Посилання для перевірки, що цікавлять';
$_['entry_database_tables'] = 'Таблиці';
$_['entry_database_indexs'] = 'Індекси';
$_['entry_database_columns'] = 'Стовпці';
$_['entry_database_unique'] = 'Унікальний';
$_['entry_database_unique_elements'] = 'Унікальних елементів';
$_['entry_database_packed'] = 'Упакований';
$_['entry_database_index'] = 'Індекс';
$_['entry_database_index_name'] = 'Ім\'я індексу';
$_['entry_database_index_key_block_size'] = 'Розмір блоку ключа';
$_['entry_database_index_type'] = 'Тип';
$_['entry_database_index_parser'] = 'Парсер';
$_['entry_database_index_comment'] = 'Коментар';
$_['entry_database_column'] = 'Стовпець';
$_['entry_cron_pregeneration'] = 'Включити прегенерацію кешу';
$_['entry_cron_pregeneration_query_count'] = 'Кількість запитів за секунду';
$_['entry_documentation_status'] = 'Я отримав диплом Буслік';
$_['entry_support_update'] = 'Встановлення оновлень';
$_['entry_support_update_order_id'] = 'Номер замовлення';
$_['entry_support_update_key'] = 'Ліцензійний ключ';
$_['entry_support_stats_status'] = 'Включити статистику';
$_['entry_support_disc_size_limit'] = 'Ліміт пам\'яті диска';
$_['entry_support_disc_warning'] = 'Включити попередження про брак пам\'яті';
$_['entry_support_session_fix'] = 'Включити фіксацію заповнення сесій';
$_['entry_support_debug'] = 'Включити налагодження';
$_['entry_support_debug_log'] = 'Включити логування повільних сторінок';

// Help
$_['help_status'] = 'Якщо вимкнено, весь функціонал нижче буде вимкнений.';
$_['help_store'] = 'Виберіть магазини, в яких буде працювати модуль.';
$_['help_cache_status'] = 'Якщо так, то кешуватимуться сторінки повністю.';
$_['help_cache_con'] = 'Вкажіть параметри $this->config->get для різноманітності кешу. Якщо потрібний параметр масиві, то вказуйте кожен параметр масиву через \' | \', наприклад, $this->config->get(\'products\')[\'total\'] =&gt; products|total. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_cache_ses'] = 'Вкажіть параметри $this->session->data для різноманітності кешу. Значення задається починаючи з нового рядка. Якщо потрібний параметр масиві, то вказуйте кожен параметр масиву через \' | \', наприклад, $this->session->data[\'products\'][\'total\'] =&gt; products|total. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_cache_cok'] = 'Вкажіть параметри $this->request->cookie для різноманітності кешу. Значення задається починаючи з нового рядка. Якщо потрібний параметр масиві, то вказуйте кожен параметр масиву через \' | \', наприклад, $this->request->cookie[\'products\'][\'total\'] =&gt; products|total. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_cache_par'] = 'Вкажіть параметри $this->request->get і $this->request->post для обмеження кешу в межах цих параметрів (тобто інші параметри будуть обрізатись і віддавати цим параметрам кеш дозволених). Значення задається починаючи з нового рядка. Якщо не потрібно обмежувати, залиште поле порожнім. Якщо хочете, щоб кеш не працював для заборонених параметрів, то першим рядком встановіть \'cache_off\'. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_cache_onrot'] = 'Вкажіть роут або його keyword (seo_url) сторінки для точної роботи (При заповненні конфігурації та сесій діяти основні налаштування не будуть), потім після \' | \' вкажіть час кешування в секундах, потім після \' | \' вкажіть параметри $this->config->get() через \' , \', якщо вони потрібні, потім після \' | \' вкажіть параметри $this->session->data через \' , \', якщо вони потрібні (якщо це масив, то розділяйте параметри \' / \'), потім після \' | \' вкажіть параметри $this->request->cookie через \' , \', якщо вони потрібні (якщо це масив, то розділяйте параметри \' / \'), потім після \' | \' вкажіть параметри $this->request->get і $this->request->post через \' , \', якщо вони потрібні (якщо це масив, то розділяйте параметри \' / \'). Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \'; \'.';
$_['help_cache_rot'] = 'Вкажіть роут або його keyword (seo_url) сторінки для виключення з кешу. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_cache_customer'] = 'Кешувати для авторизованих користувачів?';
$_['help_cache_cart'] = 'Якщо так, корзина буде кешуватися для кожного користувача на час зберігання кешу контролерів.';
$_['help_cache_cart_count'] = 'Вкажіть максимальну кількість товарів у кошику, при якому кешування сторінок буде працювати.';
$_['help_cache_controller'] = 'Вкажіть роут контролера, який потрібно закешувати (приклад - extension/module/category), потім після \' | \'вкажіть час кешування в секундах, потім після\' | \' вкажіть параметри $this->config->get() через \' , \', якщо вони потрібні (якщо це масив, то розділяйте параметри \' / \'), потім після \' | \' вкажіть параметри $this->session->data через \' , \', якщо вони потрібні (якщо це масив, то розділяйте параметри \' / \'), потім після \' | \' вкажіть параметри $this->request->cookie через \' , \', якщо вони потрібні (якщо це масив, то розділяйте параметри \' / \'), потім після \' | \' вкажіть параметри $this->request->get і $this->request->post через \' , \', якщо вони потрібні. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_cache_controller_ajax'] = 'Вкажіть роут або keyword (seo_url) сторінки, потім після \' | \' вкажіть роут контролера який потрібно завантажити через ajax (приклад - extension/module/category, його можна дізнатися над модулем на сторінці, що цікавить, в дебаг режимі), потім після \' | \' вкажіть module_id якщо він є (його можна дізнатися над модулем на сторінці, що цікавить в дебаг режимі), потім після \' | \' вкажіть номер завантаження (його можна дізнатися над модулем на сторінці, що цікавить в дебаг режимі), потім після \' | \' вкажіть ширину екрана більше якого почати завантажувати контролер, якщо потрібно обмежити до, то через \' - \' вкажіть ширину. Якщо хочете на всіх сторінках, то замість роуту вкажіть \' # \'. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'. bus_ajax_id для скриптів можна дізнатися над модулем на сторінці, що цікавить, в дебаг режимі або через консоль браузера.';
$_['help_cache_model'] = 'Вкажіть роут моделі, яку потрібно закешувати (приклад - catalog/category/getCategories), потім після \' | \'вкажіть час кешування в секундах, потім після\' | \' вкажіть параметри $this->config->get() через \' , \', якщо вони потрібні (якщо це масив, то розділяйте параметри \' / \'), потім після \' | \' вкажіть параметри $this->session->data через \' , \', якщо вони потрібні (якщо це масив, то розділяйте параметри \' / \'), потім після \' | \' вкажіть параметри $this->request->cookie через \' , \', якщо вони потрібні (якщо це масив, то розділяйте параметри \' / \'), потім після \' | \' вкажіть параметри $this->request->get і $this->request->post через \' , \', якщо вони потрібні. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_cache_engine'] = 'За замовчуванням Buslik.<br />APC - це кеш кодів операцій та сховище даних за допомогою оперативної пам\'яті, підходить для тих, у кого немає php розширення OPCache;<br />APCu - це нова версія APC призначений лише для зберігання даних за допомогою оперативної пам\'яті. Рекомендується включати OpCache на сервері;<br />Buslik - те саме, що і файловий кеш, але дозволяє зберігати файли кешу розділяючи по папках залежно від роуту і т.д., тим самим прискорює пошук потрібного кеш файлу і дозволяє зберігати більшу кількість ;<br />Memcache - кешування даних в оперативній пам\'яті на основі хеш-таблиці;<br />Memcached - нова версія Memcache для кешування даних в оперативній пам\'яті на основі хеш-таблиці;<br />OpCache - те саме, що і Buslik, але зберігає кеш як php коду. Потрібно вдвічі більше дискового простору. Спочатку створюється php-код, потім другим проходом зберігається за алгоритмом php розширення OpCache;<br />Redis - те саме, що Memcached;<br />WinCache - це кешуючий модуль, що дозволяє збільшити швидкість роботи PHP-додатків на Windows і Windows Server . Обробник включає свій алгоритм роботи з даними з використанням оперативної та дискової пам\'яті;<br />xСache - включає свій алгоритм роботи з даними з використанням оперативної та дискової пам\'яті.';
$_['help_cache_engine_mine'] = 'Завантажте свій обробник кешу в папку system/library/bus_cache/ і пропишіть у цьому полі ім\'я файлу, тоді кеш сторінок, контролерів та моделей буде оброблятися вказаним обробником.';
$_['help_cache_oc'] = 'Якщо так, то кеш інших модулів буде контролюватись налаштуваннями Буслік Кеш.';
$_['help_cache_expire'] = 'За замовчуванням 3600 секунд. Час життя кешу задається в секундах.';
$_['help_cache_expire_controller'] = 'За замовчуванням 3600 секунд. Час життя кешу задається в секундах.';
$_['help_cache_expire_model'] = 'За замовчуванням 3600 секунд. Час життя кешу задається в секундах.';
$_['help_cache_expire_all'] = 'За замовчуванням 36000 секунд. Час життя кешу задається в секундах.';
$_['help_cache_size_limit'] = 'За замовчуванням 0 - без обмежень. Обмеження створення кешу за розміром задається у Мегабайтах. При досягненні ліміту інший кеш буде кешуватися на 5 хвилин, а якщо пам\'ять закінчиться, то не кешуватиме.';
$_['help_cache_count'] = 'Для оброблювача Буслік і OpCache вкажіть кількість кешу, яку потрібно створити при кешуванні чогось. Коли один кеш файл зайнятий одним користувачем, іншому буде віддана інша копія. Якщо доступних копій немає, то кеш для даного користувача працювати не буде (вважатиметься, що кеша немає). Візьміть до уваги, що місце на диску буде потрібно в стільки разів більше, ніж вкажіть у цьому полі.';
$_['help_pagespeed_status'] = 'Включення оптимізації має прискорити віддачу контенту тим самим полюбити ваш сайт із пошуковими роботами, а отже позиції в пошуковій видачі мають стати вищими.';
$_['help_pagespeed_onrot'] = 'Вкажіть роут або його keyword (seo_url) сторінки для точної роботи. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_pagespeed_rot'] = 'Вкажіть роут або його keyword (seo_url) сторінки для виключення з оптимізації. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_pagespeed_image_lazy_load'] = 'Виберіть варіант підвантаження зображень та кадр вікон.';
$_['help_pagespeed_image_first_boot_status'] = 'Увімкнення цієї функції дозволить прискорити перше завантаження сторінки, коли ресайз зображень ще не створений, буде замінено посилання на зображення та генерувати зображення буде за окремим запитом.';
$_['help_pagespeed_image_first_boot_onrot'] = 'Вкажіть роут або його keyword (seo_url) сторінки для точної роботи First Boot. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_pagespeed_image_first_boot_rot'] = 'Вкажіть роут або його keyword (seo_url) сторінки для виключення з оптимізації First Boot. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_pagespeed_image_w_h'] = 'Включення цієї функції додаватиме атрибути ширини та висоти до всіх зображень, у яких у назвах є їх розміри, наприклад, image-100х100.jpg';
$_['help_pagespeed_image_webp_status'] = 'Якщо так, то буде включена підтримка webp зображень. Вимкніть інші модулі такого функціоналу.';
$_['help_pagespeed_image_webp_convert'] = 'Виберіть варіант бібліотеки для створення webp зображень.';
$_['help_pagespeed_image_webp_quality'] = 'Вкажіть якість зображень,<br />100 - хороша якість (без стиснення),<br />0 - погана якість.';
$_['help_pagespeed_html_lazy_load'] = 'Вкажіть роут або keyword (seo_url) сторінки, потім після \' | \' вкажіть роут контролера який потрібно завантажити по скроллу (приклад - extension/module/category, його можна дізнатися над модулем на сторінці, що цікавить, в дебаг режимі), потім після \' | \' вкажіть module_id якщо він є (його можна дізнатися над модулем на сторінці, що цікавить в дебаг режимі), потім після \' | \' вкажіть номер завантаження (його можна дізнатися над модулем на сторінці, що цікавить в дебаг режимі), потім після \' | \' вкажіть ширину екрана більше якого почати завантажувати контролер, якщо потрібно обмежити до, то через \' - \' вкажіть ширину. data-busloadinglazy-id для скриптів можна дізнатися над модулем на сторінці, що цікавить, в дебаг режимі або через консоль браузера.';
$_['help_pagespeed_html_replace_before'] = 'Вкажіть роут або keyword (seo_url) сторінки, потім після \' | \' вкажіть рядок коду, який потрібно замінити, потім після \' | Вкажіть на який рядок замінити. Якщо хочете на всіх сторінках, то замість роуту вкажіть \' # \'. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'. Перенесення рядків замінюйте на [\r] або [\r][\n].';
$_['help_pagespeed_html_replace_after'] = 'Вкажіть роут або keyword (seo_url) сторінки, потім після \' | \' вкажіть рядок коду, який потрібно замінити, потім після \' | Вкажіть на який рядок замінити. Якщо хочете на всіх сторінках, то замість роуту вкажіть \' # \'. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'. Перенесення рядків замінюйте на [\r] або [\r][\n].';
$_['help_pagespeed_html_min'] = 'Виберіть варіанти стиснення html-коду.';
$_['help_pagespeed_html_min_tags'] = 'Вкажіть роут або keyword (seo_url) сторінки, потім після \' | \' вкажіть прапори regex що видаляти зліва від тега, потім після \' | \' вкажіть частину тега або тег повністю (якщо їх кілька, то розділяйте теги \' | \'). Якщо хочете на всіх сторінках, то замість роуту вкажіть \' # \'. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_pagespeed_css_replace_before'] = 'Вкажіть роут або keyword (seo_url) сторінки, потім після \' | \' вкажіть рядок коду, який потрібно замінити, потім після \' | \' Вкажіть на який рядок замінити. Якщо хочете на всіх сторінках, то замість роуту вкажіть \' # \'. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'. Перенесення рядків замінюйте на [\r] або [\r][\n].';
$_['help_pagespeed_css_replace_after'] = 'Вкажіть роут або keyword (seo_url) сторінки, потім після \' | \' вкажіть рядок коду, який потрібно замінити, потім після \' | Вкажіть на який рядок замінити. Якщо хочете на всіх сторінках, то замість роуту вкажіть \' # \'. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'. Перенесення рядків замінюйте на [\r] або [\r][\n].';
$_['help_pagespeed_css_min'] = 'Виберіть варіант стиснення css-коду. Якщо увімкнено, всі файли стилів, які обробляє OpenCart за стандартом, будуть з\'єднані в один файл і максимально стиснуті.';
$_['help_pagespeed_css_min_links'] = 'Додайте посилання на css стиль, який не потрапив у загальний файл стилів (для роботи з інших сайтів, вкажіть посилання також у полі для скачування). Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то перед посиланням встановіть \' ; \'. Якщо ви хочете вказати свої атрибути, то після посилання встановіть \' | \' і впишіть атрибути, наприклад, catalog/style.css|type=&quot;text/css&quot; rel=&quot;preload&quot;<br />Також можна вказати на початку посилання наступні параметри (атрибути мають вгору над параметрами, крім параметрів переміщення):<br />[header] - відправити посилання в самий верх сайту;<br />[footer] - відправити посилання в самий низ сайту; попередньо завантажити;<br />[prefetch] - просить браузер відкласти завантаження в кінець;<br />[dns-prefetch] - просить браузер заздалегідь виконати резолвінг DNS для домену;<br />[preconnect] - просить браузер заздалегідь підключитися до домену;<br />[event] - відкласти завантаження за подією будь-якої дії;<br />[event-2000] - відкласти завантаження за часом;<br />[critical] - цей стиль є критичним і його завантажити окремо, та найпершим (якщо такий стиль підготовлений вами, то можна не включати функцію створення критичних стилів);';
$_['help_pagespeed_css_min_download'] = 'Додайте посилання на css стиль, який потрібно завантажити на свій сайт (завантажує при збереженні налаштувань або чищення кеша, рекомендується спочатку зберегти поточні налаштування). Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то перед посиланням встановіть \' ; \'.';
$_['help_pagespeed_css_min_exception'] = 'Додайте посилання на css стиль, який хочете виключити та відправити по своєму шляху. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то перед посиланням встановіть \' ; \'. Якщо ви хочете вказати свої атрибути, то після посилання встановіть \' | \' і впишіть атрибути, наприклад, catalog/style.css|type=&quot;text/css&quot; rel=&quot;preload&quot;<br />Також можна вказати на початку посилання наступні параметри (атрибути мають вгору над параметрами, крім параметрів переміщення):<br />[header] - відправити посилання в самий верх сайту;<br />[footer] - відправити посилання в самий низ сайту; попередньо завантажити;<br />[prefetch] - просить браузер відкласти завантаження в кінець;<br />[dns-prefetch] - просить браузер заздалегідь виконати резолвінг DNS для домену;<br />[preconnect] - просить браузер заздалегідь підключитися до домену;<br />[event] - відкласти завантаження за подією будь-якої дії;<br />[event-2000] - відкласти завантаження за часом;<br />[critical] - цей стиль є критичним і його завантажити окремо, та найпершим (якщо такий стиль підготовлений вами, то можна не включати функцію створення критичних стилів);';
$_['help_pagespeed_css_min_font'] = 'Додайте посилання на шрифт або картинку на яку лається Pagespeed - просить, щоб завантажити. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то перед посиланням встановіть \' ; \'. Доменну сторонніх шрифтів автоматично буде встановлено підключення з атрибутами (dns-prefetch, preconnect).';
$_['help_pagespeed_css_min_convert'] = 'Вкажіть типи MIME коду файлів в url(), які потрібно перенести в окремий файл.';
$_['help_pagespeed_css_min_display'] = 'Увімкніть цю функцію, щоб 100% для шрифтів було встановлено властивість font-display, щоб не показувати невидимий текст.';
$_['help_pagespeed_css_inline_transfer'] = 'Виберіть варіант переміщення css-коду.<br />Вгору - відразу перед </head>;<br />Вниз - відразу перед </body>;<br />У файл стиснення - в самий низ файлу, який завантажується відразу;</head>;';
$_['help_pagespeed_css_inline_exception'] = 'Вкажіть роут або keyword (seo_url) сторінки, потім після \' | \' вкажіть рядок або частину рядка css-коду, тоді весь блок коду в &lt;style&gt;&lt;/style&gt; не буде зворушено функцією перенесення коду. Значення задається починаючи з нового рядка. Якщо хочете на всіх сторінках, то замість роуту вкажіть \' # \'. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_pagespeed_css_events'] = 'Вкажіть, за яких подій запускати css-код, за замовчуванням подія викликається 1 раз. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_pagespeed_css_critical'] = 'Включення цієї функції буде збирати необхідні стилі при першому завантаженні сторінки та відправляти на сервер, пізніше всі стилі завантажуватимуться за взаємодією. З метою безпеки збір стилів буде доступний під час завантаження сторінки адміністратором. Ця функція буде працювати тільки при включеному стисненні і рекомендується в такому разі не відкладати стилі за подією (навіть не має сенсу).';
$_['help_pagespeed_css_critical_all'] = 'Якщо так, то збираються стилі по всіх елементах сторінки.';
$_['help_pagespeed_css_critical_offset'] = 'Вкажіть кількість наскільки відсотків захоплювати елементи більше за ваш екран по висоті.';
$_['help_pagespeed_css_critical_time'] = 'Відстрочка часу спрацювання збирача стилів.';
$_['help_pagespeed_css_critical_elements'] = 'Вкажіть назву елементів (теги, класи, ідентифікатори), які потрібно помістити у файл критичних стилів з основного. Ця функція буде працювати при увімкненому стисненні і рекомендується в такому разі не відкладати стилі за подією. Значення вказується з нового рядка.';
$_['help_pagespeed_css_critical_links'] = 'Вкажіть посилання на сторінки, для яких потрібно створити критичні стилі. Критичні стилі залежать від роуту та назв стилів. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то перед посиланням встановіть \'; \'.';
$_['help_pagespeed_css_style'] = 'Тут ви можете встановити стилі для адаптації стилів модуля під дизайн свого сайту. Вказувати теги &lt;style&gt;&lt;/style&gt; не потрібно.';
$_['help_pagespeed_js_replace_before'] = 'Вкажіть роут або keyword (seo_url) сторінки, потім після \' | \' вкажіть рядок коду, який потрібно замінити, потім після \' | Вкажіть на який рядок замінити. Якщо хочете на всіх сторінках, то замість роуту вкажіть \' # \'. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'. Перенесення рядків замінюйте на [\r] або [\r][\n].';
$_['help_pagespeed_js_replace_after'] = 'Вкажіть роут або keyword (seo_url) сторінки, потім після \' | \' вкажіть рядок коду, який потрібно замінити, потім після \' | Вкажіть на який рядок замінити. Якщо хочете на всіх сторінках, то замість роуту вкажіть \' # \'. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'. Перенесення рядків замінюйте на [\r] або [\r][\n].';
$_['help_pagespeed_js_min'] = 'Виберіть варіант стиснення js-коду. Якщо увімкнено, всі файли скриптів, які обробляє OpenCart за стандартом, будуть з\'єднані в один файл і максимально стиснуті.';
$_['help_pagespeed_js_min_links'] = 'Додайте посилання на js скрипт, який не потрапив до спільного файлу скриптів. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то перед посиланням встановіть \' ; \'. Якщо ви хочете вказати свої атрибути, то після посилання встановіть \' | \' і впишіть атрибути, наприклад, catalog/script.js|type=&quot;text/javascript&quot;<br />Також можна вказати на початку посилання наступні параметри (атрибути мають вгору над параметрами, крім параметрів переміщення):<br /> [header] - відправити посилання в самий верх сайту;<br />[footer] - відправити посилання в самий низ сайту;<br />[async] - просить браузер завантажити асинхронно;<br />[defer] - просить браузер завантажити відразу після побудови структури DOM;<br />[prelod] - просить браузер попередньо завантажити;<br />[prefetch] - просить браузер відкласти завантаження в кінець;<br />[dns-prefetch] - просить браузер заздалегідь виконати резолвінг DNS для домену;<br />[preconnect] - просить браузер заздалегідь підключитися до домену;<br />[event] - відкласти завантаження за подією будь-якої дії;<br />[event-2000] - відкласти завантаження за часом;';
$_['help_pagespeed_js_min_download'] = 'Додайте посилання на js скрипт, який потрібно завантажити на свій сайт (завантажує при збереженні налаштувань або чищення кеша, рекомендується спочатку зберегти поточні налаштування). Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то перед посиланням встановіть \' ; \'.';
$_['help_pagespeed_js_min_exception'] = 'Додайте посилання на js скрипт, який хочете виключити та відправити по своєму шляху. Наприклад, бувають скрипти, які повністю незалежні і не блокують рендер сторінки, тому не варто їх стискати з іншими, т.к. це може посилити оптимізацію. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то перед посиланням встановіть \' ; \'. Якщо ви хочете вказати свої атрибути, то після посилання встановіть \' | \' і впишіть атрибути, наприклад, catalog/script.js|type=&quot;text/javascript&quot;<br />Також можна вказати на початку посилання наступні параметри (атрибути мають вгору над параметрами, крім параметрів переміщення):<br /> [header] - відправити посилання в самий верх сайту;<br />[footer] - відправити посилання в самий низ сайту;<br />[async] - просить браузер завантажити асинхронно;<br />[defer] - просить браузер завантажити відразу після побудови структури DOM;<br />[prelod] - просить браузер попередньо завантажити;<br />[prefetch] - просить браузер відкласти завантаження в кінець;<br />[dns-prefetch] - просить браузер заздалегідь виконати резолвінг DNS для домену;<br />[preconnect] - просить браузер заздалегідь підключитися до домену;<br />[event] - відкласти завантаження за подією будь-якої дії;<br />[event-2000] - відкласти завантаження за часом;';
$_['help_pagespeed_js_inline_event'] = 'Вкажіть роут або keyword (seo_url) сторінки, потім після \' | \' вкажіть рядок або частину рядка js-коду, тоді весь блок коду в &lt;script&gt;&lt;/script&gt; буде обернуто на подію запуску за будь-якої взаємодії з сайтом. Значення задається починаючи з нового рядка. Якщо хочете на всіх сторінках, то замість роуту вкажіть \' # \'. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_pagespeed_js_inline_event_time'] = 'Вкажіть час у мілісекундах, якщо потрібно, щоб відкладені скрипти запустилися самі, не чекаючи будь-якої взаємодії з сайтом. Якщо вказано 0, автозапуск не працюватиме.';
$_['help_pagespeed_js_inline_transfer'] = 'Виберіть варіант переміщення js-коду.<br />Вгору - відразу перед </head>;<br />Вниз - відразу перед </body>;<br />У файл стиснення - в самий низ файлу, який завантажується відразу.';
$_['help_pagespeed_js_inline_transfer_onrot'] = 'Вкажіть роут або keyword (seo_url) сторінки, потім після \' | \' вкажіть рядок або частину рядка js-коду, тоді весь блок коду в &lt;script&gt;&lt;/script&gt; буде переноситись (При заповненні параметри виключення діяти не будуть). Значення задається починаючи з нового рядка. Якщо хочете на всіх сторінках, то замість роуту вкажіть \' # \'. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_pagespeed_js_inline_exception'] = 'Вкажіть роут або keyword (seo_url) сторінки, потім після \' | \' вкажіть рядок або частину рядка js-коду, тоді весь блок коду в &lt;script&gt;&lt;/script&gt; не буде зворушено функцією перенесення коду. Значення задається починаючи з нового рядка. Якщо хочете на всіх сторінках, то замість роуту вкажіть \' # \'. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_pagespeed_js_events'] = 'Вкажіть при яких подіях запускати js-код, за замовчуванням подія викличеться 1 раз. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_pagespeed_js_script'] = 'Тут ви можете встановити скрипти для адаптації стилів модуля під дизайн свого сайту. Вказувати теги &lt;script&gt;&lt;/script&gt; не потрібно.';
$_['help_database_status'] = 'Після проведення робіт вимкніть. При включенні з боку фронту прийматиметься робочий GET параметр \'bus_cache_database\' зі спеціальними значеннями для відключення кешу та виведення необхідної інформації швидкості роботи замість html коду з імітацією гостя, авторизованого користувача та адміністратора.';
$_['help_database_links'] = 'Вкажіть повне посилання на свій сайт. Значення задається починаючи з нового рядка. Якщо не хочете видаляти, то на початку рядка встановіть \' ; \'.';
$_['help_database_columns'] = 'Вкажіть стовпець, який потрібно індексувати, потім після \' | \' вкажіть розмір якщо потрібно. Значення задається з нового рядка.';
$_['help_cron_pregeneration'] = 'Якщо так, то буде працювати прегенерація кешу по крону або ручному запуску.';
$_['help_cron_pregeneration_query_count'] = 'Вкажіть скільки робити запитів на секунду. Рекомендується дивитися навантаження сервера для оцінки кількості. Також потужності сервера просто не дозволять робити велику кількість запитів.';
$_['help_support_stats_status'] = 'Якщо так, то при відвідуванні налаштувань модуля буде здійснюватися підрахунок розміру та кількість файлів на сайті. Статистика кешується на 10 хвилин.';
$_['help_support_disc_size_limit'] = 'Вкажіть доступний розмір диска сервера в Мегабайтах. За замовчуванням 0 – розмір всього диска сервера. Це максимальний розмір кешу та зображень WebP.';
$_['help_support_disc_warning'] = 'Якщо так, то для адміністратора при вході в адмін панель буде виводитися повідомлення.';
$_['help_support_session_fix'] = 'Якщо так, плодування сесій буде припинено. OpenCart має проблему створення сесій, якщо сайт відвідує користувач не сесії, в результаті при кожному відвідуванні створюється нова сесія. Функція робить так, що зберігає IP користувача і не дає OpenCart створювати сесію. Файл блокування зберігається в папці сесій (якщо воно є) або кешу.';
$_['help_support_debug'] = 'Якщо так, то для адміністратора над шапкою сайту буде виводитися інформація про час завантаження сторінки, також кеш почне діяти.';

// Doc
$_['doc'] = '<b>Всі значення, укладені в лапки, розумійте без пробілів усередині (приклад: \' | \' отже => \'|\'). Також не допускайте залишення в налаштуваннях порожніх рядків, щоб модуль не виконував зайві умови перевірки. Всі налаштування наводяться в єдиний стиль написання, але будьте пильні та поглядайте в інструкцію при наведенні на гурток зі знаком питання.</b><br /><br /><b>Роут</b> - це значення GET параметра в адресній рядку браузера після знака \' = \' (приклад: route=product/category => product/category), або під час завантаження контролера в коді перший параметр (приклад: $this->load->controller(\'product/category\') => product/category), або під час завантаження моделі (приклад: $this->model_catalog_category->getCategories() => catalog/category/getCategories). В OpenCart 4 перед функцією контролера вже ставиться \' | \' або \' . \', але ви все одно ставте \' / \'.<br />Роут і keyword сторінки можна дізнатися при включенні дебаг режиму в самому вгорі. <b>Роутом може бути також інший параметр зі стовпця query таблиці oc_url_alias, oc_seo_url (коли в рядку браузера немає роуту, а є keyword замість роуту product/category буде, наприклад, path=20_27) - цю поведінку планується змінити в майбутньому (можливе роути через кому, наприклад, для кешування категорій product/category,path=,category_id=)</b>.<br /><br />
Рекомендую використовувати цей <a href="https://liveopencart.ru/index.php?route=product/product&product_id=2519" rel="noreferrer noopener">модуль</a> та вказати там посилання:<br />< br />
Чищення кешу HTML, DATA: https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&caches=1<br /><br />
Чищення кешу TWIG:<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&twig=1<br /><br />
Чищення кешу HTML, DATA + CSS, JS:<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&minify= 1<br /><br />
Чищення кешу HTML, DATA + IMAGES:<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&images=1< br /><br />
Чищення кешу HTML, DATA + UPDATE MODIFICATIONS, EVENTS:<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&modifications=1<br /><br />
Чищення LOGS:<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&logs=1<br /><br />
Чистка VIEW PRDOCUTS (переглянуті товари):<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&view_products=1<br /><br />
Чищення CUSTOMER SEARCH QUERY (пошукові запити): https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&customer_search=1<br /><br />
Чистка CUSTOMER BLOG SEARCH QUERY (пошукові запити по блогу OpenCart.Pro 2.3.0.2.6): https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token ]&redirect=[route]&customer_blog_search=1<br /><br />
Чищення CUSTOMER ACTIVITY (інформація про активність користувачів):<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&customer_activity=1< br /><br />
Чистка CUSTOMER AND API SESSION (file or DB) (сесійні дані користувачів та підключень по REST API OpenCart): https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token= [user_token]&redirect=[route]&customer_session=1<br /><br />
Чистка GUEST CART SESSION (сесійні дані кошика гостей):<br />https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&cart_session=1 <br /><br />';
$_['doc_status'] = '<b>Статус</b> - це стан роботи модуля або його функціоналу.<br />Увімкнено - всі функції модуля будуть працездатні.<br />Відключено - всі функції модуля будуть непрацездатні. <br />Між змінами статусу та збереження налаштувань буде чиститися кеш OpenCart в system/storage/cache, оновлюватися модифікатори та/або події.<br />Модифікатори та/або події модуля в залежності від статусу будуть включатися та вимикатися.' ;
$_['doc_store'] = '<b>Магазин</b> - це стан роботи модуля або його функціоналу на сторінках вибраного магазину.<br />Список магазинів розташований в Адмін панель/Система/Налаштування. Включення роботи визначається встановленням галочки.';
$_['doc_cache_status'] = '<b>Включити кешування сторінок</b> - це стан роботи функціоналу модуля пов\'язані з кешуванням сторінок.<br />Так - функції кешу сторінок будуть працездатні.<br />Ні - функції кеша сторінок будуть непрацездатними.<br />Функції, що стосуються цієї настройки, будуть зникати при відключеному статусі.<br />Не рекомендується кешувати сайт, якщо у вас накопичувальна пам\'ять HDD, а не SSD (NVMe). Загалом не орендуйте хостинг або сервер, якщо на ньому не встановлено NVMe.';
$_['doc_cache_con'] = '<b>Параметри config</b> - це параметри рядка або масиву, що одержуються з $this->config->get(). Різноманітність кешу за цими параметрами діятиме для кешу всіх сторінок, контролерів, моделей. Вручну потрібно відкривати вихідний код і відшукувати $this->config->get() який може бути різним за певних умов (тобто потрібно створювати новий кеш при зміні $this->config->get()).';
$_['doc_cache_ses'] = '<b>Параметри session</b> - це параметри масиву, що отримуються з $this->session->data. Різноманітність кешу за цими параметрами діятиме для кешу всіх сторінок, окрім кешу контролерів, моделей. Вручну потрібно відкривати вихідний код і відшукувати $this->session->data який може бути різним за певних умов (тобто потрібно створювати новий кеш при зміні $this->session->data).';
$_['doc_cache_cok'] = '<b>Параметри cookie</b> - це параметри масиву, одержувані з $this->request->cookie. Різноманітність кешу за цими параметрами діятиме для кешу всіх сторінок, окрім кешу контролерів, моделей. Вручну потрібно відкривати вихідний код і відшукувати $this->request->cookie, який може бути різним за певних умов (тобто потрібно створювати новий кеш при зміні $this->request->cookie).';
$_['doc_cache_par'] = '<b>Параметри обмеження</b> - це параметри масиву, одержувані з $this->request->get і $this->request->post. Обмеження кешу за цими параметрами діятиме для кешу всіх сторінок, крім кешу контролерів, моделей. Вручну потрібно відкривати вихідний код і відшукувати $this->request->get ($_GET) і $this->request->post ($_POST) який може бути різним за певних умов (тобто потрібно створювати новий кеш при зміні $this ->request->get і $this->request->post).';
$_['doc_cache_onrot'] = '<b>Параметри роботи</b> - ця функція відповідає за кешування сторінок цілком для вузького налаштування (можливість налаштувати кеш для окремих сторінок по роуту та keyword, вказати індивідуальні налаштування: час кешу, параметри config , session, cookie, get та post для різноманітності кешу).';
$_['doc_cache_rot'] = '<b>Параметри виключення</b> - ця функція відповідає за виключення кешування сторінок повністю по роуту та keyword.';
$_['doc_cache_customer'] = '<b>Кешувати для авторизованих користувачів?</b> - ця функція відповідає за різноманітність кешу сторінок згідно $this->customer->isLogged(). Якщо тонка кешування сторінок не налаштована повністю, не вмикайте цю функцію.';
$_['doc_cache_cart'] = '<b>Кешувати кошик</b> - ця функція відповідає за кешування кошика $this->cart->getProducts().';
$_['doc_cache_cart_count'] = 'Кешувати за наявності товару в кошику</b> - ця функція відповідає за різноманітність кешу сторінок згідно $this->cart->getProducts().';
$_['doc_cache_controller'] = '<b>Кешування функцій контролерів</b> - ця функція відповідає за кешування контролерів, що завантажуються в коді через $this->load->controller();. Для кожного контролера можна вказати індивідуальні налаштування: час кешу, параметри config (за замовчуванням бере із загальних налаштувань), session, cookie, get та post для різноманітності кешу.';
$_['doc_cache_controller_ajax'] = '<b>Ajax завантаження функцій контролерів</b> - ця функція відповідає за завантаження контролерів ajax способом завантажуваних у коді через $this->load->controller();. Цю функцію потрібно використовувати, якщо потрібно приховати інформацію від пошукових роботів, коли через модуль на сторінці багато однакових слів або коли модуль не можна кешувати при кешуванні сторінки повністю.';
$_['doc_cache_model'] = '<b>Кешування функцій моделей</b> - ця функція відповідає за кешування моделей, що завантажуються в коді через $this->model_[шлях файлу моделі]->[назва функції]();. Для кожної моделі можна вказати індивідуальні налаштування: час кешу, параметри config (за замовчуванням бере із загальних налаштувань), session, cookie, get та post для різноманітності кешу.';
$_['doc_cache_engine'] = '<b>Обробник кешу</b> - ця функція відповідає за вибір обробника кешу, що постачаються модулем.<br />Обробник Буслік і OpCache - фаловий кеш - рекомендується для слабких хостингів, інші обробники застосовують додатково у своїх алгоритмах оперативну пам\'ять для кешування.';
$_['doc_cache_engine_mine'] = '<b>Свій обробник кешу</b> - ця функція відповідає за встановлення свого обробника кешу. Це може знадобитися, якщо у вас є своє рішення обробки кеша або потрібно, наприклад, змінити обробник кешу, що постачається з модулем, і запобігти перезапису коду при оновленні модуля.';
$_['doc_cache_oc'] = '<b>Контролювати кеш OpenCart</b> - ця функція відповідає за встановлення обробника кешу, як обробник за замовчуванням для стандартного кеша OpenCart.';
$_['doc_cache_expire'] = '<b>Час життя кешу OpenCart</b> - ця функція відповідає за встановлення часу стандартного кеша OpenCart, коли обробник встановлений для нього.';
$_['doc_cache_expire_controller'] = '<b>Час життя кешу контролерів</b> - ця функція відповідає за встановлення часу кешу контролерів за промовчанням.';
$_['doc_cache_expire_model'] = '<b>Час життя кешу моделей</b> - ця функція відповідає за встановлення часу кешу моделей за умовчанням.';
$_['doc_cache_expire_all'] = '<b>Час життя кешу сторінок</b> - ця функція відповідає за встановлення часу кешу сторінок за промовчанням.';
$_['doc_cache_size_limit'] = 'Розмір кешу</b> - ця функція відповідає за обмеження створення кеша, коли закінчується пам\'ять сервера або свого встановленого ліміту диска.';
$_['doc_cache_clear'] = '<b>Автоматична чистка кеша</b> - ця функція відповідає за чищення кеша у випадку обраних галочкою.';
$_['doc_pagespeed_status'] = '<b>Включити оптимізацію (PageSpeed)</b> - це стан роботи функціоналу модуля, що відносяться до оптимізації сторінок.<br />Так - функції оптимізації сторінок будуть працездатні.<br />Ні - функції оптимізації сторінок будуть непрацездатні.<br />Функції, що стосуються цієї настройки, будуть зникати при відключеному статусі.';
$_['doc_pagespeed_onrot'] = '<b>Параметри роботи</b> - ця функція відповідає за включення оптимізації сторінок по роуту та keyword, якщо на сторінці немає &lt;!DOCTYPE html&gt;';
$_['doc_pagespeed_rot'] = '<b>Параметри виключення</b> - ця функція відповідає за виключення з оптимізації сторінок по роуту та keyword, якщо через роботу модуля виникають різні помилки.';
$_['doc_pagespeed_image_lazy_load'] = "<b>Включити Lazy load зображень</b> - ця функція відповідає за встановлення атрибуту loading=\"lazy\" або bus-loading=\"lazy\" в теги &lt;img, &lt;iframe, &lt;frame. У деяких шаблонах необхідно через модифікатори або функціонал заміни в html-коді зробити заміну data-src на src (нативний варіант браузера) або data-busloadinglazy-src (універсальний варіант модуля).<br /><textarea class=\"form-control\">// api bus_loading_lazy.js
/*
busLoadingLazy.browser['name'] - отримати назву браузера
busLoadingLazy.browser['version'] - отримати версію браузера
busLoadingLazy.setting['browser']['name'] - запускати тільки для назви браузера (після виконання коду потрібно зняти обмеження)
busLoadingLazy.setting['browser']['version'] - запускати тільки для версії браузера та новіше (після виконання коду потрібно зняти обмеження)
busLoadingLazy.setting['elements'] - обробляти елементи сторінки, за умовчанням '[loading=\"lazy\"][data-busloadinglazy-src], [loading=\"lazy\"][data-busloadinglazy-id]'
busLoadingLazy.setting['element'] - обробляти елемент сторінки, за умовчанням ''
busLoadingLazy.setting['fps'] - частота дій будь-яких подій після яких спрацює ваш код у події busLoadingLazy, за замовчуванням 10
busLoadingLazy.setting['offsetTop'] - відстань від вікна браузера до елемента, який починає завантаження, за замовчуванням 50
busLoadingLazy.setting['width'] - мінімальна ширина для запуску елемента сторінки, за замовчуванням 0
busLoadingLazy.setting['lazy'] - примусове завантаження елемента за промовчанням false
busLoadingLazy.setting['start'] - почати завантаження елемента зі знайдених з номера за замовчуванням 0
busLoadingLazy.setting['quantity'] - обробити кількість елементів з усіх знайдених, за замовчуванням 10
busLoadingLazy.setting['exception'] - масив, що містить значення data-busloadinglazy-src і data-busloadinglazy-id для виключення з обробки, за замовчуванням {}

// Приклад:
window.addEventListener('busLoadingLazyBefore', function() {
	busLoadingLazy.setting['status'] = false; // Не завантажувати модуль
	busLoadingLazy.setting['start'] = 0; // почати завантажувати з
	busLoadingLazy.setting['quantity'] = 20; // завантажувати стільки
	busLoadingLazy.setting['exception'] = {'https://mysite.by/image.png':true}; // не завантажувати це зображення під час завантаження сторінки
	busLoadingLazy.start(); // завантажити ще зображення та iframe при завантаженні сторінки починаючи від 50 у кількості 5 штук
	busLoadingLazy.setting['exception'] = {}; // прибираємо винятки
});
*/

// скрипт bus_loading_lazy.js запускається при повному завантаженні сторінки за подією load т.к. у цей момент може отримати достовірну висоту тощо.
// виконати код по скроллу, ресайзу згідно з налаштуваннями частоти запуску busLoadingLazy.setting['fps']
window.addEventListener('busLoadingLazy', function() {
	/* ваш код */
});

// виконати код перед запуском скрипта busLoadingLazy
window.addEventListener('busLoadingLazyBefore', function() {
	/* ваш код */
});

// виконати код після запуску скрипта busLoadingLazy
window.addEventListener('busLoadingLazyAfter', function() {
	/* ваш код */
});

// Виконати код при появі відкладеного блоку
window.addEventListener('busLoadingLazyId-93fd76d319a4d202930d925a170c45ff', function() {
	/* ваш код */
});

// обробити html елемент зараз (якщо хочете завантажити на кліку)
busLoadingLazy.start({element:'[data-busloadinglazy-id=\93fd76d319a4d202930d925a170c45ff\']', lazy:true});

// Більш правильний варіант запуску на кліку
function myclick() {
	if ('busLoadingLazy' in window) {
		busLoadingLazy.start({element:'[data-busloadinglazy-id=\93fd76d319a4d202930d925a170c45ff\']', lazy:true});
	} else {
		window.addEventListener('busLoadingLazyBefore', function() {
			busLoadingLazy.start({element:'[data-busloadinglazy-id=\93fd76d319a4d202930d925a170c45ff\']', lazy:true});
		});
	}
}</textarea>";
$_['doc_pagespeed_image_first_boot_status'] = 'Посилання матиме захищений вигляд "https://mysite.by/?bus_cache_first_boot=qwert123" за допомогою функціоналу $this->encryption.';
$_['doc_pagespeed_image_w_h'] = '<b>Включити атрибути ширини та висоти</b> - ця функція відповідає за включення атрибут ширини та висоти у зображеннях. Якщо не були проставлені дані атрибути десь, то скористайтесь функціоналом заміни в HTML-коді.';
$_['doc_pagespeed_image_webp_status'] = '<b>Включити підджержку WebP зображень</b> - ця функція відповідає за включення підтримки webp формату (завантаження зображень у файл менеджер).<br />Функції, що стосуються цієї настройки, будуть зникати при вимкненому статусе.<br />Між змінами статусу та збереження налаштувань буде чиститися кеш OpenCart в system/storage/cache, оновлюватимуться модифікатори та(або) події.<br />Модифікатори та(або) події модуля в залежності від статусу включатимуться та вимикатимуться .';
$_['doc_pagespeed_image_webp_convert'] = '<b>Конвертувати зображення в WebP і назад</b> - ця функція відповідає за конвертацію png,jpg,gif зображень у webp і назад, якщо браузер не підтримує webp.<br />Рекомендується GD Version 2.2.5+ (у версії нижче немає підтримки прозорого фону та проблема з синім кольором - модуль ставить замість прозорості білий колір і вирішує проблему з відсутністю синього кольору) та php 7.1+ (у версії нижче відсутня перевірка типу IMAGETYPE_WEBP).';
$_['doc_pagespeed_image_webp_quality'] = 'Стиск WebP зображень</b> - ця функція відповідає за якість зображення при його створенні.';
$_['doc_pagespeed_html_lazy_load'] = '<b>Включити Lazy load html</b> - ця функція відповідає за обгортання html-коду контролера в &lt;div loading="lazy" data-busloadinglazy-id="93fd76d319a4d0 busloadinglazy-res="1200"&gt;&lt;noscript&gt;код контролера&lt;/noscript&gt;&lt;/div&gt;<br />За допомогою функціоналу заміни в html-коді можна загорнути в ці теги будь-який html-код, головне задати індивідуальний ідентифікатор .<br /><br />data-busloadinglazy-id - це ідентифікатор контролера по роуту та назві модуля.<br />data-busloadinglazy-res - це мінімальна ширина екрану для запуску модуля. Майте на увазі, що ширина екрану чисто для PageSpeed на мобільних телефонах з великою роздільною здатністю запускатиметься html-код.<br />
data-busloadinglazy-remove - це встановлюється модулем у вибраному контролері на заміну тега &lt;noscript&gt; для видалення при запуску скрипта bus_loading_lazy.js.<br /><br />При відкладанні каруселі, може знадобитися повторно запустити код каруселі - помістіть код запуску каруселі в код події появи html-коду при скролінгу. Код події дивіться у документації функції модуля вище.<br /><br />';
$_['doc_pagespeed_html_replace_before'] = '<b>Заміна в html-коді до стиснення</b> - ця функція відповідає за заміну в html-коді до його стиснення, щоб можна було підправити код для якого-небудь функціоналу.<br> />В основному потрібна заміна коли не вистачає якогось елемента в коді, через що після стиснення в браузері з\'являється помилка, або потрібно встановити атрибути ширини і висоти на зображення, або потрібно прибрати атрибут loading="lazy" і т.д. <br />Щоб прибрати у потрібних місцях loading="lazy" використовуйте модифікатори для встановлення позначаючого атрибута на потрібних зображеннях перед атрибутом src, щоб у модулі можна було до нього підчепитися.';
$_['doc_pagespeed_html_replace_after'] = '<b>Заміна в html-коді після стиснення</b> - ця функція відповідає за заміну в html-коді після його стиснення, щоб можна було підправити код для функціонала стиснення.<br /> В основному потрібна заміна коли не вистачає якогось елемента в коді, через що після стиснення в браузері з\'являється помилка, або потрібно встановити атрибути ширини і висоти на зображення, або потрібно прибрати атрибут loading="lazy" і т.д.<br> />Щоб прибрати у потрібних місцях loading="lazy" використовуйте модифікатори для встановлення позначаючого атрибута на потрібних зображеннях перед атрибутом src, щоб у модулі можна було до нього підчепитися.';
$_['doc_pagespeed_html_min'] = '<b>Стискати html-код</b> - ця функція відповідає за зменшення розміру сторінок шляхом видалення коментарів, зайвих прогалин, перенесення рядків.<br />Також для зменшення розміру використовуйте по можливості перенесення інлайн коду у файл стиснення та не поміщайте вихідний код svg зображень у код сторінки. Чим легше сторінка, тим менше пам\'яті потрібно на обробку та зберігання кешу.';
$_['doc_pagespeed_html_min_tags'] = '<b>Видалення відступів зліва від тегів</b> - ця функція відповідає за видалення відсутпів між &gt;&lt;, тобто ви вирішуєте між якими тегами і на якій сторінці можна видалити \s, \h,\t,\r,\n і т.д. згідно з правилами регулярних виразів у квадратних дужках [].';
$_['doc_pagespeed_css_replace_before'] = '<b>Заміна в css-коді до стиснення</b> - ця функція відповідає за заміну в css-коді до його стиснення, щоб можна було підправити код для якогось функціоналу.<br> />В основному потрібна заміна коли не вистачає якогось елемента в коді, через що кривиться дизайн сайту, або хочете щось видалити зайве.';
$_['doc_pagespeed_css_replace_after'] = '<b>Заміна в css-коді після стиснення</b> - ця функція відповідає за заміну в css-коді після його стиснення, щоб можна було підправити код для будь-якого функціоналу.<br> />В основному потрібна заміна коли не вистачає якогось елемента в коді, через що кривиться дизайн сайту, або хочете щось видалити зайве.';
$_['doc_pagespeed_css_min'] = '<b>Стискати css-код</b> - ця функція відповідає за зменшення розміру сторінок шляхом видалення коментарів, зайвих прогалин, перенесення рядків, збирання файлів в один.';
$_['doc_pagespeed_css_min_links'] = '<b>Посилання на css файли</b> - ця функція відповідає за об\'єднання файлів css в один файл. За замовчуванням збираються файли з $this->document->getStyles(), тому решту потрібно вказати вручну.';
$_['doc_pagespeed_css_min_download'] = '<b>Посилання на css файли для завантаження</b> - ця функція відповідає за збереження файлів css на свій сервер після збереження налаштувань модуля. Це корисно для сайту, оскільки зі свого сервера файл буде завантажуватися швидше.';
$_['doc_pagespeed_css_min_exception'] = '<B>Виняток зі стиснення css</b> - ця функція відповідає за виключення файлів css з об\'єднання в один файл які об\'єднуються автоматичний з $this->document->getStyles().';
$_['doc_pagespeed_css_min_font'] = '<b>Предзавантаження шрифтів або зображень</b> - ця функція відповідає за встановлення пріоритету завантаження для шрифтів та зображень, що дасть можливість мінімізувати скачки стилів і позитивно вплине на \'Cumulative Layout Shift\'.';
$_['doc_pagespeed_css_min_convert'] = '<b>Конвертація з коду у файл</b> - ця функція корисна, для зменшення розміру файлу стилів і дає можливість кешувати браузером такі файли.';
$_['doc_pagespeed_css_min_display'] = '<b>Font-Display</b> - ця функція відповідає за встановлення режиму роботи шрифтів.';
$_['doc_pagespeed_css_inline_transfer'] = '<b>Перемістити інлайн css-код</b> - ця функція відповідає за перенесення коду.';
$_['doc_pagespeed_css_inline_exception'] = '<b>Виняток із перенесення інлайн css-коду</b> - ця функція відповідає за виключення коду з перенесення.';
$_['doc_pagespeed_css_events'] = '<b>Події для запуску css-коду</b> - ця функція відповідає за запуск відкладеного css-коду (інлайн код та файли).';
$_['doc_pagespeed_css_critical'] = '<b>Включити збір критичних стилів</b> - ця функція відповідає за збирання необхідних стилів для зазначених сторінок. Дана можливість зменшує час завантаження для \'First Contentful Paint\' та \'Largest Contentful Paint\'.';
$_['doc_pagespeed_css_critical_all'] = '<b>Збирати стилі по всіх елементах</b> - ця функція відповідає за збір стилів без урахування висоти екрана.';
$_['doc_pagespeed_css_critical_offset'] = '<b>Відсічення збору від висоти екрану</b> - ця функція відповідає за коригування висоти сторінки сайту для збирання критичних стилів.';
$_['doc_pagespeed_css_critical_time'] = '<b>Відстрочка часу</b> - ця функція відповідає за запуск збору стилів через необхідний проміжок часу.';
$_['doc_pagespeed_css_critical_elements'] = '<b>Елементи стилів</b> - ця функція відповідає за вказівку додаткових елементів стилів, якщо не були з якоїсь причини підхоплені. Елементи стилів означає ідентифікатор стилю (.class, #id, [attribute], tag або повна назва стилю).';
$_['doc_pagespeed_css_critical_links'] = '<b>Посилання на сторінки збору критичних стилів</b> - посилання необхідні, щоб модуль знав для яких сторінок потрібно створити критичні стилі.';
$_['doc_pagespeed_css_style'] = '<b>Стиль</b> - це поле для розміщення свого css-коду. Файл коду завантажуватиметься після основних.';
$_['doc_pagespeed_js_replace_before'] = '<b>Заміна в js-коді до стиснення</b> - ця функція відповідає за заміну в js-коді до його стиснення, щоб можна було підправити код для будь-якого функціоналу.<br> />В основному потрібна заміна коли не вистачає якогось елемента в коді, через що після стиснення в браузері з\'являється помилка, або хочете щось видалити зайве.';
$_['doc_pagespeed_js_replace_after'] = '<b>Заміна в js-коді після стиснення</b> - ця функція відповідає за заміну в js-коді після його стиснення, щоб можна було підправити код для будь-якого функціоналу.<br> />В основному потрібна заміна коли не вистачає якогось елемента в коді, через що після стиснення в браузері з\'являється помилка, або хочете щось видалити зайве.';
$_['doc_pagespeed_js_min'] = '<b>Стискати js-код</b> - ця функція відповідає за зменшення розміру сторінок шляхом видалення коментарів, зайвих прогалин, перенесення рядків, збирання файлів в один';
$_['doc_pagespeed_js_min_links'] = '<b>Посилання на js файли</b> - ця функція відповідає за об\'єднання файлів js в один файл. За замовчуванням збираються файли з $this->document->getScripts(), тому решту потрібно вказати вручну.';
$_['doc_pagespeed_js_min_download'] = '<b>Посилання на js файли для завантаження</b> - ця функція відповідає за збереження файлів js на свій сервер після збереження налаштувань модуля. Це корисно для сайту, оскільки зі свого сервера файл буде завантажуватися швидше.';
$_['doc_pagespeed_js_min_exception'] = '<B>Виняток зі стиснення js</b> - ця функція відповідає за виключення файлів js з об\'єднання в один файл які об\'єднуються автоматичний з $this->document->getScripts().';
$_['doc_pagespeed_js_inline_event'] = "<b>Відкласти завантаження інлайн js-коду</b> - ця функція відповідає за обгортання інлайн js-коду в window.addEventListener('busCache', function() {інлайн код}); У цей код можна повертати будь-який код завантаження якого потрібно відкласти за подіями вказаних у полі 'Події для запуску js-коду' Відкладати потрібно скрипти які заважають рендеру сторінки: метрики, різні чайти. /><textarea class=\"form-control\">// виконати код, якщо при оновленні сторінки проскролило вниз
window.addEventListener('load', function() {
	if ('busCache' in window && busCache.status == false) {
		if (document.documentElement && document.documentElement.scrollTop > 0 || document.body.scrollTop > 0) {
			busCache.start();
		}
	}
});

// приклад підключення метрики, щоб можна було відкласти скрип у полі 'Посилання на js файли'
<!-- Google Tag Manager -->
<script async src=\"https://www.googletagmanager.com/gtm.js?id=GTM-XXXXXX&l=dataLayer\" type=\"text/javascript\"></script>
<script type=\"text/javascript\">
	window.dataLayer = window.dataLayer | [];
	window.dataLayer.push({'gtm.start':new Date().getTime(),event:'gtm.js'});
</script>
<!-- Google Tag Manager -->
<!-- Google Tag Manager -->
<noscript><iframe src=\"https://www.googletagmanager.com/ns.html?id=GTM-XXXXXX\" height=\"0\" width=\"0\" style=\"display: none; visibility: hidden \"></iframe></noscript>
<!-- Google Tag Manager -->

<!-- Global site tag (gtag.js) - Google Analytics -->
<script async src=\"https://www.googletagmanager.com/gtag/js?id=UA-XXXXXXXX-X\" type=\"text/javascript\"></script>
<script type=\"text/javascript\">
	window.dataLayer = window.dataLayer | [];
	function gtag(){window.dataLayer.push(arguments);}

	gtag('js', new Date());
	gtag('config', 'UA-XXXXXXXX-X');
</script>
<!-- Global site tag (gtag.js) - Google Analytics -->

<!-- Yandex.Metrika -->
<script async src=\"https://mc.yandex.ru/metrika/tag.js\" type=\"text/javascript\"></script>
<script type=\"text/javascript\">
	//https://yandex.ru/support/metrica/code/counter-initialize.html
	window.ym = window.ym | function() {(window.ym.a = window.ym.a || []).push(arguments);};
	window.ym.l = 1*new Date();

	ym(00000000, \"init\", {
		clickmap:true,
		trackLinks:true,
		accurateTrackBounce:10
	});
</script>
<!-- Yandex.Metrika -->
<!-- Yandex.Metrika -->
<noscript><div><img src=\"https://mc.yandex.ru/watch/00000000\" style=\position:absolute; left:-9999px;\" alt=\"\" </div></noscript>
<!-- Yandex.Metrika -->

// запускаємо скрипт коли він справді потрібен
if (!('owlCarousel' in $)) {
    (function($, window, document, undefined) {
        $.fn.owlCarousel = function(setting) {
            var self = this;
            return busCache.loadScript('catalog/view/javascript/jquery/owl-carousel/owl.carousel.min.js', function() {
                return $(self).owlCarousel(setting);
            });
        };
    })($, window, document);
}</textarea>";
$_['doc_pagespeed_js_inline_event_time'] = '<b>Час до автозапуску інлайн js-коду</b> - ця функція відповідає за встановлення часу відстрочення спрацювання зазначених подій у полі \'Події для запуску js-коду\'.';
$_['doc_pagespeed_js_inline_transfer'] = '<b>Перемістити інлайн js-код</b> - ця функція відповідає за';
$_['doc_pagespeed_js_inline_transfer_onrot'] = '<b>Переносити інлайн js-код</b> - ця функція відповідає за';
$_['doc_pagespeed_js_inline_exception'] = '<b>Виняток із перенесення інлайн js-коду</b> - ця функція відповідає за';
$_['doc_pagespeed_js_events'] = '<b>Події для запуску js-коду</b> - ця функція відповідає за запуск відкладеного js-коду (інлайн код та файли).';
$_['doc_pagespeed_js_script'] = '<b>Скрипт</b> - це поле для розміщення свого js-коду. Файл коду завантажуватиметься після основних.';
$_['doc_database_status'] = '<b>Режим налаштування</b> - це стан роботи модуля в режимі налаштування індексів бази даних. Не забувайте вимикати після проведення робіт.';
$_['doc_database_links'] = '<b>Посилання для перевірки, що цікавлять</b> - це список посилань за якими модуль буде проводити перевірку швидкості завантаження.';
$_['doc_database_tables'] = '<b>Таблиці</b> - ця функція відповідає за';
$_['doc_database_indexs'] = '<b>Індекси</b> - ця функція відповідає за';
$_['doc_database_columns'] = '<b>Стовпці</b> - ця функція відповідає за';
$_['doc_database_unique'] = '<b>Унікальний</b> - ця функція відповідає за';
$_['doc_database_unique_elements'] = '<b>Унікальних елементів</b> - ця функція відповідає за';
$_['doc_database_packed'] = '<b>Упакований</b> - ця функція відповідає за';
$_['doc_database_index'] = '<b>Індекс</b> - ця функція відповідає за';
$_['doc_database_index_name'] = '<b>Ім\'я індексу</b> - ця функція відповідає за';
$_['doc_database_index_key_block_size'] = '<b>Розмір блоку ключа</b> - ця функція відповідає за';
$_['doc_database_index_type'] = '<b>Тип</b> - ця функція відповідає за';
$_['doc_database_index_parser'] = '<b>Парсер</b> - ця функція відповідає за';
$_['doc_database_index_comment'] = '<b>Коментар</b> - ця функція відповідає за';
$_['doc_database_column'] = '<b>Стовпець</b> - ця функція відповідає за';
$_['doc_support_update'] = 'Якщо ви купили версію з технічною підтримкою - вказівка домену обов\'язково при покупці - інакше оновлення не отримати. Якщо ви купили версію без технічної підтримки, вкажіть у відповідне поле номер замовлення покупки. Якщо виявиться, що інший домен не ваш (інша юр. інформація на сайті порівняно з першим доменом чи ні даних взагалі для можливості перевірити), то оновлення не буде доступним. Якщо ви купили версію на право перепродажу, то вкажіть номер замовлення та надішліть автору модуля готовий код створення ключів на основі доменів ваших клієнтів, щоб на сервері автора проходила перевірка достовірності придбання (далі своїм клієнтам даєте номер замовлення та свій ключ – замість номера замовлення можна будь-який інший ідентифікатор - але його потрібно вказати замість домену (при купівлі модуля). Оновлення недоступне для тестових доменів.';
$_['doc_support_stats_status'] = '<b>Включити статистику</b> - ця функція відповідає за функції збору інформації, що показують розмір кешу в system/storage/cache, розмір зображень в image, розмір сесій у system/storage/session та oc_session...';
$_['doc_support_disc_size_limit'] = '<b>Ліміт пам\'яті диска</b> - ця функція відповідає за встановлення свого ліміту пам\'яті для кешу та зображень webp.';
$_['doc_support_disc_warning'] = '<b>Увімкнути попередження про брак пам\'яті</b> - ця функція відповідає за оповіщення адміністратора про брак пам\'яті під час відвідування головної сторінки адмін панелі.';
$_['doc_support_debug'] = '<b>Включити налагодження</b> - ця функція відповідає за інформування адміністратора про швидкість роботи модуля на стороні сайту.';
$_['doc_support_debug_log'] = '<b>Включити логування повільних сторінок</b> - ця функція відповідає за';

//Button
$_['button_files_clear'] = 'Видалити також файли модуля? - Якщо ні, просто оновіть сторінку від гріха. Звіт про видалення файлів дивіться у логах модифікаторів.';
$_['button_add'] = 'Додати';
$_['button_edit'] = 'Редагувати';
$_['button_delete'] = 'Видалити';
$_['button_copy'] = 'Скопіювати';
$_['button_update'] = 'Оновити';
$_['button_clear'] = 'Очистити';
$_['button_clear_cache'] = 'Очистити кеш';
$_['button_save'] = 'Зберегти';
$_['button_apply'] = 'Застосувати';
$_['button_apply_piecemeal'] = 'Застосувати частинами';
$_['button_export'] = 'Експорт';
$_['button_import'] = 'Імпорт';
$_['button_start'] = 'Запуск завантаження';
$_['button_continue'] = 'Продовження завантаження з місця зупинки';
$_['button_pause'] = 'Призупинення завантаження';
$_['button_restart'] = 'Перезапуск завантаження - почати спочатку';
$_['button_search'] = 'Знайти';
$_['button_restore'] = 'Відновити';
$_['button_view'] = 'Переглянути';

// Error
$_['error_permission'] = 'У вас недостатньо прав для внесення змін!';
$_['error_warning'] = 'Уважно перевірте форму на помилки!';
$_['error_install'] = 'Ніщо пайшло не так!';
$_['error_uninstall'] = 'Щось пайшло не так!';
$_['error_name'] = 'Назва повинна містити до 255 символів!';
$_['error_width'] = 'Вкажіть Ширину!';
$_['error_height'] = 'Вкажіть Висоту!';
$_['error_max_input_vars'] = '<b>Увага! Якщо перевищити ліміт параметра %s</b>, дані можуть не зберегтися. Збільште значення на сервері або зверніться з цим проханням до хостера для збільшення ліміту. Або скористайтеся кнопкою застосування частинами.<br>Ліміт на сервері: %s <br>Ліміт від модуля: %s - відсікання %s щоб уникнути втрати даних<br>Поточне значення: ';
$_['error_setting_import'] = 'Файл не містить налаштування модуля, імпорту відмовлено!';
$_['error_setting_import_format'] = 'Модуль не знає про такий формат, імпорту відмовлено! - модуль м\'яко вас послав.';
$_['error_not_required'] = 'Не потрібно!';
$_['error_cache_size_limit'] = '<b>Увага!</b> Буде перевищено ліміт пам\'яті для кешу! Новий кеш буде кешуватися на 5 хвилин.';
$_['error_support_disc_size_limit'] = '<b>Увага!</b> Перевищено ліміт пам\'яті для кешу! Кеш вимкнено.';
$_['error_curl'] = '<b>Увага!</b> Не встановлено бібліотеку curl.';
$_['error_update'] = '<b>Увага!</b> Помилка оновлення!%s';
$_['error_update_1'] = '<b>Увага!</b> Ви не є покупцем модуля або ліцензія ще не активована, оновленню відмовлено!';
$_['error_update_2'] = '<b>Увага!</b> Період технічної підтримки закінчено, оновленню відмовлено!';
$_['error_update_3'] = '<b>Увага!</b> Ви порушили ліцензійну угоду, оновленню відмовлено!';
$_['error_update_4'] = '<b>Увага!</b> Ви використовуєте актуальну версію!';
$_['error_update_clone'] = '<b>Увага!</b> Зафіксовано заміну даних, оновленню відмовлено!';

// Success
$_['success_install'] = '- успішно встановлений!';
$_['success_uninstall'] = ' - успішно видалено!';
$_['success_uninstall_data_base'] = '◄ База даних видалена ►: ';
$_['success_uninstall_modification'] = '◄ Модифікатор видалено ►: ';
$_['success_uninstall_folder'] = '◄ Папка видалена т.я. файлів немає ►: ';
$_['success_uninstall_file'] = '◄ Видалити файл ►: ';
$_['success_update'] = ' - успішно оновлено!';
$_['success_setting'] = 'Налаштування успішно змінено!';
$_['success_setting_apply'] = 'Налаштування успішно застосовані!';
$_['success_setting_save'] = 'Налаштування успішно збережено!';
$_['success_setting_new'] = 'Новий модуль успішно додано!';
$_['success_setting_redirect'] = 'Ви були перенаправлені на потрібну сторінку налаштувань!';
$_['success_setting_import'] = 'Налаштування модуля "%s" успішно імпортовані в модуль, вам залишилося їх застосувати!';
$_['success_add'] = 'Успішно додано!';
$_['success_delete'] = 'Успішно видалено!';
$_['success_clear'] = 'Успішно очищено!';