<?php
// *   Аўтар: "БуслікДрэў" ( https://buslikdrev.by/ )
// *   © 2016-2024; BuslikDrev - Усе правы захаваны.

eval(base64_decode('aWYgKCFpc3NldCgkdGhpcy0+ZGF0YVsnYnVzX2NhY2hlX3ZlcnNpb24nXSkpIHsNCgkkdGhpcy0+ZGF0YVsnYnVzX2NhY2hlX3ZlcnNpb24nXSA9ICcxLjAnOw0KCWlmICh2ZXJzaW9uX2NvbXBhcmUoVkVSU0lPTiwgJzQuMC4wJywgJz49JykpIHsNCgkJJGZpbGUgPSBESVJfRVhURU5TSU9OIC4gJ2J1c19jYWNoZS9hZG1pbi9jb250cm9sbGVyL21vZHVsZS9idXNfY2FjaGUucGhwJzsNCgl9IGVsc2VpZiAodmVyc2lvbl9jb21wYXJlKFZFUlNJT04sICcyLjMuMCcsICc+PScpKSB7DQoJCSRmaWxlID0gRElSX0FQUExJQ0FUSU9OIC4gJ2NvbnRyb2xsZXIvZXh0ZW5zaW9uL21vZHVsZS9idXNfY2FjaGUucGhwJzsNCgl9IGVsc2Ugew0KCQkkZmlsZSA9IERJUl9BUFBMSUNBVElPTiAuICdjb250cm9sbGVyL21vZHVsZS9idXNfY2FjaGUucGhwJzsNCgl9DQoJaWYgKGlzX2ZpbGUoJGZpbGUpKSB7DQoJCWluY2x1ZGVfb25jZSgkZmlsZSk7DQoJCSR0aGlzLT5kYXRhWydidXNfY2FjaGVfdmVyc2lvbiddID0gKGNsYXNzX2V4aXN0cygnQnVzQ2FjaGUnKSA/IChuZXcgQnVzQ2FjaGUobmV3IFJlZ2lzdHJ5KCkpKS0+dmVyc2lvbiA6ICR0aGlzLT5kYXRhWydidXNfY2FjaGVfdmVyc2lvbiddKTsNCgl9DQp9'));

// Heading
$_['heading_title']                              = '<b>Буслік Кэш <span style="color:limegreen">Full</span></b> v' . $this->data['bus_cache_version'];
$_['heading_description']                        = '';

// Tab
$_['tab_setting']                                = 'Настройки';
$_['tab_cache']                                  = 'Кэширование';
$_['tab_pagespeed']                              = 'PageSpeed';
$_['tab_image']                                  = 'Изображения';
$_['tab_html']                                   = 'Разметка шаблона - HTML';
$_['tab_css']                                    = 'Стили - CSS';
$_['tab_js']                                     = 'Скрипты - JS';
$_['tab_database']                               = 'Оптимизация базы данных';
$_['tab_export']                                 = 'Экспорт';
$_['tab_import']                                 = 'Импорт';
$_['tab_cron']                                   = 'Cron';
$_['tab_documentation']                          = 'Документация';
$_['tab_support']                                = 'Техническая поддержка';

// Text
$_['text_extension']                             = 'Расширения';
$_['text_module']                                = 'Модули';
$_['text_edit']                                  = 'Редактирование';
$_['text_min']                                   = 'От';
$_['text_max']                                   = 'До';
$_['text_yes']                                   = 'Да';
$_['text_no']                                    = 'Нет';
$_['text_enabled']                               = 'Включено';
$_['text_disabled']                              = 'Отключено';
$_['text_all']                                   = ' --- Все --- ';
$_['text_none']                                  = ' --- Не выбрано --- ';
$_['text_select']                                = ' --- Выберите --- ';
$_['text_select_all']                            = 'Выделить всё';
$_['text_unselect_all']                          = 'Снять выделение';
$_['text_width']                                 = 'Ширина';
$_['text_height']                                = 'Высота';
$_['text_install']                               = 'Установка модуля...';
$_['text_uninstall']                             = 'Удаление модуля...';
$_['text_uninstall_files']                       = 'Удаление файлов модуля...';
$_['text_uninstall_files_log']                   = 'Отчёт об удалении файлов модуля';
$_['text_ocmod_clear']                           = 'Чистка модификаторов...';
$_['text_ocmod_clearlog']                        = 'Чистка лога модификаторов...';
$_['text_ocmod_refresh']                         = 'Обновление модификаторов...';
$_['text_cache_clear']                           = 'Чистка кэша...';
$_['text_processing']                            = 'Обработка';
$_['text_loading']                               = 'Загрузка';
$_['text_start']                                 = 'Старт';
$_['text_continue']                              = 'Продолжить';
$_['text_pause']                                 = 'Пауза';
$_['text_restart']                               = 'Рестарт';
$_['text_link']                                  = 'Ссылка';
$_['text_default']                               = 'По умолчанию';
$_['text_guest']                                 = 'Гость';
$_['text_dir_1']                                 = 'Справа на лево';
$_['text_dir_2']                                 = 'Слева на право';
$_['text_path']                                  = 'Путь';
$_['text_no_results']                            = 'Нет данных';
$_['text_confirm']                               = 'Вы уверены?';
$_['text_version']                               = 'Версия';
$_['text_cache_status_2']                        = 'Да, если не кэшируются контроллеры и модели';
$_['text_cache_clear_blog_category']             = 'При редактировании категорий блога';
$_['text_cache_clear_blog_article']              = 'При редактировании статей блога';
$_['text_cache_clear_category']                  = 'При редактировании категорий';
$_['text_cache_clear_information']               = 'При редактировании информационных страниц';
$_['text_cache_clear_manufacturer']              = 'При редактировании производителей';
$_['text_cache_clear_product']                   = 'При редактировании товара';
$_['text_cache_clear_time']                      = 'По истечении установленного времени (не рекомендуется, но если жалко денег на память, то вам можно)';
$_['text_pagespeed_image_webp_convert_1']        = 'Генерировать через GD';
$_['text_pagespeed_image_webp_convert_2']        = 'Генерировать через ImageMagick';
$_['text_pagespeed_min_1']                       = 'Объединять файлы';
$_['text_pagespeed_min_2']                       = 'Убрать комментарии';
$_['text_pagespeed_min_3']                       = 'Убрать пробелы';
$_['text_pagespeed_min_4']                       = 'Убрать перенос строк';
$_['text_pagespeed_min_5']                       = 'Убрать <!-- //--> в инлайн скриптах';
$_['text_pagespeed_transfer_1']                  = 'Вверх';
$_['text_pagespeed_transfer_2']                  = 'Вниз';
$_['text_pagespeed_transfer_3']                  = 'В файл сжатия ссылка вверху';
$_['text_pagespeed_transfer_4']                  = 'В файл сжатия ссылка внизу';
$_['text_export_import_format_sql']              = 'SQL';
$_['text_export_import_format_json']             = 'JSON';
$_['text_export_import_format_csv']              = 'CSV';
$_['text_export_import_format_xls']              = 'XLS';
$_['text_export_import_format_xlsx']             = 'XLSX';
$_['text_export_import_format_xml']              = 'XML';
$_['text_export_import_format_yml']              = 'YML';
$_['text_export_import_copy_1']                  = 'Jet Cache v23+';
$_['text_export_import_copy_2']                  = 'XYz оптимизер v1.4+';
$_['text_export_import_copy_3']                  = 'Lighting';
$_['text_export_import_copy_4']                  = '';
$_['text_support_stats_loading']                 = 'Идёт загрузка статистики - ожидайте!';
$_['text_support_stats_success']                 = 'Статистика успешно загружена!';
$_['text_support_stats_danger']                  = 'Ошибка загрузки статистики!';
$_['text_support_cache_total']                   = 'Количество файлов кэша:';
$_['text_support_cache_size']                    = 'Размер файлов кэша:';
$_['text_support_cache_minify_total']            = 'Количество файлов кэша js и css:';
$_['text_support_cache_minify_size']             = 'Размер файлов кэша js и css:';
$_['text_support_image_total']                   = 'Количество всего файлов изображений:';
$_['text_support_image_size']                    = 'Размер всего файлов изображений:';
$_['text_support_image_cache_total']             = 'Количество ресайз копий изображений:';
$_['text_support_image_cache_size']              = 'Размер ресайз копий изображений:';
$_['text_support_session_total']                 = 'Количество файлов сессий:';
$_['text_support_session_size']                  = 'Размер файлов сессий:';
$_['text_support_session_db_total']              = 'Количество записей сессий в БД:';
$_['text_support_session_db_size']               = 'Размер записей сессий в БД:';
$_['text_support_session_cart_total']            = 'Количество записей сессий гостевых корзин в БД:';
$_['text_support_session_cart_size']             = 'Размер записей сессий гостевых корзин в БД:';
$_['text_support_disc_total']                    = 'Всего памяти на диске:';
$_['text_support_disc_free']                     = 'Свободного места на диске:';
$_['text_support_debug_2']                       = 'Да и пересоздавать кэш css, js';
$_['text_support_debug_3']                       = 'Да и показывать скорость контроллеров';
$_['text_support_debug_4']                       = 'Да и показывать скорость моделей';
$_['text_support_debug_5']                       = 'Да и показывать data-busloadinglazy-id';
$_['text_support_debug_6']                       = 'Да и показывать bus_ajax_id';
$_['text_author']                                = 'Автор: <a href="https://buslikdrev.by/" title="Товары ремесленного производства" rel="noreferrer noopener" target="_blank">БусликДрев</a>. Тех. поддержка: <a href="https://liveopencart.ru/buslikdrev" title="Техническая помощь по решению проблем связанные с модулем" rel="noreferrer noopener" target="_blank">ТУТ</a>.';
$_['text_corp']                                  = '© 2016-' . date('d.m.Y') . '; <a href="https://buslikdrev.by/" title="BuslikDrev" rel="noreferrer noopener" target="_blank">BuslikDrev</a> - Все права сохранены.';

// Entry
$_['entry_status']                               = 'Статус';
$_['entry_store']                                = 'Магазин';
$_['entry_cache_status']                         = 'Включить кэширование страниц';
$_['entry_cache_con']                            = 'Параметры config';
$_['entry_cache_ses']                            = 'Параметры session';
$_['entry_cache_cok']                            = 'Параметры cookie';
$_['entry_cache_par']                            = 'Параметры ограничения';
$_['entry_cache_onrot']                          = 'Параметры работы';
$_['entry_cache_rot']                            = 'Параметры исключения';
$_['entry_cache_customer']                       = 'Кэшировать для авторизованных пользователей?';
$_['entry_cache_cart']                           = 'Кэшировать корзину';
$_['entry_cache_cart_count']                     = 'Кэшировать при наличии товара в корзине';
$_['entry_cache_controller']                     = 'Кэширование функций контроллеров';
$_['entry_cache_controller_ajax']                = 'Ajax загрузка функций контроллеров';
$_['entry_cache_model']                          = 'Кэширование функций моделей';
$_['entry_cache_engine']                         = 'Обработчик кэша';
$_['entry_cache_engine_mine']                    = 'Свой обработчик кэша';
$_['entry_cache_oc']                             = 'Контролировать кэш OpenCart';
$_['entry_cache_expire']                         = 'Время жизни кэша OpenCart';
$_['entry_cache_expire_controller']              = 'Время жизни кэша контроллеров';
$_['entry_cache_expire_model']                   = 'Время жизни кэша моделей';
$_['entry_cache_expire_all']                     = 'Время жизни кэша страниц';
$_['entry_cache_size_limit']                     = 'Размер кэша';
$_['entry_cache_count']                          = 'Количество доступного кэша';
$_['entry_cache_clear']                          = 'Автоматическая чистка кэша';
$_['entry_pagespeed_status']                     = 'Включить оптимизацию (PageSpeed)';
$_['entry_pagespeed_onrot']                      = 'Параметры работы';
$_['entry_pagespeed_rot']                        = 'Параметры исключения';
$_['entry_pagespeed_image_lazy_load']            = 'Включить Lazy load изображений';
$_['entry_pagespeed_image_first_boot_status']    = 'Включить First Boot изображений';
$_['entry_pagespeed_image_first_boot_onrot']     = 'Параметры работы First Boot';
$_['entry_pagespeed_image_first_boot_rot']       = 'Параметры исключения First Boot';
$_['entry_pagespeed_image_w_h']                  = 'Включить атрибуты ширины и высоты';
$_['entry_pagespeed_image_webp_status']          = 'Включить подджержку WebP изображений';
$_['entry_pagespeed_image_webp_convert']         = 'Конвертировать изображения в WebP и обратно';
$_['entry_pagespeed_image_webp_quality']         = 'Сжатие WebP изображений';
$_['entry_pagespeed_html_lazy_load']             = 'Включить Lazy load html';
$_['entry_pagespeed_html_replace_before']        = 'Замена в html-коде до сжатия';
$_['entry_pagespeed_html_replace_after']         = 'Замена в html-коде после сжатия';
$_['entry_pagespeed_html_min']                   = 'Сжимать html-код';
$_['entry_pagespeed_html_min_tags']              = 'Удаление отступов слева от тегов';
$_['entry_pagespeed_css_replace_before']         = 'Замена в css-коде до сжатия';
$_['entry_pagespeed_css_replace_after']          = 'Замена в css-коде после сжатия';
$_['entry_pagespeed_css_min']                    = 'Сжимать css-код';
$_['entry_pagespeed_css_min_links']              = 'Ссылки на css файлы';
$_['entry_pagespeed_css_min_download']           = 'Ссылки на css файлы для скачивания';
$_['entry_pagespeed_css_min_exception']          = 'Исключение из сжатия css';
$_['entry_pagespeed_css_min_font']               = 'Предзагрузка шрифтов или изображений';
$_['entry_pagespeed_css_min_convert']            = 'Конвертация из кода в файл';
$_['entry_pagespeed_css_min_display']            = 'Font-Display';
$_['entry_pagespeed_css_inline_transfer']        = 'Переместить инлайн css-код';
$_['entry_pagespeed_css_inline_exception']       = 'Исключение из переноса инлайн css-кода';
$_['entry_pagespeed_css_events']                 = 'Cобытия для запуска css-кода';
$_['entry_pagespeed_css_critical']               = 'Включить сбор критических стилей';
$_['entry_pagespeed_css_critical_all']           = 'Собирать стили по всем элементам';
$_['entry_pagespeed_css_critical_offset']        = 'Отсечка сбора от высоты экрана';
$_['entry_pagespeed_css_critical_time']          = 'Отсрочка времени';
$_['entry_pagespeed_css_critical_elements']      = 'Элементы стилей';
$_['entry_pagespeed_css_critical_links']         = 'Ссылки на страницы сбора критических стилей';
$_['entry_pagespeed_css_style']                  = 'Стиль';
$_['entry_pagespeed_js_replace_before']          = 'Замена в js-коде до сжатия';
$_['entry_pagespeed_js_replace_after']           = 'Замена в js-коде после сжатия';
$_['entry_pagespeed_js_min']                     = 'Сжимать js-код';
$_['entry_pagespeed_js_min_links']               = 'Ссылки на js файлы';
$_['entry_pagespeed_js_min_download']            = 'Ссылки на js файлы для скачивания';
$_['entry_pagespeed_js_min_exception']           = 'Исключение из сжатия js';
$_['entry_pagespeed_js_inline_event']            = 'Отложить загрузку инлайн js-кода';
$_['entry_pagespeed_js_inline_event_time']       = 'Время до автозапуска инлайн js-кода';
$_['entry_pagespeed_js_inline_transfer']         = 'Переместить инлайн js-код';
$_['entry_pagespeed_js_inline_transfer_onrot']   = 'Переносить инлайн js-код';
$_['entry_pagespeed_js_inline_exception']        = 'Исключение из переноса инлайн js-кода';
$_['entry_pagespeed_js_events']                  = 'Cобытия для запуска js-кода';
$_['entry_pagespeed_js_script']                  = 'Скрипт';
$_['entry_database_status']                      = 'Режим настройки';
$_['entry_database_speed_site']                  = 'Проверить скорость сайта';
$_['entry_database_links']                       = 'Интересующие ссылки для проверки';
$_['entry_database_tables']                      = 'Таблицы';
$_['entry_database_indexs']                      = 'Индексы';
$_['entry_database_columns']                     = 'Столбцы';
$_['entry_database_unique']                      = 'Уникальный';
$_['entry_database_unique_elements']             = 'Уникальных элементов';
$_['entry_database_packed']                      = 'Упакован';
$_['entry_database_index']                       = 'Индекс';
$_['entry_database_index_name']                  = 'Имя индекса';
$_['entry_database_index_key_block_size']        = 'Размер блока ключа';
$_['entry_database_index_type']                  = 'Тип';
$_['entry_database_index_parser']                = 'Парсер';
$_['entry_database_index_comment']               = 'Комментарий';
$_['entry_database_column']                      = 'Столбец';
$_['entry_cron_pregeneration']                   = 'Включить прегенерацию кэша';
$_['entry_cron_pregeneration_query_count']       = 'Количество запросов в секунду';
$_['entry_documentation_status']                 = 'Я получил диплом Буслік';
$_['entry_support_update']                       = 'Установка обновлений';
$_['entry_support_update_order_id']              = 'Номер заказа';
$_['entry_support_update_key']                   = 'Лицензионный ключ';
$_['entry_support_stats_status']                 = 'Включить статистику';
$_['entry_support_disc_size_limit']              = 'Лимит памяти диска';
$_['entry_support_disc_warning']                 = 'Включить предупреждение о не хватке памяти';
$_['entry_support_session_fix']                  = 'Включить фикс заполнения сессий';
$_['entry_support_debug']                        = 'Включить отладку';
$_['entry_support_debug_log']                    = 'Включить логирование медленных страниц';

// Help
$_['help_status']                                = 'Если отключено, то весь функционал ниже будет отключён.';
$_['help_store']                                 = 'Выберите магазины в которых будет работать модуль.';
$_['help_cache_status']                          = 'Если да, то будут кэшироваться страницы целиком.';
$_['help_cache_con']                             = 'Укажите параметры $this->config->get для разнообразия кэша. Если нужный параметр в массиве, то указывайте каждый параметр массива через \' | \', например, $this->config->get(\'products\')[\'total\'] =&gt; products|total. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_cache_ses']                             = 'Укажите параметры $this->session->data для разнообразия кэша. Значение задаётся начиная с новой строки. Если нужный параметр в массиве, то указывайте каждый параметр массива через \' | \', например, $this->session->data[\'products\'][\'total\'] =&gt; products|total. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_cache_cok']                             = 'Укажите параметры $this->request->cookie для разнообразия кэша. Значение задаётся начиная с новой строки. Если нужный параметр в массиве, то указывайте каждый параметр массива через \' | \', например, $this->request->cookie[\'products\'][\'total\'] =&gt; products|total. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_cache_par']                             = 'Укажите параметры $this->request->get и $this->request->post для ограничения кэша в пределах этих параметров (то есть другие параметры будут обрезаться и отдавать этим параметрам кэш разрешённых). Значение задаётся начиная с новой строки. Если не нужно ограничивать, то оставьте поле пустым. Если хотите, чтобы кэш не работал для запрещённых параметров, то первой строкой установите \' cache_off \'. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_cache_onrot']                           = 'Укажите роут или его keyword (seo_url) страницы для точной работы (При заполнении конфигурации и сессий действовать основные настройки не будут), потом после \' | \' укажите время кэширования в секундах, потом после \' | \' укажите параметры $this->config->get() через \' , \', если они нужны, потом после \' | \' укажите параметры $this->session->data через \' , \', если они нужны (если это массив, то разделяйте параметры \' / \'), потом после \' | \' укажите параметры $this->request->cookie через \' , \', если они нужны (если это массив, то разделяйте параметры \' / \'), потом после \' | \' укажите параметры $this->request->get и $this->request->post через \' , \', если они нужны (если это массив, то разделяйте параметры \' / \'). Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_cache_rot']                             = 'Укажите роут или его keyword (seo_url) страницы для исключения из кэша. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_cache_customer']                        = 'Кэшировать для авторизованных пользователей?';
$_['help_cache_cart']                            = 'Если да, то корзина будет кэшироваться для каждого пользователя на время хранения кэша контроллеров.';
$_['help_cache_cart_count']                      = 'Укажите максимальное количество товаров в корзине при котором кэширование страниц будет работать.';
$_['help_cache_controller']                      = 'Укажите роут контроллера который нужно закэшировать (пример - extension/module/category), потом после \' | \' укажите время кэширования в секундах, потом после \' | \' укажите параметры $this->config->get() через \' , \', если они нужны (если это массив, то разделяйте параметры \' / \'), потом после \' | \' укажите параметры $this->session->data через \' , \', если они нужны (если это массив, то разделяйте параметры \' / \'), потом после \' | \' укажите параметры $this->request->cookie через \' , \', если они нужны (если это массив, то разделяйте параметры \' / \'), потом после \' | \' укажите параметры $this->request->get и $this->request->post через \' , \', если они нужны. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_cache_controller_ajax']                 = 'Укажите роут или keyword (seo_url) страницы, потом после \' | \' укажите роут контроллера который нужно загрузить через ajax (пример - extension/module/category, его можно узнать над модулем на интересующей странице в дебаг режиме), потом после \' | \' укажите module_id если он есть (его можно узнать над модулем на интересующей странице в дебаг режиме), потом после \' | \' укажите номер загрузки (его можно узнать над модулем на интересующей странице в дебаг режиме), потом после \' | \' укажите ширину экрана больше которого начать загружать контроллер, если нужно ограничить до, то через \' - \' укажите ширину. Если хотите на всех страницах, то вместо роута укажите \' # \'. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'. bus_ajax_id для скриптов можно узнать над модулем на интересующей странице в дебаг режиме или через консоль браузера.';
$_['help_cache_model']                           = 'Укажите роут модели которую нужно закэшировать (пример - catalog/category/getCategories), потом после \' | \' укажите время кэширования в секундах, потом после \' | \' укажите параметры $this->config->get() через \' , \', если они нужны (если это массив, то разделяйте параметры \' / \'), потом после \' | \' укажите параметры $this->session->data через \' , \', если они нужны (если это массив, то разделяйте параметры \' / \'), потом после \' | \' укажите параметры $this->request->cookie через \' , \', если они нужны (если это массив, то разделяйте параметры \' / \'), потом после \' | \' укажите параметры $this->request->get и $this->request->post через \' , \', если они нужны. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_cache_engine']                          = 'По умолчанию Буслік.<br />APC - это кэш кодов операций и хранилище данных с помощью оперативной памяти, подходит для тех у кого нет php расширения OPCache;<br />APCu - это новая версия APC преднозначено только для хранения данных с помощью оперативной памяти. Рекомендуется включать OpCache на сервере;<br />Буслік - тоже самое, что и файловый кэш, но позволяет хранить файлы кэша разделяя по папкам в зависимости от роута и т.д., тем самым ускоряет поиск нужного кэш файла и позволяет хранить большее количество;<br />Memcache - кэширование данных в оперативной памяти на основе хеш-таблицы;<br />Memcached - новая версия Memcache для кэширования данных в оперативной памяти на основе хеш-таблицы;<br />OpCache - тоже самое, что и Буслік, но сохраняет кэш в виде php кода. Требуется в 2 раза больше дискового пространства. Сначала создаётся php-код, потом вторым проходом сохраняется по алгоритму php расширения OpCache;<br />Redis - тоже самое, что Memcached;<br />WinCache - это кеширующий модуль, позволяющий увеличить скорость работы PHP-приложений на Windows и Windows Server. Обработчик включает свой алгоритм работы с данными с использованием оперативной и дисковой памяти;<br />xСache - включает свой алгоритм работы с данными с использованием оперативной и дисковой памяти.';
$_['help_cache_engine_mine']                     = 'Загрузите свой обработчик кэша в папку system/library/bus_cache/ и пропишите в этом поле имя файла, тогда кэш страниц, контроллеров и моделей будет обрабатываться указаным обработчиком.';
$_['help_cache_oc']                              = 'Если да, то кэш других модулей будет контролироваться настройками Буслік Кэш.';
$_['help_cache_expire']                          = 'По умолчанию 3600 секунд. Время жизни кэша задаётся в секундах.';
$_['help_cache_expire_controller']               = 'По умолчанию 3600 секунд. Время жизни кэша задаётся в секундах.';
$_['help_cache_expire_model']                    = 'По умолчанию 3600 секунд. Время жизни кэша задаётся в секундах.';
$_['help_cache_expire_all']                      = 'По умолчанию 36000 секунд. Время жизни кэша задаётся в секундах.';
$_['help_cache_size_limit']                      = 'По умолчанию 0 - без ограничений. Ограничение создания кэша по размеру задаётся в Мегабайтах. При достижении лимита, другой кэш будет кэшироваться на 5 минут, а если память закончится, то не будет кэшировать.';
$_['help_cache_count']                           = 'Для обработчика Буслік и OpCache укажите количество кэша которое нужно создать при кэшировании чего-либо. Когда один кэш файл занят одним пользователем, то другому будет отдана другая копия. Если доступных копий нет, то кэш для данного пользователя работать не будет (будет считаться, что кэша нет). Учтите, что потребуется место на диске во столько раз больше, сколько укажите в этом поле.';
$_['help_pagespeed_status']                      = 'Включение оптимизации должно ускорить отдачу контента тем самым полюбить ваш сайт с поисковыми роботами, а значит позиции в поисковой выдаче должны стать выше.';
$_['help_pagespeed_onrot']                       = 'Укажите роут или его keyword (seo_url) страницы для точной работы. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_pagespeed_rot']                         = 'Укажите роут или его keyword (seo_url) страницы для исключения из оптимизации. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_pagespeed_image_lazy_load']             = 'Выберите вариант подгрузки изображений и фрейм окон.';
$_['help_pagespeed_image_first_boot_status']     = 'Включение этой функции позволит ускорить первую загрузку страницы, когда ресайз изображений ещё не создан, будет заменена ссылка на изображение и генерировать изображение будет по отдельному запросу.';
$_['help_pagespeed_image_first_boot_onrot']      = 'Укажите роут или его keyword (seo_url) страницы для точной работы First Boot. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_pagespeed_image_first_boot_rot']        = 'Укажите роут или его keyword (seo_url) страницы для исключения из оптимизации First Boot. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_pagespeed_image_w_h']                   = 'Включение этой функции будет добавлять атрибуты ширины и высоты ко всем изображениям у которых в названиях есть их размеры, например, image-100х100.jpg';
$_['help_pagespeed_image_webp_status']           = 'Если да, то будет включена поддержка webp изображений. Отключите другие модули подобного функционала.';
$_['help_pagespeed_image_webp_convert']          = 'Выберите вариант библиотеки для генерации webp изображений.';
$_['help_pagespeed_image_webp_quality']          = 'Укажите качество изображений,<br />100 - хорошее качество (без сжатия),<br />0 - плохое качество.';
$_['help_pagespeed_html_lazy_load']              = 'Укажите роут или keyword (seo_url) страницы, потом после \' | \' укажите роут контроллера который нужно загрузить по скроллу (пример - extension/module/category, его можно узнать над модулем на интересующей странице в дебаг режиме), потом после \' | \' укажите module_id если он есть (его можно узнать над модулем на интересующей странице в дебаг режиме), потом после \' | \' укажите номер загрузки (его можно узнать над модулем на интересующей странице в дебаг режиме), потом после \' | \' укажите ширину экрана больше которого начать загружать контроллер, если нужно ограничить до, то через \' - \' укажите ширину. data-busloadinglazy-id для скриптов можно узнать над модулем на интересующей странице в дебаг режиме или через консоль браузера.';
$_['help_pagespeed_html_replace_before']         = 'Укажите роут или keyword (seo_url) страницы, потом после \' | \' укажите строку кода которую нужно заменить, потом после \' | \' укажите на какую строку заменить. Если хотите на всех страницах, то вместо роута укажите \' # \'. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'. Перенос строк заменяйте на [\r] или [\r][\n].';
$_['help_pagespeed_html_replace_after']          = 'Укажите роут или keyword (seo_url) страницы, потом после \' | \' укажите строку кода которую нужно заменить, потом после \' | \' укажите на какую строку заменить. Если хотите на всех страницах, то вместо роута укажите \' # \'. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'. Перенос строк заменяйте на [\r] или [\r][\n].';
$_['help_pagespeed_html_min']                    = 'Выберите варианты сжатия html-кода.';
$_['help_pagespeed_html_min_tags']               = 'Укажите роут или keyword (seo_url) страницы, потом после \' | \' укажите флаги regex что удалять слевой стороны от тега, потом после \' | \' укажите часть тега или тег целиком (если их несколько, то разделяйте теги \' | \'). Если хотите на всех страницах, то вместо роута укажите \' # \'. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_pagespeed_css_replace_before']          = 'Укажите роут или keyword (seo_url) страницы, потом после \' | \' укажите строку кода которую нужно заменить, потом после \' | \' укажите на какую строку заменить. Если хотите на всех страницах, то вместо роута укажите \' # \'. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'. Перенос строк заменяйте на [\r] или [\r][\n].';
$_['help_pagespeed_css_replace_after']           = 'Укажите роут или keyword (seo_url) страницы, потом после \' | \' укажите строку кода которую нужно заменить, потом после \' | \' укажите на какую строку заменить. Если хотите на всех страницах, то вместо роута укажите \' # \'. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'. Перенос строк заменяйте на [\r] или [\r][\n].';
$_['help_pagespeed_css_min']                     = 'Выберите вариант сжатия css-кода. Если включено, то все файлы стилей, которые обрабатывает OpenCart по стандарту, будут соединены в один файл и максимально сжаты.';
$_['help_pagespeed_css_min_links']               = 'Добавьте ссылку на css стиль который не попал в общий файл стилей (для работы с других сайтов, укажите ссылку также в поле для скачивания). Значение задаётся начиная с новой строки. Если не хотите удалять, то перед ссылкой установите \' ; \'. Если вы хотите указать свои атрибуты, то после ссылки установите \' | \' и впишите атрибуты, пример, catalog/style.css|type=&quot;text/css&quot; rel=&quot;preload&quot;<br />Также можно указать в начале ссылки следующие параметры (атрибуты имеют вверх над параметрами, кроме параметров перемещения):<br />[header] - отправить ссылку в самый верх сайта;<br />[footer] - отправить ссылку в самый низ сайта;<br />[async] - просит браузер загрузить асинхронно;<br />[defer] - просит браузер загрузить сразу после построения структуры DOM;<br />[prelod] - просит браузер предварительно загрузить;<br />[prefetch] - просит браузер отложить загрузку в конец;<br />[dns-prefetch] - просит браузер заранее выполнить резолвинг DNS для домена;<br />[preconnect] - просит браузер заранее подключиться к домену;<br />[event] - отложить загрузку по событию любого действия;<br />[event-2000] - отложить загрузку по времени;<br />[critical] - этот стиль является критическим и его загрузить отдельно, и самым первым (если такой стиль подготовлен вами, то можно не включать функцию создания критических стилей);';
$_['help_pagespeed_css_min_download']            = 'Добавьте ссылку на css стиль который нужно скачать на свой сайт (скачает при сохранении настроек или чистки кэша, рекомендуется сначала сохранить текущие настройки). Значение задаётся начиная с новой строки. Если не хотите удалять, то перед ссылкой установите \' ; \'.';
$_['help_pagespeed_css_min_exception']           = 'Добавьте ссылку на css стиль который хотите исключить и отправить по своему пути. Значение задаётся начиная с новой строки. Если не хотите удалять, то перед ссылкой установите \' ; \'. Если вы хотите указать свои атрибуты, то после ссылки установите \' | \' и впишите атрибуты, пример, catalog/style.css|type=&quot;text/css&quot; rel=&quot;preload&quot;<br />Также можно указать в начале ссылки следующие параметры (атрибуты имеют вверх над параметрами, кроме параметров перемещения):<br />[header] - отправить ссылку в самый верх сайта;<br />[footer] - отправить ссылку в самый низ сайта;<br />[async] - просит браузер загрузить асинхронно;<br />[defer] - просит браузер загрузить сразу после построения структуры DOM;<br />[prelod] - просит браузер предварительно загрузить;<br />[prefetch] - просит браузер отложить загрузку в конец;<br />[dns-prefetch] - просит браузер заранее выполнить резолвинг DNS для домена;<br />[preconnect] - просит браузер заранее подключиться к домену;<br />[event] - отложить загрузку по событию любого действия;<br />[event-2000] - отложить загрузку по времени;<br />[critical] - этот стиль является критическим и его загрузить отдельно, и самым первым (если такой стиль подготовлен вами, то можно не включать функцию создания критических стилей);';
$_['help_pagespeed_css_min_font']                = 'Добавьте ссылку на шрифт или картинку на которую ругается Pagespeed - просит, чтобы предзагрузили. Значение задаётся начиная с новой строки. Если не хотите удалять, то перед ссылкой установите \' ; \'. Доменну сторонних шрифтов автоматический будет установлено подключение с атрибутами (dns-prefetch, preconnect).';
$_['help_pagespeed_css_min_convert']             = 'Укажите типы MIME кода файлов в url() которые нужно перенести в отдельный файл.';
$_['help_pagespeed_css_min_display']             = 'Включите эту функцию, чтобы 100% для шрифтов было установлено свойство font-display чтобы не показывать невидимый текст.';
$_['help_pagespeed_css_inline_transfer']         = 'Выберите вариант перемещения css-кода.<br />Вверх - сразу перед </head>;<br />Вниз - сразу перед </body>;<br />В файл сжатия - в самый низ файла который загружается сразу;</head>;';
$_['help_pagespeed_css_inline_exception']        = 'Укажите роут или keyword (seo_url) страницы, потом после \' | \' укажите строку или часть строки css-кода, тогда весь блок кода в &lt;style&gt;&lt;/style&gt; не будет тронут функцией переноса кода. Значение задаётся начиная с новой строки. Если хотите на всех страницах, то вместо роута укажите \' # \'. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_pagespeed_css_events']                  = 'Укажите при каких событиях запускать css-код, по-умолчанию событие вызовется 1 раз. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_pagespeed_css_critical']                = 'Включение этой функции будет собирать необходимые стили при первой загрузки страницы и отправлять на сервер, позже все стили будут загружаться по взаимодействию. В целях безопасности сбор стилей будет доступен при загрузки страницы администратором. Данная функция будет работать только при включённом сжатии и рекомендуется в таком случае не откладывать стили по событию (даже смысла не имеет).';
$_['help_pagespeed_css_critical_all']            = 'Если да, то будут собираться стили по всем элементам страницы.';
$_['help_pagespeed_css_critical_offset']         = 'Укажите число насколько процентов захватывать элементы больше вашего экрана по высоте.';
$_['help_pagespeed_css_critical_time']           = 'Отсрочка времени срабатывания сборщика стилей.';
$_['help_pagespeed_css_critical_elements']       = 'Укажите название элементов (теги, классы, идентификаторы) которые нужно поместить в файл критических стилей из основного. Данная функция будет работать при включённом сжатии и рекомендуется в таком случае не откладывать стили по событию. Значение указывается с новой строки.';
$_['help_pagespeed_css_critical_links']          = 'Укажите ссылки на страницы для которых нужно создать критичские стили. Критические стили зависят от роута и названий стилей. Значение задаётся начиная с новой строки. Если не хотите удалять, то перед ссылкой установите \' ; \'.';
$_['help_pagespeed_css_style']                   = 'Здесь вы можете задать стили для адаптации стилей модуля под дизайн своего сайта. Указывать теги &lt;style&gt;&lt;/style&gt; не нужно.';
$_['help_pagespeed_js_replace_before']           = 'Укажите роут или keyword (seo_url) страницы, потом после \' | \' укажите строку кода которую нужно заменить, потом после \' | \' укажите на какую строку заменить. Если хотите на всех страницах, то вместо роута укажите \' # \'. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'. Перенос строк заменяйте на [\r] или [\r][\n].';
$_['help_pagespeed_js_replace_after']            = 'Укажите роут или keyword (seo_url) страницы, потом после \' | \' укажите строку кода которую нужно заменить, потом после \' | \' укажите на какую строку заменить. Если хотите на всех страницах, то вместо роута укажите \' # \'. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'. Перенос строк заменяйте на [\r] или [\r][\n].';
$_['help_pagespeed_js_min']                      = 'Выберите вариант сжатия js-кода. Если включено, то все файлы скриптов, которые обрабатывает OpenCart по стандарту, будут соединены в один файл и максимально сжаты.';
$_['help_pagespeed_js_min_links']                = 'Добавьте ссылку на js скрипт который не попал в общий файл скриптов. Значение задаётся начиная с новой строки. Если не хотите удалять, то перед ссылкой установите \' ; \'. Если вы хотите указать свои атрибуты, то после ссылки установите \' | \' и впишите атрибуты, пример, catalog/script.js|type=&quot;text/javascript&quot;<br />Также можно указать в начале ссылки следующие параметры (атрибуты имеют вверх над параметрами, кроме параметров перемещения):<br />[header] - отправить ссылку в самый верх сайта;<br />[footer] - отправить ссылку в самый низ сайта;<br />[async] - просит браузер загрузить асинхронно;<br />[defer] - просит браузер загрузить сразу после построения структуры DOM;<br />[prelod] - просит браузер предварительно загрузить;<br />[prefetch] - просит браузер отложить загрузку в конец;<br />[dns-prefetch] - просит браузер заранее выполнить резолвинг DNS для домена;<br />[preconnect] - просит браузер заранее подключиться к домену;<br />[event] - отложить загрузку по событию любого действия;<br />[event-2000] - отложить загрузку по времени;';
$_['help_pagespeed_js_min_download']             = 'Добавьте ссылку на js скрипт который нужно скачать на свой сайт (скачает при сохранении настроек или чистки кэша, рекомендуется сначала сохранить текущие настройки). Значение задаётся начиная с новой строки. Если не хотите удалять, то перед ссылкой установите \' ; \'.';
$_['help_pagespeed_js_min_exception']            = 'Добавьте ссылку на js скрипт который хотите исключить и отправить по своему пути. Например, бывают скрипты которые полностью независимые и не блокируют рендер страницы, поэтому не стоит их сжимать с другими т.к. это может усугубить оптимизацию. Значение задаётся начиная с новой строки. Если не хотите удалять, то перед ссылкой установите \' ; \'. Если вы хотите указать свои атрибуты, то после ссылки установите \' | \' и впишите атрибуты, пример, catalog/script.js|type=&quot;text/javascript&quot;<br />Также можно указать в начале ссылки следующие параметры (атрибуты имеют вверх над параметрами, кроме параметров перемещения):<br />[header] - отправить ссылку в самый верх сайта;<br />[footer] - отправить ссылку в самый низ сайта;<br />[async] - просит браузер загрузить асинхронно;<br />[defer] - просит браузер загрузить сразу после построения структуры DOM;<br />[prelod] - просит браузер предварительно загрузить;<br />[prefetch] - просит браузер отложить загрузку в конец;<br />[dns-prefetch] - просит браузер заранее выполнить резолвинг DNS для домена;<br />[preconnect] - просит браузер заранее подключиться к домену;<br />[event] - отложить загрузку по событию любого действия;<br />[event-2000] - отложить загрузку по времени;';
$_['help_pagespeed_js_inline_event']             = 'Укажите роут или keyword (seo_url) страницы, потом после \' | \' укажите строку или часть строки js-кода, тогда весь блок кода в &lt;script&gt;&lt;/script&gt; будет обвёрнуто в событие запуска при любом взаимодействии с сайтом. Значение задаётся начиная с новой строки. Если хотите на всех страницах, то вместо роута укажите \' # \'. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_pagespeed_js_inline_event_time']        = 'Укажите время в миллисекундах, если нужно, чтобы отложенные скрипты запустились сами не дожидаясь любого взаимодействия с сайтом. Если указано 0, то автозапуск не будет работать.';
$_['help_pagespeed_js_inline_transfer']          = 'Выберите вариант перемещения js-кода.<br />Вверх - сразу перед </head>;<br />Вниз - сразу перед </body>;<br />В файл сжатия - в самый низ файла который загружается сразу.';
$_['help_pagespeed_js_inline_transfer_onrot']    = 'Укажите роут или keyword (seo_url) страницы, потом после \' | \' укажите строку или часть строки js-кода, тогда весь блок кода в &lt;script&gt;&lt;/script&gt; будет переноситься (При заполнении параметры исключения действовать не будут). Значение задаётся начиная с новой строки. Если хотите на всех страницах, то вместо роута укажите \' # \'. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_pagespeed_js_inline_exception']         = 'Укажите роут или keyword (seo_url) страницы, потом после \' | \' укажите строку или часть строки js-кода, тогда весь блок кода в &lt;script&gt;&lt;/script&gt; не будет тронут функцией переноса кода. Значение задаётся начиная с новой строки. Если хотите на всех страницах, то вместо роута укажите \' # \'. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_pagespeed_js_events']                   = 'Укажите при каких событиях запускать js-код, по-умолчанию событие вызовется 1 раз. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_pagespeed_js_script']                   = 'Здесь вы можете задать скрипты для адаптации стилей модуля под дизайн своего сайта. Указывать теги &lt;script&gt;&lt;/script&gt; не нужно.';
$_['help_database_status']                       = 'После проведения работ отключите. При включении со стороны фронта будет приниматься рабочий GET параметр \'bus_cache_database\' со специальными значениями для отключения кэша и вывода необходимой информации скорости работы вместо html кода с имитацией гостя, авторизованного пользователя и администратора.';
$_['help_database_links']                        = 'Укажите полную интересующую ссылку на свой сайт. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установите \' ; \'.';
$_['help_database_columns']                      = 'Укажите столбец который нужно индексировать, потом после \' | \' укажите размер если нужно. Значение задаётся начиная с новой строки.';
$_['help_cron_pregeneration']                    = 'Если да, то будет работать прегенерация кэша по крону или ручном запуске.';
$_['help_cron_pregeneration_query_count']        = 'Укажите сколько делать запросов в секунду. Рекомендуется смотреть нагрузку сервера для оценки количества. Также мощности сервера просто не позволят делать большое количество запросов.';
$_['help_support_stats_status']                  = 'Если да, то при посещении настроек модуля, будет производится подсчёт размера и количество файлов на сайте. Статистика кэшируется на 10 минут.';
$_['help_support_disc_size_limit']               = 'Укажите доступный размер диска вашего сервера в Мегабайтах. По умолчанию 0 - размер всего диска сервера. Это максимальный размер для кэша и изображений WebP.';
$_['help_support_disc_warning']                  = 'Если да, то для администратора при входе в админ панель будет выводиться сообщение.';
$_['help_support_session_fix']                   = 'Если да, то плодирование сессий будет прекращено. OpenCart имеет проблему создания сессий, если сайт посещает пользователь не принимающий сессии, в результате при каждом посещении создаётся новая сессия. Функция делает так, что сохраняет ip пользователя и не даёт OpenCart создавать сессию. Файл блокировки сохраняется в папке сессий (если она есть) или кэша.';
$_['help_support_debug']                         = 'Если да, то для администратора над шапкой сайта будет выводиться информация о времени загрузки страницы, также кэш начнёт действовать.';

// Doc
$_['doc']                                        = '<b>Все значения заключённые в кавычки понимайте без пробелов внутри (пример: \' | \' следовательно => \'|\'). Также не допускайте оставление в настройках пустых строк, чтобы модуль не выполнял лишних условий проверок. Все настройки приводятся в единный стиль написания, но будьте бдительны и поглядывайте в инструкцию при наведении на кружок со знаком вопроса.</b><br /><br /><b>Роут</b> - это значение GET параметра в адресной строке браузера после знака \' = \' (пример: route=product/category => product/category), или при загрузки контроллера в коде первый параметр (пример: $this->load->controller(\'product/category\') => product/category), или при загрузки модели (пример: $this->model_catalog_category->getCategories() => catalog/category/getCategories). В OpenCart 4 перед функцией контроллера уже ставится \' | \' или \' . \', но вы всё-равно ставьте \' / \'.<br />Роут и keyword страницы можно узнать при включении дебаг режима в самом вверху. <b>Роутом может быть также другой параметр из столбца query таблицы oc_url_alias, oc_seo_url (когда в строке браузера нет роута, а есть keyword вместо роута product/category будет, например, path=20_27) - это поведение планируется изменить в будущем (возможность указывать роуты через запятую, например, для кэширования категорий product/category,path=,category_id=)</b>.<br /><br />
Рекомендую использовать этот <a href="https://liveopencart.ru/index.php?route=product/product&product_id=2519" rel="noreferrer noopener">модуль</a> и указать там ссылку:<br /><br />
Чистка кэша HTML, DATA:<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&caches=1<br /><br />
Чистка кэша TWIG:<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&twig=1<br /><br />
Чистка кэша HTML, DATA + CSS, JS:<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&minify=1<br /><br />
Чистка кэша HTML, DATA + IMAGES:<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&images=1<br /><br />
Чистка кэша HTML, DATA + UPDATE MODIFICATIONS, EVENTS:<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&modifications=1<br /><br />
Чистка LOGS:<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&logs=1<br /><br />
Чистка VIEW PRDOCUTS (просмотренные товары):<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&view_products=1<br /><br />
Чистка CUSTOMER SEARCH QUERY (поисковые запросы):<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&customer_search=1<br /><br />
Чистка CUSTOMER BLOG SEARCH QUERY (поисковые запросы по блогу OpenCart.Pro 2.3.0.2.6):<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&customer_blog_search=1<br /><br />
Чистка CUSTOMER ACTIVITY (информация об активности всех пользователей):<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&customer_activity=1<br /><br />
Чистка CUSTOMER AND API SESSION (file or DB) (сессионные данные всех пользователей и подключений по REST API OpenCart):<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&customer_session=1<br /><br /> 
Чистка GUEST CART SESSION (сессионные данные корзины гостей):<br />https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&cart_session=1<br /><br />';
$_['doc_status']                                 = '<b>Статус</b> - это состояние работы модуля или его функционала.<br />Включено - все функции модуля будут работоспособны.<br />Отключено - все функции модуля будут неработоспособны.<br />Между изменениями статуса и сохранения настроек будет чиститься кэш OpenCart в system/storage/cache, обновляться модификаторы и(или) события.<br />Модификаторы и(или) события модуля в завивимости от статуса будут включаться и отключаться.';
$_['doc_store']                                  = '<b>Магазин</b> - это состояние работы модуля или его функционала на страницах выбранного магазина.<br />Список магазинов расположен в Админ панель/Система/Настройки. Включение работы определяется установкой галочки.';
$_['doc_cache_status']                           = '<b>Включить кэширование страниц</b> - это состояние работы функционала модуля относящиеся к кэшированию страниц целиком.<br />Да - функции кэша страниц будут работоспособны.<br />Нет - функции кэша страниц будут неработоспособны.<br />Функции относящиеся к этой настройки будут исчезать при отключённом статусе.<br />Не рекомендуется кэшировать сайт, если у вас накопительная память HDD, а не SSD (NVMe). В целом не арендуйте хостинг или сервер, если на нём не установлен NVMe.';
$_['doc_cache_con']                              = '<b>Параметры config</b> - это параметры строки или массива получаемые из $this->config->get(). Разнообразие кэша по этим параметрам будет действовать для кэша всех страниц, контроллеров, моделей. Вручную нужно открывать исходный код и отыскивать $this->config->get() который может быть разным при определённых условиях (то есть нужно создавать новый кэш при изменении $this->config->get()).';
$_['doc_cache_ses']                              = '<b>Параметры session</b> - это параметры массива получаемые из $this->session->data. Разнообразие кэша по этим параметрам будет действовать для кэша всех страниц, кроме кэша контроллеров, моделей. Вручную нужно открывать исходный код и отыскивать $this->session->data который может быть разным при определённых условиях (то есть нужно создавать новый кэш при изменении $this->session->data).';
$_['doc_cache_cok']                              = '<b>Параметры cookie</b> - это параметры массива получаемые из $this->request->cookie. Разнообразие кэша по этим параметрам будет действовать для кэша всех страниц, кроме кэша контроллеров, моделей. Вручную нужно открывать исходный код и отыскивать $this->request->cookie который может быть разным при определённых условиях (то есть нужно создавать новый кэш при изменении $this->request->cookie).';
$_['doc_cache_par']                              = '<b>Параметры ограничения</b> - это параметры массива получаемые из $this->request->get и $this->request->post. Ограничение кэша по этим параметрам будет действовать для кэша всех страниц, кроме кэша контроллеров, моделей. Вручную нужно открывать исходный код и отыскивать $this->request->get ($_GET) и $this->request->post ($_POST) который может быть разным при определённых условиях (то есть нужно создавать новый кэш при изменении $this->request->get и $this->request->post).';
$_['doc_cache_onrot']                            = '<b>Параметры работы</b> - эта функция отвечает за кэширование страниц целиком для узкой настройки (возможность настроить кэш для отдельных страниц по роуту и keyword, указать индивидуальные настройки: время кэша, параметры config, session, cookie, get и post для разнообразия кэша).';
$_['doc_cache_rot']                              = '<b>Параметры исключения</b> - эта функция отвечает за исключение кэширования страниц целиком по роуту и keyword.';
$_['doc_cache_customer']                         = '<b>Кэшировать для авторизованных пользователей?</b> - эта функция отвечает за разнообразие кэша страниц согласно $this->customer->isLogged(). Если не настраиваете тонко кэширование страниц целиком, не включайте эту функцию.';
$_['doc_cache_cart']                             = '<b>Кэшировать корзину</b> - эта функция отвечает за кэширование корзины $this->cart->getProducts().';
$_['doc_cache_cart_count']                       = '<b>Кэшировать при наличии товара в корзине</b> - эта функция отвечает за разнообразие кэша страниц согласно $this->cart->getProducts().';
$_['doc_cache_controller']                       = '<b>Кэширование функций контроллеров</b> - эта функция отвечает за кэширование контроллеров загружаемых в коде через $this->load->controller();. Для каждого контроллера можно указать индивидуальные настройки: время кэша, параметры config (по умолчанию берёт из общих настроек), session, cookie, get и post для разнообразия кэша.';
$_['doc_cache_controller_ajax']                  = '<b>Ajax загрузка функций контроллеров</b> - эта функция отвечает за загрузку контроллеров ajax способом загружаемых в коде через $this->load->controller();. Эту функцию нужно использовать, если нужно скрыть информацию от поисковых роботов, когда из-за модуля на странице много одинаковых слов или когда модуль нельзя кэшировать при кэшировании страницы целиком.';
$_['doc_cache_model']                            = '<b>Кэширование функций моделей</b> - эта функция отвечает за кэширование моделей загружаемых в коде через $this->model_[путь файла модели]->[название функции]();. Для каждой модели можно указать индивидуальные настройки: время кэша, параметры config (по умолчанию берёт из общих настроек), session, cookie, get и post для разнообразия кэша.';
$_['doc_cache_engine']                           = '<b>Обработчик кэша</b> - эта функция отвечает за выбор обработчика кэша поставляемые модулем.<br />Обработчик Буслік и OpCache - фаловый кэш - рекомендуется для слабых хостингов, другие обработчики применяют дополнительно в своих алгоритмах оперативную память для кэширования.';
$_['doc_cache_engine_mine']                      = '<b>Свой обработчик кэша</b> - эта функция отвечает за установку своего обработчика кэша. Это может понадобится, если у вас есть своё решение обработки кэша или нужно, например, изменить обработчик кэша поставляемый с модулем и предотвратить перезапись кода при обновлении модуля.';
$_['doc_cache_oc']                               = '<b>Контролировать кэш OpenCart</b> - эта функция отвечает за установку обработчика кэша, как обработчик по умолчанию для стандартного кэша OpenCart.';
$_['doc_cache_expire']                           = '<b>Время жизни кэша OpenCart</b> - эта функция отвечает за установку времени стандартного кэша OpenCart, когда обработчик установлен для него.';
$_['doc_cache_expire_controller']                = '<b>Время жизни кэша контроллеров</b> - эта функция отвечает за установку времени кэша контроллеров по умолчанию.';
$_['doc_cache_expire_model']                     = '<b>Время жизни кэша моделей</b> - эта функция отвечает за установку времени кэша моделей по умолчанию.';
$_['doc_cache_expire_all']                       = '<b>Время жизни кэша страниц</b> - эта функция отвечает за установку времени кэша страниц по умолчанию.';
$_['doc_cache_size_limit']                       = '<b>Размер кэша</b> - эта функция отвечает за ограничение создания кэша, когда заканчивается память сервера или своего установленного лимита диска.';
$_['doc_cache_clear']                            = '<b>Автоматическая чистка кэша</b> - эта функция отвечает за чистку кэша в случая выбранных галочкой.';
$_['doc_pagespeed_status']                       = '<b>Включить оптимизацию (PageSpeed)</b> - это состояние работы функционала модуля относящиеся к оптимизации страниц.<br />Да - функции оптимизации страниц будут работоспособны.<br />Нет - функции оптимизации страниц будут неработоспособны.<br />Функции относящиеся к этой настройки будут исчезать при отключённом статусе.';
$_['doc_pagespeed_onrot']                        = '<b>Параметры работы</b> - эта функция отвечает за включение оптимизации страниц по роуту и keyword, если на странице отсутсвует &lt;!DOCTYPE html';
$_['doc_pagespeed_rot']                          = '<b>Параметры исключения</b> - эта функция отвечает за исключение из оптимизации страниц по роуту и keyword, если из-за работы модуля возникают различные ошибки.';
$_['doc_pagespeed_image_lazy_load']              = "<b>Включить Lazy load изображений</b> - эта функция отвечает за установку атрибута loading=\"lazy\" или bus-loading=\"lazy\" в теги &lt;img,&lt;iframe,&lt;frame. В некоторых шаблонах необходимо через модификаторы или функционал замены в html-коде сделать замену data-src на src (нативный вариант браузера) или data-busloadinglazy-src (универсальный вариант модуля).<br /><textarea class=\"form-control\">// api bus_loading_lazy.js
/*
busLoadingLazy.browser['name'] - получить название браузера
busLoadingLazy.browser['version'] - получить версию браузера
busLoadingLazy.setting['browser']['name'] - запускать только для названия браузера (после выполнения кода нужно снять ограничение)
busLoadingLazy.setting['browser']['version'] - запускать только для версии браузера и новее (после выполнения кода нужно снять ограничение)
busLoadingLazy.setting['elements'] - обрабатывать элементы страницы, по умолчанию '[loading=\"lazy\"][data-busloadinglazy-src], [loading=\"lazy\"][data-busloadinglazy-id]'
busLoadingLazy.setting['element'] - обрабатывать элемент страницы, по умолчанию ''
busLoadingLazy.setting['fps'] - частота действий любых событий после которых сработает ваш код в событии busLoadingLazy, по умолчанию 10
busLoadingLazy.setting['offsetTop'] - расстояние от окна браузера до элемента который начинает загрузку, по умолчанию 50
busLoadingLazy.setting['width'] - минимальная ширина для запуска элемента страницы, по умолчанию 0
busLoadingLazy.setting['lazy'] - принудительная загрузка элемента, по умолчанию false
busLoadingLazy.setting['start'] - начать загрузку элемента из найденных с номера, по умолчанию 0
busLoadingLazy.setting['quantity'] - обработать количество элементов из всех найденных, по умолчанию 10
busLoadingLazy.setting['exception'] - массив содержащие значения data-busloadinglazy-src и data-busloadinglazy-id для исключения из обработки, по умолчанию {}

// Пример:
window.addEventListener('busLoadingLazyBefore', function() {
	busLoadingLazy.setting['status'] = false;  // не загружать модуль
	busLoadingLazy.setting['start'] = 0;  // начать загружать с
	busLoadingLazy.setting['quantity'] = 20; // загружать столько-то
	busLoadingLazy.setting['exception'] = {'https://mysite.by/image.png':true}; // не загружать это изображение при загрузки страницы
	busLoadingLazy.start(); // загрузить ещё изображения и iframe при загрузки страницы начиная от 50 в количестве 5 штук
	busLoadingLazy.setting['exception'] = {}; // убираем исключения
});
*/

// скрипт bus_loading_lazy.js запускается при полной загрузки страницы по событию load т.к. в этот момент он может получить доставерную высоту и т.д.
// выполнить код по скроллу, ресайзу согласно настройкам частоты запуска busLoadingLazy.setting['fps']
window.addEventListener('busLoadingLazy', function() {
	/* ваш код */
});

// выполнить код перед запуском скрипта busLoadingLazy
window.addEventListener('busLoadingLazyBefore', function() {
	/* ваш код */
});

// выполнить код после запуска скрипта busLoadingLazy
window.addEventListener('busLoadingLazyAfter', function() {
	/* ваш код */
});

// выполнить код при появлении отложенного блока
window.addEventListener('busLoadingLazyId-93fd76d319a4d202930d925a170c45ff', function() {
	/* ваш код */
})

// обработать html элемент сейчас (если хотите загрузить по клику)
busLoadingLazy.start({element:'[data-busloadinglazy-id=\'93fd76d319a4d202930d925a170c45ff\']', lazy:true});

// более правильный вариант запуска по клику
function myclick() {
	if ('busLoadingLazy' in window) {
		busLoadingLazy.start({element:'[data-busloadinglazy-id=\'93fd76d319a4d202930d925a170c45ff\']', lazy:true});
	} else {
		window.addEventListener('busLoadingLazyBefore', function() {
			busLoadingLazy.start({element:'[data-busloadinglazy-id=\'93fd76d319a4d202930d925a170c45ff\']', lazy:true});
		});
	}
}</textarea>";
$_['doc_pagespeed_image_first_boot_status']      = 'Ссылка будет иметь защищённый вид "https://mysite.by/?bus_cache_first_boot=qwert123" с помощью функционала $this->encryption.';
$_['doc_pagespeed_image_w_h']                    = '<b>Включить атрибуты ширины и высоты</b> - эта функция отвечает за включение атрибут ширины и высоты в изображениях. Если не были проставлены данные атрибуты где-то, то воспользуйтесь функционалом замены в html-коде.';
$_['doc_pagespeed_image_webp_status']            = '<b>Включить подджержку WebP изображений</b> - эта функция отвечает за включение поддержки webp формата (загрузка изображений в файл менеджер).<br />Функции относящиеся к этой настройки будут исчезать при отключённом статусе.<br />Между изменениями статуса и сохранения настроек будет чиститься кэш OpenCart в system/storage/cache, обновляться модификаторы и(или) события.<br />Модификаторы и(или) события модуля в завивимости от статуса будут включаться и отключаться.';
$_['doc_pagespeed_image_webp_convert']           = '<b>Конвертировать изображения в WebP и обратно</b> - эта функция отвечает за конвертацию png,jpg,gif изображений в webp и обратно, если браузер не поддерживает webp.<br />Рекомендуется GD Version 2.2.5+ (в версии ниже нет поддержки прозрачного фона и проблема с синим цветом - модуль ставит вместо прозрачности белый цвет и решает проблему с отстутсвием синего цвета) и php 7.1+ (в версии ниже отсутсвует проверка типа IMAGETYPE_WEBP).';
$_['doc_pagespeed_image_webp_quality']           = '<b>Сжатие WebP изображений</b> - эта функция отвечает за качество изображения при его создании.';
$_['doc_pagespeed_html_lazy_load']               = '<b>Включить Lazy load html</b> - эта функция отвечает за обворачивание html-кода контроллера в &lt;div loading="lazy" data-busloadinglazy-id="93fd76d319a4d202930d925a170c45ff" data-busloadinglazy-res="1200"&gt;&lt;noscript&gt;код контроллера&lt;/noscript&gt;&lt;/div&gt;<br />С помощью функционала замены в html-коде можно завернуть в эти теги любой html-код, главное задать индивидуальный идентификатор.<br /><br />data-busloadinglazy-id - это идентификатор контроллера по роуту и названию модуля.<br />data-busloadinglazy-res - это минимальная ширина экрана для запуска модуля. Имейте ввиду, что ширина экрана чисто для PageSpeed на мобильных телефонах с большим разрешением будет запускаться html-код.<br />
data-busloadinglazy-remove - это устанавливается модулем в выбранном контроллере на замену тега &lt;noscript&gt; для удаления при запуске скрипта bus_loading_lazy.js.<br /><br />При откладывании карусели, может потребоваться повторно запустить код карусели - поместите код запуска карусели в код события появления html-кода при скролинге. Код события смотрите в документации функции модуля выше.<br /><br />';
$_['doc_pagespeed_html_replace_before']          = '<b>Замена в html-коде до сжатия</b> - эта функция отвечает за замену в html-коде до его сжатия, чтобы можно было подправить код для какого-нибудь функционала.<br />В основном требуется замена когда не хватает какого-нибудь элемента в коде из-за чего после сжатия в браузере появляется ошибка, или нужно установить атрибуты ширины и высоты на изображения, или нужно убрать атрибут loading="lazy" и т.д.<br />Чтобы убрать в нужных местах loading="lazy" используйте модификаторы для установки обозначающего атрибута на нужных изображениях перед атрибутом src, чтобы в модуле можно было к нему подцепиться.';
$_['doc_pagespeed_html_replace_after']           = '<b>Замена в html-коде после сжатия</b> - эта функция отвечает за замену в html-коде после его сжатия, чтобы можно было подправить код для функционала сжатия.<br />В основном требуется замена когда не хватает какого-нибудь элемента в коде из-за чего после сжатия в браузере появляется ошибка, или нужно установить атрибуты ширины и высоты на изображения, или нужно убрать атрибут loading="lazy" и т.д.<br />Чтобы убрать в нужных местах loading="lazy" используйте модификаторы для установки обозначающего атрибута на нужных изображениях перед атрибутом src, чтобы в модуле можно было к нему подцепиться.';
$_['doc_pagespeed_html_min']                     = '<b>Сжимать html-код</b> - эта функция отвечает за уменьшение размера страниц путём удаления комментарий, лишних пробелов, перенос строк.<br />Также для уменьшения размера используйте по возможности перенос инлайн кода в файл сжатия и не помещайте исходный код svg изображений в код страницы. Чем легче страница, тем меньше памяти потребуется на обработку и хранение кэша.';
$_['doc_pagespeed_html_min_tags']                = '<b>Удаление отступов слева от тегов</b> - эта функция отвечает за удаление отсутпов между &gt;&lt;, другими словами вы решаете между какими тегами и на какой странице можно удалить \s,\h,\t,\r,\n и т.д. согласно правилам регулярных выражений в квадратных скобка [].';
$_['doc_pagespeed_css_replace_before']           = '<b>Замена в css-коде до сжатия</b> - эта функция отвечает за замену в css-коде до его сжатия, чтобы можно было подправить код для какого-нибудь функционала.<br />В основном требуется замена когда не хватает какого-нибудь элемента в коде из-за чего кривится дизайн сайта, или хотите что-нибудь удалить лишнее.';
$_['doc_pagespeed_css_replace_after']            = '<b>Замена в css-коде после сжатия</b> - эта функция отвечает за замену в css-коде после его сжатия, чтобы можно было подправить код для какого-нибудь функционала.<br />В основном требуется замена когда не хватает какого-нибудь элемента в коде из-за чего кривится дизайн сайта, или хотите что-нибудь удалить лишнее.';
$_['doc_pagespeed_css_min']                      = '<b>Сжимать css-код</b> - эта функция отвечает за уменьшение размера страниц путём удаления комментарий, лишних пробелов, перенос строк, сбор файлов в один.';
$_['doc_pagespeed_css_min_links']                = '<b>Ссылки на css файлы</b> - эта функция отвечает за объединение файлов css в один файл. По умолчанию собираются файлы из $this->document->getStyles(), поэтому остальные нужно указать вручную.';
$_['doc_pagespeed_css_min_download']             = '<b>Ссылки на css файлы для скачивания</b> - эта функция отвечает за сохранение файлов css на свой сервер после сохранения настроек модуля. Это полезно для сайта так как со своего сервера файл будет загружаться быстрее.';
$_['doc_pagespeed_css_min_exception']            = '<b>Исключение из сжатия css</b> - эта функция отвечает за исключение файлов css из объединения в один файл которые объеденяются автоматический из $this->document->getStyles().';
$_['doc_pagespeed_css_min_font']                 = '<b>Предзагрузка шрифтов или изображений</b> - эта функция отвечает за установку приоритета загрузки для шрифтов и изображений, что даст возможность минимизировать скачки стилей и положительно повлияет на \'Cumulative Layout Shift\'.';
$_['doc_pagespeed_css_min_convert']              = '<b>Конвертация из кода в файл</b> - эта функция полезна, для уменьшения размера фвйла стилей и даёт возможность кэшировать браузером такие файлы.';
$_['doc_pagespeed_css_min_display']              = '<b>Font-Display</b> - эта функция отвечает за установку режима работы шрифтов.';
$_['doc_pagespeed_css_inline_transfer']          = '<b>Переместить инлайн css-код</b> - эта функция отвечает за перенос кода.';
$_['doc_pagespeed_css_inline_exception']         = '<b>Исключение из переноса инлайн css-кода</b> - эта функция отвечает за исключение кода из переноса.';
$_['doc_pagespeed_css_events']                   = '<b>Cобытия для запуска css-кода</b> - эта функция отвечает за запуск отложенного css-кода (инлайн код и файлы).';
$_['doc_pagespeed_css_critical']                 = '<b>Включить сбор критических стилей</b> - эта функция отвечает за сбор необходимых стилей для указанных страниц. Данная возможность уменьшает время загрузки для \'First Contentful Paint\' и \'Largest Contentful Paint\'.';
$_['doc_pagespeed_css_critical_all']             = '<b>Собирать стили по всем элементам</b> - эта функция отвечает за сбор стилей без учёта высоты экрана.';
$_['doc_pagespeed_css_critical_offset']          = '<b>Отсечка сбора от высоты экрана</b> - эта функция отвечает за корректировку высоты страницы сайта для сбора критических стилей.';
$_['doc_pagespeed_css_critical_time']            = '<b>Отсрочка времени</b> - эта функция отвечает за запуск сбора стилей через необходимый для вас промежуток времени.';
$_['doc_pagespeed_css_critical_elements']        = '<b>Элементы стилей</b> - эта функция отвечает за указание дополнительных элементов стилей, если не были по какой-нибудь причине подхвачены. Элементы стилей - означает идентификатор стиля (.class, #id, [attribute], tag или полное название стиля).';
$_['doc_pagespeed_css_critical_links']           = '<b>Ссылки на страницы сбора критических стилей</b> - ссылки необходимы, чтобы модуль знал для каких страниц нужно создать критические стили.';
$_['doc_pagespeed_css_style']                    = '<b>Стиль</b> - это поле для помещения своего css-кода. Файл кода будет загружаться после основных.';
$_['doc_pagespeed_js_replace_before']            = '<b>Замена в js-коде до сжатия</b> - эта функция отвечает за замену в js-коде до его сжатия, чтобы можно было подправить код для какого-нибудь функционала.<br />В основном требуется замена когда не хватает какого-нибудь элемента в коде из-за чего после сжатия в браузере появляется ошибка, или хотите что-нибудь удалить лишнее.';
$_['doc_pagespeed_js_replace_after']             = '<b>Замена в js-коде после сжатия</b> - эта функция отвечает за замену в js-коде после его сжатия, чтобы можно было подправить код для какого-нибудь функционала.<br />В основном требуется замена когда не хватает какого-нибудь элемента в коде из-за чего после сжатия в браузере появляется ошибка, или хотите что-нибудь удалить лишнее.';
$_['doc_pagespeed_js_min']                       = '<b>Сжимать js-код</b> - эта функция отвечает за уменьшение размера страниц путём удаления комментарий, лишних пробелов, перенос строк, сбор файлов в один';
$_['doc_pagespeed_js_min_links']                 = '<b>Ссылки на js файлы</b> - эта функция отвечает за объединение файлов js в один файл. По умолчанию собираются файлы из $this->document->getScripts(), поэтому остальные нужно указать вручную.';
$_['doc_pagespeed_js_min_download']              = '<b>Ссылки на js файлы для скачивания</b> - эта функция отвечает за сохранение файлов js на свой сервер после сохранения настроек модуля. Это полезно для сайта так как со своего сервера файл будет загружаться быстрее.';
$_['doc_pagespeed_js_min_exception']             = '<b>Исключение из сжатия js</b> - эта функция отвечает за исключение файлов js из объединения в один файл которые объеденяются автоматический из $this->document->getScripts().';
$_['doc_pagespeed_js_inline_event']              = "<b>Отложить загрузку инлайн js-кода</b> - эта функция отвечает за обворачиание инлайн js-кода в window.addEventListener('busCache', function() {инлайн код});. В этот код можно обворачивать любой код загрузку которого нужно отложить по событим указанных в поле 'Cобытия для запуска js-кода'. Откладывать нужно скрипты которые мешают рендеру страницы: метрики, различные чайты. Как правильно откладывать метрику смотрите в примерах ниже.<br /><textarea class=\"form-control\">// выполнить код, если при обновлении страницы проскролило вниз
window.addEventListener('load', function() {
	if ('busCache' in window && busCache.status == false) {
		if (document.documentElement && document.documentElement.scrollTop > 0 ||  document.body.scrollTop > 0) {
			busCache.start();
		}
	}
});

// пример подключения метрики чтобы можно было отложить скрип в поле 'Ссылки на js файлы'
<!-- Google Tag Manager -->
<script async src=\"https://www.googletagmanager.com/gtm.js?id=GTM-XXXXXX&l=dataLayer\" type=\"text/javascript\"></script>
<script type=\"text/javascript\">
window.dataLayer = window.dataLayer || [];
window.dataLayer.push({'gtm.start':new Date().getTime(),event:'gtm.js'});
</script>
<!-- Google Tag Manager -->
<!-- Google Tag Manager -->
<noscript><iframe src=\"https://www.googletagmanager.com/ns.html?id=GTM-XXXXXX\" height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe></noscript>
<!-- Google Tag Manager -->

<!-- Global site tag (gtag.js) - Google Analytics -->
<script async src=\"https://www.googletagmanager.com/gtag/js?id=UA-XXXXXXXX-X\" type=\"text/javascript\"></script>
<script type=\"text/javascript\">
	window.dataLayer = window.dataLayer || [];
	function gtag(){window.dataLayer.push(arguments);}

	gtag('js', new Date());
	gtag('config', 'UA-XXXXXXXX-X');
</script>
<!-- Global site tag (gtag.js) - Google Analytics -->

<!-- Yandex.Metrika -->
<script async src=\"https://mc.yandex.ru/metrika/tag.js\" type=\"text/javascript\"></script>
<script type=\"text/javascript\">
	//https://yandex.ru/support/metrica/code/counter-initialize.html
	window.ym = window.ym || function() {(window.ym.a = window.ym.a || []).push(arguments);};
	window.ym.l = 1*new Date();

	ym(00000000, \"init\", {
		clickmap:true,
		trackLinks:true,
		accurateTrackBounce:10
	});
</script>
<!-- Yandex.Metrika -->
<!-- Yandex.Metrika -->
<noscript><div><img src=\"https://mc.yandex.ru/watch/00000000\" style=\"position:absolute; left:-9999px;\" alt=\"\" /></div></noscript>
<!-- Yandex.Metrika -->

// запускаем скрипт когда он действительно нужен
if (!('owlCarousel' in $)) {
    (function($, window, document, undefined) {
        $.fn.owlCarousel = function(setting) {
            var self = this;
            return busCache.loadScript('catalog/view/javascript/jquery/owl-carousel/owl.carousel.min.js', function() {
                return $(self).owlCarousel(setting);
            });
        };
    })($, window, document);
}</textarea>";
$_['doc_pagespeed_js_inline_event_time']         = '<b>Время до автозапуска инлайн js-кода</b> - эта функция отвечает за установку времени отсрочки срабатывания указаных событий в поле \'Cобытия для запуска js-кода\'.';
$_['doc_pagespeed_js_inline_transfer']           = '<b>Переместить инлайн js-код</b> - эта функция отвечает за';
$_['doc_pagespeed_js_inline_transfer_onrot']     = '<b>Переносить инлайн js-код</b> - эта функция отвечает за';
$_['doc_pagespeed_js_inline_exception']          = '<b>Исключение из переноса инлайн js-кода</b> - эта функция отвечает за';
$_['doc_pagespeed_js_events']                    = '<b>Cобытия для запуска js-кода</b> - эта функция отвечает за запуск отложенного js-кода (инлайн код и файлы).';
$_['doc_pagespeed_js_script']                    = '<b>Скрипт</b> - это поле для помещения своего js-кода. Файл кода будет загружаться после основных.';
$_['doc_database_status']                        = '<b>Режим настройки</b> - это состояние работы модуля в режиме настроки индексов базы данных. Не забывайте выключать после проведения работ.';
$_['doc_database_links']                         = '<b>Интересующие ссылки для проверки</b> - это список ссылок по которым модуль будет проводить проверку скорости загрузки.';
$_['doc_database_tables']                        = '<b>Таблицы</b> - эта функция отвечает за';
$_['doc_database_indexs']                        = '<b>Индексы</b> - эта функция отвечает за';
$_['doc_database_columns']                       = '<b>Столбцы</b> - эта функция отвечает за';
$_['doc_database_unique']                        = '<b>Уникальный</b> - эта функция отвечает за';
$_['doc_database_unique_elements']               = '<b>Уникальных элементов</b> - эта функция отвечает за';
$_['doc_database_packed']                        = '<b>Упакован</b> - эта функция отвечает за';
$_['doc_database_index']                         = '<b>Индекс</b> - эта функция отвечает за';
$_['doc_database_index_name']                    = '<b>Имя индекса</b> - эта функция отвечает за';
$_['doc_database_index_key_block_size']          = '<b>Размер блока ключа</b> - эта функция отвечает за';
$_['doc_database_index_type']                    = '<b>Тип</b> - эта функция отвечает за';
$_['doc_database_index_parser']                  = '<b>Парсер</b> - эта функция отвечает за';
$_['doc_database_index_comment']                 = '<b>Комментарий</b> - эта функция отвечает за';
$_['doc_database_column']                        = '<b>Столбец</b> - эта функция отвечает за';
$_['doc_support_update']                         = 'Если вы купили версию с технической поддержкой - указание домена обязательно при покупки - иначе обновления не получить. Если вы купили версию без технической поддержки, то укажите в соответствующее поле номер заказа покупки. Если окажется, что другой домен не ваш (другая юр. информация на сайте по сравнению с первым доменом или нет данных вообще для возможности проверить), то обновление не будет доступно. Если вы купили версию на право перепродажи, то укажите номер заказа и пришлите автору модуля готовый код создания ключей на основе доменов ваших клиентов, чтобы на сервере автора проходила проверка достоверности приобретения (далее своим клиентам даёте номер заказа и свой ключ - вместо номера заказа можно любой другой идентификатор - но его нужно указать вместо домена при покупки модуля). Обновление недоступно для тестовых доменов.';
$_['doc_support_stats_status']                   = '<b>Включить статистику</b> - эта функция отвечает за функции сбора информации показывающие размер кэша в system/storage/cache, размер изображений в image, размер сессий в system/storage/session и oc_session...';
$_['doc_support_disc_size_limit']                = '<b>Лимит памяти диска</b> - эта функция отвечает за установку своего лимита памяти для кэша и изображений webp.';
$_['doc_support_disc_warning']                   = '<b>Включить предупреждение о не хватке памяти</b> - эта функция отвечает за оповещение администратора о нехватке памяти при посещении главной страницы админ панели.';
$_['doc_support_debug']                          = '<b>Включить отладку</b> - эта функция отвечает за информирование администратора о скорости работы модуля на стороне сайта.';
$_['doc_support_debug_log']                      = '<b>Включить логирование медленных страниц</b> - эта функция отвечает за';

//Button
$_['button_files_clear']                         = 'Удалить также файлы модуля? - если нет, просто обновите страницу от греха. Отчёт об удалении файлов смотрите в логах модификаторов.';
$_['button_add']                                 = 'Добавить';
$_['button_edit']                                = 'Редактировать';
$_['button_delete']                              = 'Удалить';
$_['button_copy']                                = 'Скопировать';
$_['button_update']                              = 'Обновить';
$_['button_clear']                               = 'Очистить';
$_['button_clear_cache']                         = 'Очистить кэш';
$_['button_save']                                = 'Сохранить';
$_['button_apply']                               = 'Применить';
$_['button_apply_piecemeal']                     = 'Применить частями';
$_['button_export']                              = 'Экспорт';
$_['button_import']                              = 'Импорт';
$_['button_start']                               = 'Запуск загрузки';
$_['button_continue']                            = 'Продолжение загрузки с места остановки';
$_['button_pause']                               = 'Приостановка загрузки';
$_['button_restart']                             = 'Перезапуск загрузки - начать сначала';
$_['button_search']                              = 'Найти';
$_['button_restore']                             = 'Восстановить';
$_['button_view']                                = 'Просмотреть';

// Error
$_['error_permission']                           = 'У вас недостаточно прав для внесения изменений!';
$_['error_warning']                              = 'Внимательно проверьте форму на ошибки!';
$_['error_install']                              = 'Нешта пайшло не так!';
$_['error_uninstall']                            = 'Нешта пайшло не так!';
$_['error_name']                                 = 'Название должно содержать до 255 символов!';
$_['error_width']                                = 'Укажите Ширину!';
$_['error_height']                               = 'Укажите Высоту!';
$_['error_max_input_vars']                       = '<b>Внимание! Будет превышен лимит параметра %s</b>, если превысить, данные могут не сохраниться. Увеличьте значение на сервере или обратитесь с данной просьбой к хостеру для увеличения лимита. Или воспользуйтесь кнопкой применения частями.<br>Лимит на сервере: %s <br>Лимит от модуля: %s - отсечка %s во избежание потери данных<br>Текущее значение: ';
$_['error_setting_import']                       = 'Файл не содержит настройки модуля, импорту отказано!';
$_['error_setting_import_format']                = 'Модуль не знает о таком формате, импорту отказано! - модуль мягко вас послал.';
$_['error_not_required']                         = 'Не требуется!';
$_['error_cache_size_limit']                     = '<b>Внимание!</b> Будет превышен лимит памяти для кэша! Новый кэш будет кэшироваться на 5 минут.';
$_['error_support_disc_size_limit']              = '<b>Внимание!</b> Превышен лимит памяти для кэша! Кэш отключён.';
$_['error_curl']                                 = '<b>Внимание!</b> Не установлена библиотека curl.';
$_['error_update']                               = '<b>Внимание!</b> Ошибка обновления!%s';
$_['error_update_1']                             = '<b>Внимание!</b> Вы не являетесь покупателем модуля или лицензия ещё не активирована, обновлению отказано!';
$_['error_update_2']                             = '<b>Внимание!</b> Период технической поддержки окончен, обновлению отказано!';
$_['error_update_3']                             = '<b>Внимание!</b> Вы нарушили лицензионное соглашение, обновлению отказано!';
$_['error_update_4']                             = '<b>Внимание!</b> Вы используете актуальную версию!';
$_['error_update_clone']                         = '<b>Внимание!</b> Зафиксирована подмена данных, обновлению отказано!';

// Success
$_['success_install']                            = ' - успешно установлен!';
$_['success_uninstall']                          = ' - успешно удалён!';
$_['success_uninstall_data_base']                = '◄ База данных удалена ►: ';
$_['success_uninstall_modification']             = '◄ Модификатор удалён ►: ';
$_['success_uninstall_folder']                   = '◄ Папка удалена т.к. файлов нет ►: ';
$_['success_uninstall_file']                     = '◄ Файл удалён ►: ';
$_['success_update']                             = ' - успешно обновлён!';
$_['success_setting']                            = 'Настройки успешно изменены!';
$_['success_setting_apply']                      = 'Настройки успешно применены!';
$_['success_setting_save']                       = 'Настройки успешно сохранены!';
$_['success_setting_new']                        = 'Новый модуль успешно добавлен!';
$_['success_setting_redirect']                   = 'Вы были перенаправлены на нужную страницу настроек!';
$_['success_setting_import']                     = 'Настройки модуля "%s" успешно импортированы в модуль, вам осталось их применить!';
$_['success_add']                                = 'Успешно добавлено!';
$_['success_delete']                             = 'Успешно удалено!';
$_['success_clear']                              = 'Успешно очищено!';