<?php
// *   Аўтар: "БуслікДрэў" ( https://buslikdrev.by/ )
// *   © 2016-2022; BuslikDrev - Усе правы захаваныя.
// *   Спецыяльна для сайта: "OpenCart.pro" ( https://opencart.pro/ )

// Heading
$_['heading_title']                              = '<b>Буслік Кэш <span style="color:blue">Lite</span></b> v' . (isset($this->data['bus_cache_version']) ? $this->data['bus_cache_version'] : '1.0');
$_['heading_description']                        = '';

// Tab
$_['tab_setting']                                = 'Налады';
$_['tab_cache']                                  = 'Кэширование';
$_['tab_pagespeed']                              = 'PageSpeed';
$_['tab_support']                                = 'Тэхнічная падтрымка';

// Text
$_['text_extension']                             = 'Пашырэньні';
$_['text_module']                                = 'Модулі';
$_['text_edit']                                  = 'Рэдагаванне';
$_['text_min']                                   = 'От';
$_['text_max']                                   = 'До';
$_['text_yes']                                   = 'Так';
$_['text_no']                                    = 'Не';
$_['text_enabled']                               = 'Уключана';
$_['text_disabled']                              = 'Адключана';
$_['text_all']                                   = ' --- Усе --- ';
$_['text_none']                                  = ' --- Не выбрана --- ';
$_['text_select']                                = ' --- Выбраць --- ';
$_['text_select_all']                            = 'Вылучыць усё';
$_['text_unselect_all']                          = 'Зняць вылучэнне';
$_['text_width']                                 = 'Ширина';
$_['text_height']                                = 'Высота';
$_['text_install']                               = 'Усталёўка модуля...';
$_['text_uninstall']                             = 'Выдаленне модуля...';
$_['text_uninstall_files']                       = 'Выдаленне файлаў модуля...';
$_['text_uninstall_files_log']                   = 'Справаздача аб выдаленні файлаў модуля';
$_['text_ocmod_clear']                           = 'Чыстка мадыфікатараў...';
$_['text_ocmod_clearlog']                        = 'Чыстка лога мадыфікатараў...';
$_['text_ocmod_refresh']                         = 'Абнаўленьнне мадыфікатараў...';
$_['text_cache_clear']                           = 'Чыстка кэша...';
$_['text_processing']                            = 'Апрацоўка';
$_['text_loading']                               = 'Загрузка';
$_['text_start']                                 = 'Старт';
$_['text_continue']                              = 'Працягнуць';
$_['text_pause']                                 = 'Паўза';
$_['text_restart']                               = 'Рэстарт';
$_['text_link']                                  = 'Спасылка';
$_['text_default']                               = 'Па змаўчанні';
$_['text_guest']                                 = 'Госць';
$_['text_dir_1']                                 = 'Справа на лева';
$_['text_dir_2']                                 = 'Злева на права';
$_['text_time_php']                              = 'Затрачено времени PHP: %s секунд';
$_['text_time_js']                               = 'Затрачено времени JavaScript: %s секунд';
$_['text_total']                                 = 'Всего файлов обработано:';
$_['text_path']                                  = 'Шлях';
$_['text_no_results']                            = 'Няма дадзеных';
$_['text_confirm']                               = 'Вы ўпэўненыя?';
$_['text_pagespeed_inline_transfer_1']           = 'Вверх';
$_['text_pagespeed_inline_transfer_2']           = 'Вниз';
$_['text_pagespeed_inline_transfer_3']           = 'В файл сжатия';
$_['text_author']                                = 'Аўтар: <a href="https://buslikdrev.by/" title="Тавары рамеснай вытворчасці" rel="noreferrer noopener" target="_blank">БуслікДрэў</a>. Тых. падтрымка: <a href="https://liveopencart.ru/buslikdrev" title="Тэхнічная дапамога па вырашэнні праблем звязаныя з модулем" rel="noreferrer noopener" target="_blank">ТУТ</a>. Тэма падтрымкі: <a href="https://forum.opencart.pro/topic/6191-буслік-кэш-buslik-cache/" title="Тэхнічная дапамога па вырашэнні праблем звязаныя з модулем" rel="noreferrer noopener" target="_blank">ТУТ</a>.';
$_['text_corp']                                  = '© 2016-' . date('d.m.Y') . '; <a href="https://buslikdrev.by/" title="BuslikDrev" rel="noreferrer noopener" target="_blank">BuslikDrev</a> - Усе правы захаваныя.';

// Entry
$_['entry_status']                               = 'Статус';
$_['entry_store']                                = 'Крама';
$_['entry_cache_status']                         = 'Уключыць кэшаванне';
$_['entry_cache_ses']                            = 'Параметры сесій';
$_['entry_cache_onrot']                          = 'Параметры працы';
$_['entry_cache_rot']                            = 'Параметры выключэння';
$_['entry_cache_customer']                       = 'Кэшаваць для аўтарызаваных карыстальнікаў?';
$_['entry_cache_oc']                             = 'Кантраляваць кэш OpenCart';
$_['entry_cache_engine']                         = 'Тып кэша';
$_['entry_cache_expire']                         = 'Час жыцця кэша';
$_['entry_cache_device']                         = 'Уключыць вызначэнне мабільных прылад';
$_['entry_pagespeed_status']                     = 'Уключыць аптымізацыю (PageSpeed)';
$_['entry_pagespeed_rot']                        = 'Параметры выключэння';
$_['entry_pagespeed_preload_logo']               = 'Предзагружать Лого сайта';
$_['entry_pagespeed_attribute_w_h']              = 'Уключыць атрыбуты шырыні і вышыні';
$_['entry_pagespeed_lazy_load']                  = 'Уключыць Lazy load';
$_['entry_pagespeed_replace']                    = 'Замена';
$_['entry_pagespeed_html_min']                   = 'Сціскаць html-код';
$_['entry_pagespeed_css_min']                    = 'Сціскаць css-код';
$_['entry_pagespeed_css_min_links']              = 'Спасылкі на css файлы';
$_['entry_pagespeed_css_min_download']           = 'Спасылкі на css файлы для запампоўкі';
$_['entry_pagespeed_css_min_exception']          = 'Выключэнне з сціску css';
$_['entry_pagespeed_css_min_font']               = 'Предзагрузка шрыфтоў або малюнкаў';
$_['entry_pagespeed_css_min_display']            = 'Font-Display';
$_['entry_pagespeed_css_critical']               = 'Включить сбор критических стилей';
$_['entry_pagespeed_css_inline_transfer']        = 'Переместить инлайн css-код';
$_['entry_pagespeed_css_events']                 = 'Cобытия для запуска css-кода';
$_['entry_pagespeed_css_style']                  = 'Стиль';
$_['entry_pagespeed_js_min']                     = 'Сціскаць js-код';
$_['entry_pagespeed_js_min_links']               = 'Спасылкі на js файлы';
$_['entry_pagespeed_js_min_download']            = 'Ссылки на js файлы для скачивания';
$_['entry_pagespeed_js_min_exception']           = 'Выключэнне з сціску js';
$_['entry_pagespeed_js_inline_event']            = 'Отложить загрузку инлайн js-кода';
$_['entry_pagespeed_js_inline_event_time']       = 'Время до автозапуска инлайн js-кода';
$_['entry_pagespeed_js_inline_transfer']         = 'Переместить инлайн js-код';
$_['entry_pagespeed_js_events']                  = 'Cобытия для запуска js-кода';
$_['entry_pagespeed_js_script']                  = 'Скрипт';
$_['entry_debug']                                = 'Уключыць адладку';

// Help
$_['help_status']                                = 'Калі адключана, то ўвесь функцыянал ніжэй будзе адключаны.';
$_['help_store']                                 = 'Выберыце крамы ў якіх будзе працаваць модуль.';
$_['help_cache_status']                          = 'Калі так, то будуць кэшавацца старонкі цалкам.';
$_['help_cache_ses']                             = 'Пазначце параметры сесій для разнастайнасці кэша. Калі патрэбны параметр у масіве, то паказвайце кожны параметр масіва праз \' | \', напрыклад, $session[\'products\'][\'total\'] =&gt; products|total';
$_['help_cache_onrot']                           = 'Пакажыце роут модуляў або іх keyword (seo_url) для дакладнай працы модуля (Пры запаўненні параметры выключэння дзейнічаць не будуць).';
$_['help_cache_rot']                             = 'Пазначце роут модуляў або іх keyword (seo_url) для выключэння з кэша.';
$_['help_cache_oc']                              = 'Калі так, то кэш іншых модуляў будзе кантралявацца наладамі Буслік Кэш.';
$_['help_cache_engine']                          = 'Па умолчапнию File.<br />APC - гэта кэш кодаў аперацый і сховішча дадзеных з дапамогай аператыўнай памяці, падыходзіць для тых у каго няма пашырэння OPCache;<br />APCu - гэта новая версія APC преднозначено толькі для захоўвання дадзеных з дапамогай аператыўнай памяці. Рэкамендуецца ўключаць OPCache на сэрвэры;<br />Buslik - тое самае, што і File, але дазваляе захоўваць файлы кэша падзяляючы па тэчках у залежнасці ад крамы, мовы, групы пакупнікоў, прылады, катэгорыі і вытворцы, тым самым паскарае пошук патрэбнага кэш файла і дазваляе захоўваць большую колькасць;<br />File - стандартнае захоўванне кэш файлаў у system/storage/cache/;<br />Memcache - кэшаванне дадзеных у аператыўнай памяці на аснове хэш-табліцы;<br />Memcached - новая версія Memcache для кэшавання дадзеных у аператыўнай памяці на аснове хэш-табліцы;<br />Redis - тое самае, што Memcached, але з вялікімі магчымасцямі;';
$_['help_cache_expire']                          = 'Па умолчапнию 3600 секунд. Час жыцця кэша задаецца ў секундах.';
$_['help_cache_device']                          = 'Калі так, то кэш будзе стварацца асобна пад розныя прылады.';
$_['help_pagespeed_status']                      = 'Уключэнне аптымізацыі павінна паскорыць аддачу кантэнту тым самым палюбіць ваш сайт з пошукавымі робатамі, а значыць пазіцыі ў пошукавай выдачы павінны стаць вышэй.';
$_['help_pagespeed_rot']                         = 'Пакажыце роут модуляў або іх keyword (seo_url) для выключэння з аптымізацыі.';
$_['help_pagespeed_preload_logo']                = 'Уключэнне гэтай функцыі павінна дапамагчы прыбраць зрухі дызайну з-за загрузкі лога падчас загрузкі дызайну.';
$_['help_pagespeed_attribute_w_h']               = 'Уключэнне гэтай функцыі будзе дадаваць атрыбуты шырыні і вышыні да ўсіх малюнках у якіх у назвах ёсць іх памеры, напрыклад, image-100х100.jpg';
$_['help_pagespeed_lazy_load']                   = 'Выберыце варыянт падгрузкі малюнкаў та кадр вікон.';
$_['help_pagespeed_replace']                     = 'Укажите роут или keyword, потом после \' | \' укажите строку кода которую нужно заменить, потом после \' | \' укажите на какую строку заменить. Если хотите на всех страницах, то вместо роута укажите \' # \'. Если не хотите удалять, то в начале строки установие  \' ; \'.';
$_['help_pagespeed_html_min']                    = 'Выберыце варыянт сціску html-кода. 0 - без сціску, 4 максімальны сціск.';
$_['help_pagespeed_css_min']                     = 'Выберыце варыянт сціску css-кода. 0 - без зборкі, 1 - зборка без сціску, 5 максімальны сціск. Калі ўключана, то ўсе файлы стыляў, якія апрацоўвае OpenCart па стандарце, будуць злучаныя ў адзін файл і максімальна сціснутыя.';
$_['help_pagespeed_css_min_links']               = 'Добавьте ссылку на css стиль который не попал в общий файл стилей (для работы с других сайтов, укажите ссылку также в поле для скачивания). Значение задаётся начиная с новой строки. Если не хотите удалять, то перед ссылкой установие  \' ; \'. Если вы хотите указать свои атрибуты, то после ссылки установите \' | \' и впишите атрибуты, пример, catalog/style.css|type=&quot;text/css&quot; rel=&quot;preload&quot;<br />Также можно указать в начале ссылки следующие параметры (атрибуты имеют вверх над параметрами, кроме параметров перемещения):<br />[header] - отправить ссылку в самый верх сайта;<br />[footer] - отправить ссылку в самый низ сайта;<br />[async] - просит браузер загрузить асинхронно;<br />[defer] - просит браузер загрузить сразу после построения структуры DOM;<br />[prelod] - просит браузер предварительно загрузить;<br />[prefetch] - просит браузер отложить загрузку в конец;<br />[dns-prefetch] - просит браузер заранее выполнить резолвинг DNS для домена;<br />[preconnect] - просит браузер заранее подключиться к домену;<br />[event] - отложить загрузку по событию любого действия;<br />[event-2000] - отложить загрузку по времени;<br />[critical] - этот стиль является критическим и его загрузить отдельно, и самым первым (если такой стиль подготовлен вами, то можно не включать функцию создания критических стилей);';
$_['help_pagespeed_css_min_download']            = 'Дадайце спасылку на css стыль які трэба спампаваць на свой сайт (запампуе пры захаванні настроек, настойліва раім захаваць бягучыя налады). Калі не жадаеце выдаляць, то перад спасылкай ўсталююць \' ; \'.';
$_['help_pagespeed_css_min_exception']           = 'Дадайце спасылку на css стыль які хочаце выключыць і адправіць па сваім шляху. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то перад спасылкай ўсталююць \' ; \'. Если вы хотите указать свои атрибуты, то после ссылки установите \' | \' и впишите атрибуты, пример, catalog/style.css|type=&quot;text/css&quot; rel=&quot;preload&quot;<br />Также можно указать в начале ссылки следующие параметры (атрибуты имеют вверх над параметрами, кроме параметров перемещения):<br />[header] - отправить ссылку в самый верх сайта;<br />[footer] - отправить ссылку в самый низ сайта;<br />[async] - просит браузер загрузить асинхронно;<br />[defer] - просит браузер загрузить сразу после построения структуры DOM;<br />[prelod] - просит браузер предварительно загрузить;<br />[prefetch] - просит браузер отложить загрузку в конец;<br />[dns-prefetch] - просит браузер заранее выполнить резолвинг DNS для домена;<br />[preconnect] - просит браузер заранее подключиться к домену;<br />[event] - отложить загрузку по событию любого действия;<br />[event-2000] - отложить загрузку по времени;<br />[critical] - этот стиль является критическим и его загрузить отдельно, и самым первым (если такой стиль подготовлен вами, то можно не включать функцию создания критических стилей);';
$_['help_pagespeed_css_min_font']                = 'Дадайце спасылку на шрыфт або карцінку на якую лаецца Pagespeed - просіць, каб предзагрузили. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то перад спасылкай ўсталююць \' ; \'. Таксама можаце паказаць даменнае імя іншых шрыфтоў разам са спасылкай стылю у якім ідзе загрузяць шрыфтоў падзяліўшы \' | \', тады гэта даменнае імя будзе прадвызначаецца (dns-prefetch, preconnect), напрыклад, https://fonts.gstatic.com/|https://fonts.googleapis.com/css?family=Open+Sans:400,400i,300,700&display=swap';
$_['help_pagespeed_css_min_display']             = 'Уключыце гэтую функцыю, каб 100% для шрыфтоў было ўстаноўлена ўласцівасць font-display каб не паказваць нябачны тэкст.';
$_['help_pagespeed_css_critical']                = 'Включение этой функции будет собирать необходимые стили при первой загрузки страницы и отправлять на сервер, позже все стили будут загружаться по взаимодействию. В целях безопасности сбор стилей будет доступен при загрузки страницы администратором.';
$_['help_pagespeed_css_inline_transfer']         = 'Выберите вариант перемещения css-кода.<br />Вверх - сразу перед </head>;<br />Вниз - сразу перед </body>;<br />В файл сжатия - в самый низ файла который загружается сразу;</head>;';
$_['help_pagespeed_css_events']                  = 'Укажите при каких событиях запускать js-код, по-умолчанию событие вызовется 1 раз. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установие  \' ; \'.';
$_['help_pagespeed_css_style']                   = 'Здесь вы можете задать стили для адаптации стилей модуля под дизайн своего сайта. Указывать теги &lt;style&gt;&lt;/style&gt; не нужно.';
$_['help_pagespeed_js_min']                      = 'Выберыце варыянт сціску js-кода. 0 - без зборкі, 1 - зборка без сціску, 4 максімальны сціск. Калі ўключана, то ўсе файлы скрыптоў, якія апрацоўвае OpenCart па стандарце, будуць злучаныя ў адзін файл і максімальна сціснутыя.';
$_['help_pagespeed_js_min_links']                = 'Добавьте ссылку на js скрипт который не попал в общий файл скриптов. Значение задаётся начиная с новой строки. Если не хотите удалять, то перед ссылкой установие  \' ; \'. Если вы хотите указать свои атрибуты, то после ссылки установите \' | \' и впишите атрибуты, пример, catalog/script.js|type=&quot;text/javascript&quot;<br />Также можно указать в начале ссылки следующие параметры (атрибуты имеют вверх над параметрами, кроме параметров перемещения):<br />[header] - отправить ссылку в самый верх сайта;<br />[footer] - отправить ссылку в самый низ сайта;<br />[async] - просит браузер загрузить асинхронно;<br />[defer] - просит браузер загрузить сразу после построения структуры DOM;<br />[prelod] - просит браузер предварительно загрузить;<br />[prefetch] - просит браузер отложить загрузку в конец;<br />[dns-prefetch] - просит браузер заранее выполнить резолвинг DNS для домена;<br />[preconnect] - просит браузер заранее подключиться к домену;<br />[event] - отложить загрузку по событию любого действия;<br />[event-2000] - отложить загрузку по времени;';
$_['help_pagespeed_js_min_download']             = 'Добавьте ссылку на js скрипт который нужно скачать на свой сайт (скачает при сохранении настроек или чистки кэша, рекомендуется сначала сохранить текущие настройки). Если не хотите удалять, то перед ссылкой установие  \' ; \'.';
$_['help_pagespeed_js_min_exception']            = 'Дадайце спасылку на js скрыпт які хочаце выключыць і адправіць па сваім шляху. Напрыклад, бываюць скрыпты якія цалкам незалежныя і не блакуюць рэндэру старонкі, таму не варта іх сціскаць з іншымі бо гэта можа пагоршыць аптымізацыю. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то перад спасылкай ўсталююць \' ; \'. Если вы хотите указать свои атрибуты, то после ссылки установите \' | \' и впишите атрибуты, пример, catalog/script.js|type=&quot;text/javascript&quot;<br />Также можно указать в начале ссылки следующие параметры (атрибуты имеют вверх над параметрами, кроме параметров перемещения):<br />[header] - отправить ссылку в самый верх сайта;<br />[footer] - отправить ссылку в самый низ сайта;<br />[async] - просит браузер загрузить асинхронно;<br />[defer] - просит браузер загрузить сразу после построения структуры DOM;<br />[prelod] - просит браузер предварительно загрузить;<br />[prefetch] - просит браузер отложить загрузку в конец;<br />[dns-prefetch] - просит браузер заранее выполнить резолвинг DNS для домена;<br />[preconnect] - просит браузер заранее подключиться к домену;<br />[event] - отложить загрузку по событию любого действия;<br />[event-2000] - отложить загрузку по времени;';
$_['help_pagespeed_js_inline_event']             = 'Укажите строку или часть строки js-кода, тогда весь блок кода в &lt;script&gt;&lt;/script&gt; будет обвёрнуто в событие запуска при любом взаимодействии с сайтом. Значение задаётся начиная с новой строки. Если не хотите удалять, то перед строкой установие  \' ; \'.';
$_['help_pagespeed_js_inline_event_time']        = 'Укажите время в миллисекундах, если нужно, чтобы отложенные скрипты запустились сами не дожидаясь любого взаимодействия с сайтом. Если указано 0, то автозапуск не будет работать.';
$_['help_pagespeed_js_inline_transfer']          = 'Выберите вариант перемещения js-кода.<br />Вверх - сразу перед </head>;<br />Вниз - сразу перед </body>;<br />В файл сжатия - в самый низ файла который загружается сразу;';
$_['help_pagespeed_js_events']                   = 'Укажите при каких событиях запускать js-код, по-умолчанию событие вызовется 1 раз. Значение задаётся начиная с новой строки. Если не хотите удалять, то в начале строки установие  \' ; \'.';
$_['help_pagespeed_js_script']                   = 'Здесь вы можете задать скрипты для адаптации стилей модуля под дизайн своего сайта. Указывать теги &lt;script&gt;&lt;/script&gt; не нужно.';
$_['help_debug']                                 = 'Калі так, то для адміністратара над шапкай сайта будзе выводзіцца інфармацыя аб часе загрузкі старонкі, таксама кэш пачне дзейнічаць.';

//Button
$_['button_files_clear']                         = 'Выдаліць таксама файлы модуля? - калі няма, проста абновіце старонку ад граху. Справаздача аб выдаленні файлаў глядзіце ў логах мадыфікатараў.';
$_['button_add']                                 = 'Дадаць';
$_['button_delete']                              = 'Выдаліць';
$_['button_clear']                               = 'Ачысціць кэш';
$_['button_save']                                = 'Захаваць';
$_['button_apply']                               = 'Прымяніць';
$_['button_apply_piecemeal']                     = 'Прымяніць часткамі';
$_['button_export']                              = 'Экспарт';
$_['button_import']                              = 'Імпарт';
$_['button_start']                               = 'Запуск загрузкі';
$_['button_continue']                            = 'Працяг загрузкі з месца прыпынку';
$_['button_pause']                               = 'Прыпыненне загрузкі';
$_['button_restart']                             = 'Перазапуск загрузкі - пачаць спачатку';
$_['button_search']                              = 'Знайсці';
$_['button_edit']                                = 'Рэдагаваць';

// Error
$_['error_permission']                           = 'У вас недастаткова правоў для ўнясення змяненняў!';
$_['error_warning']                              = 'Уважліва праверце форму на памылкі!';
$_['error_install']                              = 'Нешта пайшло не так!';
$_['error_uninstall']                            = 'Нешта пайшло не так!';
$_['error_name']                                 = 'Назва павінна ўтрымліваць ад 3 да 64 знакаў!';
$_['error_width']                                = 'Пазначце Шырыню!';
$_['error_height']                               = 'Пазначце Вышыню!';
$_['error_max_input_vars']                       = '<b>Увага! Будзе перавышаны ліміт параметру %s</b>, калі перавысіць, дадзеныя могуць не захавацца. Павялічце значэнне на серверы або звярніцеся з дадзенай просьбай да хостеру для павелічэння ліміту. Або скарыстайцеся кнопкай прымянення часткамі.<br>Ліміт на сэрвэру: %s <br>Ліміт ад модуля: %s - адсечка %s каб пазбегнуць страты дадзеных<br>Бягучы значэнне: ';
$_['error_setting_import']                       = 'Файл не ўтрымлівае налады модуля, імпарту адмоўлена!';
$_['error_setting_import_format']                = 'Модуль не ведае пра такі фармат, імпарту адмоўлена! - модуль мякка вас паслаў.';
$_['error_not_required']                         = 'Не патрабуецца!';

// Success
$_['success_install']                            = ' - паспяхова ўсталявана!';
$_['success_uninstall']                          = ' - паспяхова выдалены!';
$_['success_uninstall_data_base']                = '◄ База дадзеных выдаленая ►: ';
$_['success_uninstall_modification']             = '◄ Мадыфікатар выдалены ►: ';
$_['success_uninstall_folder']                   = '◄ Папка выдаленая бо файлаў няма ►: ';
$_['success_uninstall_file']                     = '◄ Файл выдалены ►: ';
$_['success_update']                             = ' - паспяхова абноўлены!';
$_['success_setting']                            = 'Налады паспяхова зменены!';
$_['success_setting_apply']                      = 'Налады паспяхова ужытыя!';
$_['success_setting_save']                       = 'Налады паспяхова захаваны!';
$_['success_setting_new']                        = 'Новы модуль паспяхова дададзены!';
$_['success_setting_redirect']                   = 'Вы былі перанакіраваны на патрэбную старонку налад!';
$_['success_setting_import']                     = 'Налады модуля "%s" паспяхова імпартаваныя ў модуль, вам засталося іх прымяніць!';
$_['success_add']                                = 'Паспяхова дададзена!';
$_['success_delete']                             = 'Паспяхова выдалена!';
$_['success_clear']                              = 'Паспяхова ачышчана!';