<?php
// *   Аўтар: "БуслікДрэў" ( https://buslikdrev.by/ )
// *   © 2016-2024; BuslikDrev - Усе правы захаваны.

eval(base64_decode('aWYgKCFpc3NldCgkdGhpcy0+ZGF0YVsnYnVzX2NhY2hlX3ZlcnNpb24nXSkpIHsNCgkkdGhpcy0+ZGF0YVsnYnVzX2NhY2hlX3ZlcnNpb24nXSA9ICcxLjAnOw0KCWlmICh2ZXJzaW9uX2NvbXBhcmUoVkVSU0lPTiwgJzQuMC4wJywgJz49JykpIHsNCgkJJGZpbGUgPSBESVJfRVhURU5TSU9OIC4gJ2J1c19jYWNoZS9hZG1pbi9jb250cm9sbGVyL21vZHVsZS9idXNfY2FjaGUucGhwJzsNCgl9IGVsc2VpZiAodmVyc2lvbl9jb21wYXJlKFZFUlNJT04sICcyLjMuMCcsICc+PScpKSB7DQoJCSRmaWxlID0gRElSX0FQUExJQ0FUSU9OIC4gJ2NvbnRyb2xsZXIvZXh0ZW5zaW9uL21vZHVsZS9idXNfY2FjaGUucGhwJzsNCgl9IGVsc2Ugew0KCQkkZmlsZSA9IERJUl9BUFBMSUNBVElPTiAuICdjb250cm9sbGVyL21vZHVsZS9idXNfY2FjaGUucGhwJzsNCgl9DQoJaWYgKGlzX2ZpbGUoJGZpbGUpKSB7DQoJCWluY2x1ZGVfb25jZSgkZmlsZSk7DQoJCSR0aGlzLT5kYXRhWydidXNfY2FjaGVfdmVyc2lvbiddID0gKGNsYXNzX2V4aXN0cygnQnVzQ2FjaGUnKSA/IChuZXcgQnVzQ2FjaGUobmV3IFJlZ2lzdHJ5KCkpKS0+dmVyc2lvbiA6ICR0aGlzLT5kYXRhWydidXNfY2FjaGVfdmVyc2lvbiddKTsNCgl9DQp9'));

// Heading
$_['heading_title'] = 'Буслік Кэш <span style="color:limegreen">Full</span></b> v' . $this->data['bus_cache_version'];
$_['heading_description'] = '';

// Tab
$_['tab_setting'] = 'Налады';
$_['tab_cache'] = 'Кэшаванне';
$_['tab_pagespeed'] = 'PageSpeed';
$_['tab_image'] = 'Малюнкі';
$_['tab_html'] = 'Разметка шаблона - HTML';
$_['tab_css'] = 'Стылі - CSS';
$_['tab_js'] = 'Скрыпты - JS';
$_['tab_database'] = 'Аптымізацыя базы дадзеных';
$_['tab_export'] = 'Экспарт';
$_['tab_import'] = 'Імпарт';
$_['tab_cron'] = 'Cron';
$_['tab_documentation'] = 'Дакументацыя';
$_['tab_support'] = 'Тэхнічная падтрымка';

// Text
$_['text_extension'] = 'Пашырэньні';
$_['text_module'] = 'Модулі';
$_['text_edit'] = 'Рэдагаванне';
$_['text_min'] = 'Ад';
$_['text_max'] = 'Да';
$_['text_yes'] = 'Так';
$_['text_no'] = 'Не';
$_['text_enabled'] = 'Уключана';
$_['text_disabled'] = 'Адключана';
$_['text_all'] = ' --- Усё --- ';
$_['text_none'] = ' --- Не абрана --- ';
$_['text_select'] = ' --- Абярыце --- ';
$_['text_select_all'] = 'Вылучыць усё';
$_['text_unselect_all'] = 'Зняць вылучэнне';
$_['text_width'] = 'Шырыня';
$_['text_height'] = 'Вышыня';
$_['text_install'] = 'Усталяванне модуля...';
$_['text_uninstall'] = 'Выдаленне модуля...';
$_['text_uninstall_files'] = 'Выдаленне файлаў модуля...';
$_['text_uninstall_files_log'] = 'Справаздача аб выдаленні файлаў модуля';
$_['text_ocmod_clear'] = 'Чыстка мадыфікатараў...';
$_['text_ocmod_clearlog'] = 'Чыстка лога мадыфікатараў...';
$_['text_ocmod_refresh'] = 'Абнаўленне мадыфікатараў...';
$_['text_cache_clear'] = 'Чыстка кэша...';
$_['text_processing'] = 'Апрацоўка';
$_['text_loading'] = 'Загрузка';
$_['text_start'] = 'Старт';
$_['text_continue'] = 'Працягнуць';
$_['text_pause'] = 'Паўза';
$_['text_restart'] = 'Рэстарт';
$_['text_link'] = 'Спасылка';
$_['text_default'] = 'Па змаўчанні';
$_['text_guest'] = 'Госць';
$_['text_dir_1'] = 'Справа налева';
$_['text_dir_2'] = 'Злева на права';
$_['text_path'] = 'Шлях';
$_['text_no_results'] = 'Няма дадзеных';
$_['text_confirm'] = 'Вы ўпэўненыя?';
$_['text_version'] = 'Версія';
$_['text_cache_status_2'] = 'Так, калі не кэшуюцца кантролеры і мадэлі';
$_['text_cache_clear_blog_category'] = 'Пры рэдагаванні катэгорый блога';
$_['text_cache_clear_blog_article'] = 'Пры рэдагаванні артыкулаў блога';
$_['text_cache_clear_category'] = 'Пры рэдагаванні катэгорый';
$_['text_cache_clear_information'] = 'Пры рэдагаванні інфармацыйных старонак';
$_['text_cache_clear_manufacturer'] = 'Пры рэдагаванні вытворцаў';
$_['text_cache_clear_product'] = 'Пры рэдагаванні тавара';
$_['text_cache_clear_time'] = 'Па заканчэнні ўсталяванага часу (не рэкамендуецца, але калі шкада грошай на памяць, то вам можна)';
$_['text_pagespeed_image_webp_convert_1'] = 'Генераваць праз GD';
$_['text_pagespeed_image_webp_convert_2'] = 'Генераваць праз ImageMagick';
$_['text_pagespeed_min_1'] = 'Аб\'ядноўваць файлы';
$_['text_pagespeed_min_2'] = 'Прыбраць каментары';
$_['text_pagespeed_min_3'] = 'Прыбраць прабелы';
$_['text_pagespeed_min_4'] = 'Прыбраць перанос радкоў';
$_['text_pagespeed_min_5'] = 'Прыбраць <!-- //--> у інлайн скрыптах';
$_['text_pagespeed_transfer_1'] = 'Уверх';
$_['text_pagespeed_transfer_2'] = 'Уніз';
$_['text_pagespeed_transfer_3'] = 'У файл сціску спасылка уверсе';
$_['text_pagespeed_transfer_4'] = 'У файл сціску спасылка ўнізе';
$_['text_export_import_format_sql'] = 'SQL';
$_['text_export_import_format_json'] = 'JSON';
$_['text_export_import_format_csv'] = 'CSV';
$_['text_export_import_format_xls'] = 'XLS';
$_['text_export_import_format_xlsx'] = 'XLSX';
$_['text_export_import_format_xml'] = 'XML';
$_['text_export_import_format_yml'] = 'YML';
$_['text_export_import_copy_1'] = 'Jet Cache v23+';
$_['text_export_import_copy_2'] = 'XYz аптымізэр v1.4+';
$_['text_export_import_copy_3'] = 'Lighting';
$_['text_export_import_copy_4'] = '';
$_['text_support_stats_loading'] = 'Ідзе загрузка статыстыкі - чакайце!';
$_['text_support_stats_success'] = 'Статыстыка паспяхова загружана!';
$_['text_support_stats_danger'] = 'Памылка загрузкі статыстыкі!';
$_['text_support_cache_total'] = 'Колькасць файлаў кэша:';
$_['text_support_cache_size'] = 'Памер файлаў кэша:';
$_['text_support_cache_minify_total'] = 'Колькасць файлаў кэша js і css:';
$_['text_support_cache_minify_size'] = 'Памер файлаў кэша js і css:';
$_['text_support_image_total'] = 'Колькасць усяго файлаў малюнкаў:';
$_['text_support_image_size'] = 'Памер усяго файлаў выяваў:';
$_['text_support_image_cache_total'] = 'Колькасць рэсайз копій малюнкаў:';
$_['text_support_image_cache_size'] = 'Памер рэсайз копій малюнкаў:';
$_['text_support_session_total'] = 'Колькасць файлаў сесій:';
$_['text_support_session_size'] = 'Памер файлаў сесій:';
$_['text_support_session_db_total'] = 'Колькасць запісаў сесій у БД:';
$_['text_support_session_db_size'] = 'Памер запісаў сесій у БД:';
$_['text_support_session_cart_total'] = 'Колькасць запісаў сесій гасцявых кошыкаў у БД:';
$_['text_support_session_cart_size'] = 'Памер запісаў сесій гасцявых кошыкаў у БД:';
$_['text_support_disc_total'] = 'Усяго памяці на дыску:';
$_['text_support_disc_free'] = 'Свабоднага месца на дыску:';
$_['text_support_debug_2'] = 'Ды і пераствараць кэш css, js';
$_['text_support_debug_3'] = 'Ды і паказваць хуткасць кантролераў';
$_['text_support_debug_4'] = 'Ды і паказваць хуткасць мадэляў';
$_['text_support_debug_5'] = 'Ды і паказваць data-busloadinglazy-id';
$_['text_support_debug_6'] = 'Ды і паказваць bus_ajax_id';
$_['text_author'] = 'Аўтар: <a href="https://buslikdrev.by/" title="Тавары рамеснай вытворчасці" rel="noreferrer noopener" target="_blank">БуслікДрэў</a>. Тых. падтрымка: <a href="https://liveopencart.ru/buslikdrev" title="Тэхнічная дапамога па рашэнні праблем звязаныя з модулем" rel="noreferrer noopener" target="_blank">ТУТ</a>.';
$_['text_corp'] = '© 2016-' . date('d.m.Y') . '; <a href="https://buslikdrev.by/" title="BuslikDrev" rel="noreferrer noopener" target="_blank">BuslikDrev</a> - Усе правы захаваны.';

// Entry
$_['entry_status'] = 'Статус';
$_['entry_store'] = 'Крама';
$_['entry_cache_status'] = 'Уключыць кэшаванне старонак';
$_['entry_cache_con'] = 'Параметры config';
$_['entry_cache_ses'] = 'Параметры session';
$_['entry_cache_cok'] = 'Параметры cookie';
$_['entry_cache_par'] = 'Параметры абмежавання';
$_['entry_cache_onrot'] = 'Параметры працы';
$_['entry_cache_rot'] = 'Параметры выключэння';
$_['entry_cache_customer'] = 'Кэшаваць для аўтарызаваных карыстальнікаў?';
$_['entry_cache_cart'] = 'Кэшаваць кошык';
$_['entry_cache_cart_count'] = 'Кэшаваць пры наяўнасці тавара ў кошыку';
$_['entry_cache_controller'] = 'Кэшаванне функцый кантролераў';
$_['entry_cache_controller_ajax'] = 'Ajax загрузка функцый кантролераў';
$_['entry_cache_model'] = 'Кэшаванне функцый мадэляў';
$_['entry_cache_engine'] = 'Апрацоўшчык кэша';
$_['entry_cache_engine_mine'] = 'Свой апрацоўшчык кэша';
$_['entry_cache_oc'] = 'Кантраляваць кэш OpenCart';
$_['entry_cache_expire'] = 'Час жыцця кэша OpenCart';
$_['entry_cache_expire_controller'] = 'Час жыцця кэша кантролераў';
$_['entry_cache_expire_model'] = 'Час жыцця кэша мадэляў';
$_['entry_cache_expire_all'] = 'Час жыцця кэша старонак';
$_['entry_cache_size_limit'] = 'Памер кэша';
$_['entry_cache_count'] = 'Колькасць даступнага кэша';
$_['entry_cache_clear'] = 'Аўтаматычная чыстка кэша';
$_['entry_pagespeed_status'] = 'Уключыць аптымізацыю (PageSpeed)';
$_['entry_pagespeed_onrot'] = 'Параметры працы';
$_['entry_pagespeed_rot'] = 'Параметры выключэння';
$_['entry_pagespeed_image_lazy_load'] = 'Уключыць Lazy load малюнкаў';
$_['entry_pagespeed_image_first_boot_status'] = 'Уключыць First Boot малюнкаў';
$_['entry_pagespeed_image_first_boot_onrot'] = 'Параметры працы First Boot';
$_['entry_pagespeed_image_first_boot_rot'] = 'Параметры выключэння First Boot';
$_['entry_pagespeed_image_w_h'] = 'Уключыць атрыбуты шырыні і вышыні';
$_['entry_pagespeed_image_webp_status'] = 'Уключыць подджержку WebP малюнкаў';
$_['entry_pagespeed_image_webp_convert'] = 'Канвертаваць выявы ў WebP і назад';
$_['entry_pagespeed_image_webp_quality'] = 'Сціск WebP малюнкаў';
$_['entry_pagespeed_html_lazy_load'] = 'Уключыць Lazy load html';
$_['entry_pagespeed_html_replace_before'] = 'Замена ў html-кодзе да сціску';
$_['entry_pagespeed_html_replace_after'] = 'Замена ў html-кодзе пасля сціску';
$_['entry_pagespeed_html_min'] = 'Сціскаць html-код';
$_['entry_pagespeed_html_min_tags'] = 'Выдаленне водступаў злева ад тэгаў';
$_['entry_pagespeed_css_replace_before'] = 'Замена ў css-кодзе да сціску';
$_['entry_pagespeed_css_replace_after'] = 'Замена ў css-кодзе пасля сціску';
$_['entry_pagespeed_css_min'] = 'Сціскаць css-код';
$_['entry_pagespeed_css_min_links'] = 'Спасылкі на css файлы';
$_['entry_pagespeed_css_min_download'] = 'Спасылкі на css файлы для запампоўкі';
$_['entry_pagespeed_css_min_exception'] = 'Выключэнне са сціску css';
$_['entry_pagespeed_css_min_font'] = 'Перадзагрузка шрыфтоў або малюнкаў';
$_['entry_pagespeed_css_min_convert'] = 'Канвертацыя з кода ў файл';
$_['entry_pagespeed_css_min_display'] = 'Font-Display';
$_['entry_pagespeed_css_inline_transfer'] = 'Перамясціць інлайн css-код';
$_['entry_pagespeed_css_inline_exception'] = 'Выключэнне з пераносу інлайн css-кода';
$_['entry_pagespeed_css_events'] = 'Падзеі для запуску css-кода';
$_['entry_pagespeed_css_critical'] = 'Уключыць збор крытычных стыляў';
$_['entry_pagespeed_css_critical_all'] = 'Збіраць стылі па ўсіх элементах';
$_['entry_pagespeed_css_critical_offset'] = 'Адсечка збору ад вышыні экрана';
$_['entry_pagespeed_css_critical_time'] = 'Адтэрміноўка часу';
$_['entry_pagespeed_css_critical_elements'] = 'Элементы стыляў';
$_['entry_pagespeed_css_critical_links'] = 'Спасылкі на старонкі збору крытычных стыляў';
$_['entry_pagespeed_css_style'] = 'Стыль';
$_['entry_pagespeed_js_replace_before'] = 'Замена ў js-кодзе да сціску';
$_['entry_pagespeed_js_replace_after'] = 'Замена ў js-кодзе пасля сціску';
$_['entry_pagespeed_js_min'] = 'Сціскаць js-код';
$_['entry_pagespeed_js_min_links'] = 'Спасылкі на js файлы';
$_['entry_pagespeed_js_min_download'] = 'Спасылкі на js файлы для запампоўкі';
$_['entry_pagespeed_js_min_exception'] = 'Выключэнне са сціску js';
$_['entry_pagespeed_js_inline_event'] = 'Адкласці загрузку інлайн js-кода';
$_['entry_pagespeed_js_inline_event_time'] = 'Час да аўтазапуску інлайн js-кода';
$_['entry_pagespeed_js_inline_transfer'] = 'Перамясціць інлайн js-код';
$_['entry_pagespeed_js_inline_transfer_onrot'] = 'Пераносіць інлайн js-код';
$_['entry_pagespeed_js_inline_exception'] = 'Выключэнне з пераносу інлайн js-кода';
$_['entry_pagespeed_js_events'] = 'Падзеі для запуску js-кода';
$_['entry_pagespeed_js_script'] = 'Скрыпт';
$_['entry_database_status'] = 'Рэжым наладкі';
$_['entry_database_speed_site'] = 'Праверыць хуткасць сайта';
$_['entry_database_links'] = 'Цікаўныя спасылкі для праверкі';
$_['entry_database_tables'] = 'Табліцы';
$_['entry_database_indexs'] = 'Індэксы';
$_['entry_database_columns'] = 'Стоўбцы';
$_['entry_database_unique'] = 'Унікальны';
$_['entry_database_unique_elements'] = 'Унікальных элементаў';
$_['entry_database_packed'] = 'Упакаваны';
$_['entry_database_index'] = 'Індэкс';
$_['entry_database_index_name'] = 'Імя індэкса';
$_['entry_database_index_key_block_size'] = 'Памер блока ключа';
$_['entry_database_index_type'] = 'Тып';
$_['entry_database_index_parser'] = 'Парсер';
$_['entry_database_index_comment'] = 'Каментар';
$_['entry_database_column'] = 'Стоўбец';
$_['entry_cron_pregeneration'] = 'Уключыць прэгенерацыю кэша';
$_['entry_cron_pregeneration_query_count'] = 'Колькасць запытаў у секунду';
$_['entry_documentation_status'] = 'Я атрымаў дыплом Буслік';
$_['entry_support_update'] = 'Усталяванне абнаўленняў';
$_['entry_support_update_order_id'] = 'Нумар замовы';
$_['entry_support_update_key'] = 'Ліцэнзійны ключ';
$_['entry_support_stats_status'] = 'Уключыць статыстыку';
$_['entry_support_disc_size_limit'] = 'Ліміт памяці дыска';
$_['entry_support_disc_warning'] = 'Уключыць папярэджанне аб не хватцы памяці';
$_['entry_support_session_fix'] = 'Уключыць фікс запаўнення сесій';
$_['entry_support_debug'] = 'Уключыць адладку';
$_['entry_support_debug_log'] = 'Уключыць лагіраванне павольных старонак';

// Help
$_['help_status'] = 'Калі адключана, то ўвесь функцыянал ніжэй будзе адключаны.';
$_['help_store'] = 'Абярыце крамы, у якіх будзе працаваць модуль.';
$_['help_cache_status'] = 'Калі так, то будуць кэшавацца старонкі цалкам.';
$_['help_cache_con'] = 'Пакажыце параметры $this->config->get для разнастайнасці кэша. Калі патрэбны параметр у масіве, то паказвайце кожны параметр масіва праз \' | \', напрыклад, $this->config->get(\'products\')[\'total\'] =&gt; products|total. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_cache_ses'] = 'Пакажыце параметры $this->session->data для разнастайнасці кэша. Значэнне задаецца пачынаючы з новага радка. Калі патрэбны параметр у масіве, то паказвайце кожны параметр масіва праз \' | \', напрыклад, $this->session->data[\'products\'][\'total\'] =&gt; products|total. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_cache_cok'] = 'Пакажыце параметры $this->request->cookie для разнастайнасці кэша. Значэнне задаецца пачынаючы з новага радка. Калі патрэбны параметр у масіве, то паказвайце кожны параметр масіва праз \' | \', напрыклад, $this->request->cookie[\'products\'][\'total\'] =&gt; products|total. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_cache_par'] = 'Пакажыце параметры $this->request->get і $this->request->post для абмежавання кэша ў межах гэтых параметраў (гэта значыць іншыя параметры будуць абразацца і аддаваць гэтым параметрам кэш дазволеных). Значэнне задаецца пачынаючы з новага радка. Калі не трэба абмяжоўваць, то пакіньце поле пустым. Калі жадаеце, каб кэш не працаваў для забароненых параметраў, то першым радком усталюеце \'cache_off\'. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_cache_onrot'] = 'Пакажыце роўт або яго keyword (seo_url) старонкі для дакладнай працы (Пры запаўненні канфігурацыі і сесій дзейнічаць асноўныя налады не будуць), потым пасля \' | \' укажыце час кэшавання ў секундах, потым пасля \' | \' укажыце параметры $this->config->get() праз \' , \', калі яны патрэбныя, потым пасля \' | \' укажыце параметры $this->session->data праз \' , \', калі яны патрэбныя (калі гэта масіў, то падзяляйце параметры \' / \'), потым пасля \' | \' укажыце параметры $this->request->cookie праз \' , \', калі яны патрэбныя (калі гэта масіў, то падзяляйце параметры \' / \'), потым пасля \' | \' укажыце параметры $this->request->get і $this->request->post праз \' , \', калі яны патрэбныя (калі гэта масіў, то падзяляйце параметры \' / \'). Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_cache_rot'] = 'Пакажыце роўт або яго keyword (seo_url) старонкі для выключэння з кэша. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_cache_customer'] = 'Кэшаваць для аўтарызаваных карыстальнікаў?';
$_['help_cache_cart'] = 'Калі так, то кошык будзе кэшавацца для кожнага карыстальніка на час захоўвання кэша кантролераў.';
$_['help_cache_cart_count'] = 'Пакажыце максімальную колькасць тавараў у кошыку пры якім кэшаванне старонак будзе працаваць.';
$_['help_cache_controller'] = 'Пакажыце роўт кантролера які трэба закэшаваць (прыклад - extension/module/category), потым пасля \' | \' укажыце час кэшавання ў секундах, потым пасля \' | \' укажыце параметры $this->config->get() праз \' , \', калі яны патрэбныя (калі гэта масіў, то падзяляйце параметры \' / \'), потым пасля \' | \' укажыце параметры $this->session->data праз \' , \', калі яны патрэбныя (калі гэта масіў, то падзяляйце параметры \' / \'), потым пасля \' | \' укажыце параметры $this->request->cookie праз \' , \', калі яны патрэбныя (калі гэта масіў, то падзяляйце параметры \' / \'), потым пасля \' | \' укажыце параметры $this->request->get і $this->request->post праз \' , \', калі яны патрэбныя. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_cache_controller_ajax'] = 'Пазначце роўт або keyword (seo_url) старонкі, потым пасля \' | \' укажыце роўт кантролера які трэба загрузіць праз ajax (прыклад - extension/module/category, яго можна пазнаць над модулем на цікавай старонцы ў дэбаг рэжыме), потым пасля \' | \' укажыце module_id калі ён ёсць (яго можна пазнаць над модулем на цікавай старонцы ў дэбаг рэжыме), потым пасля \' | \' укажыце нумар загрузкі (яго можна пазнаць над модулем на цікавай старонцы ў дэбаг рэжыме), потым пасля \' | \' пакажыце шырыню экрана больш за якога пачаць загружаць кантролер, калі трэба абмежаваць да, то праз \' - \' пакажыце шырыню. Калі хочаце на ўсіх старонках, то замест роўту пазначце \' # \'. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'. bus_ajax_id для скрыптоў можна пазнаць над модулем на цікавай старонцы ў дэбаг рэжыме або праз кансоль браўзэра.';
$_['help_cache_model'] = 'Пакажыце роўт мадэлі, якую трэба закэшаваць (прыклад - catalog/category/getCategories), потым пасля \' | \' укажыце час кэшавання ў секундах, потым пасля \' | \' укажыце параметры $this->config->get() праз \' , \', калі яны патрэбныя (калі гэта масіў, то падзяляйце параметры \' / \'), потым пасля \' | \' укажыце параметры $this->session->data праз \' , \', калі яны патрэбныя (калі гэта масіў, то падзяляйце параметры \' / \'), потым пасля \' | \' укажыце параметры $this->request->cookie праз \' , \', калі яны патрэбныя (калі гэта масіў, то падзяляйце параметры \' / \'), потым пасля \' | \' укажыце параметры $this->request->get і $this->request->post праз \' , \', калі яны патрэбныя. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_cache_engine'] = 'Па змаўчанні Buslik.<br />APC - гэта кэш кодаў аперацый і сховішча дадзеных з дапамогай аператыўнай памяці, падыходзіць для тых у каго няма php пашырэнні OPCache;<br />APCu - гэта новая версія APC прызначанае толькі для захоўвання дадзеных з дапамогай аператыўнай памяці. Рэкамендуецца ўключаць OpCache на серверы; Buslik - таксама самае, што і файлавы кэш, але дазваляе захоўваць файлы кэша падзяляючы па тэчках у залежнасці ад роута і т.д., тым самым паскарае пошук патрэбнага кэш файла і дазваляе захоўваць большую колькасць ;<br />Memcache - кэшаванне дадзеных у аператыўнай памяці на аснове хэш-табліцы;<br />Memcached - новая версія Memcache для кэшавання дадзеных у аператыўнай памяці на аснове хэш-табліцы;<br />OpCache - таксама самае, што і Buslik, але захоўвае кэш у выглядзе php кода. Патрабуецца ў 2 разы больш дыскавай прасторы. Спачатку ствараецца php-код, потым другім праходам захоўваецца па алгарытме php пашырэння OpCache;<br />Redis - таксама самае, што Memcached;<br />WinCache - гэта які кэшуе модуль, які дазваляе павялічыць хуткасць працы PHP-прыкладанняў на Windows і Windows Server . Апрацоўшчык уключае свой алгарытм працы з дадзенымі з выкарыстаннем аператыўнай і дыскавай памяці;<br />xСache - уключае свой алгарытм працы з дадзенымі з выкарыстаннем аператыўнай і дыскавай памяці.';
$_['help_cache_engine_mine'] = 'Загрузіце свой апрацоўшчык кэша ў тэчку system/library/bus_cache/ і прапішыце ў гэтым полі імя файла, тады кэш старонак, кантролераў і мадэляў будзе апрацоўвацца паказаным апрацоўшчыкам.';
$_['help_cache_oc'] = 'Калі так, то кэш іншых модуляў будзе кантралявацца наладамі Буслік Кэш.';
$_['help_cache_expire'] = 'Па змаўчанні 3600 секунд. Час жыцця кэша задаецца ў секундах.';
$_['help_cache_expire_controller'] = 'Па змаўчанні 3600 секунд. Час жыцця кэша задаецца ў секундах.';
$_['help_cache_expire_model'] = 'Па змаўчанні 3600 секунд. Час жыцця кэша задаецца ў секундах.';
$_['help_cache_expire_all'] = 'Па змаўчанні 36000 секунд. Час жыцця кэша задаецца ў секундах.';
$_['help_cache_size_limit'] = 'Па змаўчанні 0 - без абмежаванняў. Абмежаванне стварэння кэша па памеры задаецца ў Мегабайтах. Пры дасягненні ліміту, іншы кэш будзе кэшавацца на 5 хвілін, а калі памяць скончыцца, то не будзе кэшаваць.';
$_['help_cache_count'] = 'Для апрацоўшчыка Буслік і OpCache укажыце колькасць кэша якую трэба стварыць пры кэшаванні чаго-небудзь. Калі адзін кэш файл заняты адным карыстачом, то іншаму будзе аддадзена іншая копія. Калі даступных дзід няма, то кэш для дадзенага карыстача працаваць не будзе (будзе лічыцца, што кэша няма). Улічыце, што спатрэбіцца месца на дыску ў столькі разоў больш, колькі пакажыце ў гэтым полі.';
$_['help_pagespeed_status'] = 'Уключэнне аптымізацыі павінна паскорыць аддачу кантэнту тым самым пакахаць ваш сайт з пошукавымі робатамі, а значыць пазіцыі ў пошукавай выдачы павінны стаць вышэй.';
$_['help_pagespeed_onrot'] = 'Укажыце роўт або яго keyword (seo_url) старонкі для дакладнай працы. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_pagespeed_rot'] = 'Укажыце роўт або яго keyword (seo_url) старонкі для выключэння з аптымізацыі. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_pagespeed_image_lazy_load'] = 'Абярыце варыянт падгрузкі малюнкаў і фрэйм вокнаў.';
$_['help_pagespeed_image_first_boot_status'] = 'Уключэнне гэтай функцыі дазволіць паскорыць першую загрузку старонкі, калі рэсайз малюнкаў яшчэ не створаны, будзе заменена спасылка на выяву і генераваць выяву будзе па асобным запыце.';
$_['help_pagespeed_image_first_boot_onrot'] = 'Укажыце роўт або яго keyword (seo_url) старонкі для дакладнай працы First Boot. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_pagespeed_image_first_boot_rot'] = 'Укажыце роўт або яго keyword (seo_url) старонкі для выключэння з аптымізацыі First Boot. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_pagespeed_image_w_h'] = 'Уключэнне гэтай функцыі будзе дадаваць атрыбуты шырыні і вышыні да ўсіх выяваў у якіх у назвах ёсць іх памеры, напрыклад, image-100х100.jpg';
$_['help_pagespeed_image_webp_status'] = 'Калі так, то будзе ўключана падтрымка webp выяваў. Адключыце іншыя модулі падобнага функцыяналу.';
$_['help_pagespeed_image_webp_convert'] = 'Выберыце варыянт бібліятэкі для генерацыі webp малюнкаў.';
$_['help_pagespeed_image_webp_quality'] = 'Пакажыце якасць малюнкаў,<br />100 - добрая якасць (без сціску),<br />0 - дрэнная якасць.';
$_['help_pagespeed_html_lazy_load'] = 'Пазначце роўт або keyword (seo_url) старонкі, потым пасля \' | \' укажыце роўт кантролера які трэба загрузіць па скроллу (прыклад - extension/module/category, яго можна даведацца над модулем на цікавай старонцы ў дэбаг рэжыме), потым пасля \' | \' укажыце module_id калі ён ёсць (яго можна пазнаць над модулем на цікавай старонцы ў дэбаг рэжыме), потым пасля \' | \' укажыце нумар загрузкі (яго можна пазнаць над модулем на цікавай старонцы ў дэбаг рэжыме), потым пасля \' | \' пакажыце шырыню экрана больш за якога пачаць загружаць кантролер, калі трэба абмежаваць да, то праз \' - \' пакажыце шырыню. data-busloadinglazy-id для скрыптоў можна пазнаць над модулем на цікавай старонцы ў дэбаг рэжыме або праз кансоль браўзэра.';
$_['help_pagespeed_html_replace_before'] = 'Пазначце роўт або keyword (seo_url) старонкі, потым пасля \' | \' укажыце радок кода які трэба замяніць, потым пасля \' | \' укажыце на які радок замяніць. Калі хочаце на ўсіх старонках, то замест роўту пазначце \' # \'. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'. Перанос радкоў замяняйце на [\r] або [\r][\n].';
$_['help_pagespeed_html_replace_after'] = 'Пазначце роўт або keyword (seo_url) старонкі, потым пасля \' | \' укажыце радок кода які трэба замяніць, потым пасля \' | \' укажыце на які радок замяніць. Калі хочаце на ўсіх старонках, то замест роўту пазначце \' # \'. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'. Перанос радкоў замяняйце на [\r] або [\r][\n].';
$_['help_pagespeed_html_min'] = 'Абярыце варыянты сціску html-кода.';
$_['help_pagespeed_html_min_tags'] = 'Пазначце роўт або keyword (seo_url) старонкі, потым пасля \' | \' укажыце сцягі regex што выдаляць левы бок ад тэга, потым пасля \' | \' укажыце частку тэга або тэг цалкам (калі іх некалькі, то падзяляйце тэгі \' | \'). Калі хочаце на ўсіх старонках, то замест роўту пазначце \' # \'. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_pagespeed_css_replace_before'] = 'Пакажыце роўт або keyword (seo_url) старонкі, потым пасля \' | \' укажыце радок кода які трэба замяніць, потым пасля \' | \' укажыце на які радок замяніць. Калі хочаце на ўсіх старонках, то замест роўту пазначце \' # \'. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'. Перанос радкоў замяняйце на [\r] або [\r][\n].';
$_['help_pagespeed_css_replace_after'] = 'Пазначце роўт або keyword (seo_url) старонкі, потым пасля \' | \' укажыце радок кода які трэба замяніць, потым пасля \' | \' укажыце на які радок замяніць. Калі хочаце на ўсіх старонках, то замест роўту пазначце \' # \'. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'. Перанос радкоў замяняйце на [\r] або [\r][\n].';
$_['help_pagespeed_css_min'] = 'Абярыце варыянт сціску css-кода. Калі ўключана, то ўсе файлы стыляў, якія апрацоўвае OpenCart па стандарце, будуць злучаныя ў адзін файл і максімальна сціснутыя.';
$_['help_pagespeed_css_min_links'] = 'Дадайце спасылку на css стыль які не патрапіў у агульны файл стыляў (для працы з іншых сайтаў, укажыце спасылку таксама ў поле для запампоўкі). Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то перад спасылкай усталюеце \' ; \'. Калі вы жадаеце пазначыць свае атрыбуты, то пасля спасылкі ўсталюеце \' | \' і ўпішыце атрыбуты, напрыклад, catalog/style.css|type=&quot;text/css&quot; rel=&quot;preload&quot;<br />Таксама можна паказаць у пачатку спасылкі наступныя параметры (атрыбуты маюць уверх над параметрамі, акрамя параметраў перасоўвання):<br />[header] - адправіць спасылку ў самы верх сайта;<br />[footer] - адправіць спасылку ў самы ніз сайта;<br />[async] - просіць браўзэр загрузіць асінхронна;<br />[defer] - просіць браўзэр загрузіць адразу пасля пабудовы структуры DOM;<br />[prelod] - просіць браўзэр папярэдне загрузіць;<br />[prefetch] - просіць браўзэр адкласці загрузку ў канец;<br />[dns-prefetch] - просіць браўзэр загадзя выканаць рэзалінг DNS для дамена;<br />[preconnect] - просіць браўзэр загадзя падлучыцца да дамену;<br />[event] - адкласці загрузку па падзеі любога дзеяння;<br />[event-2000] - адкласці загрузку па часе;<br />[critical] - гэты стыль з\'яўляецца крытычным і яго загрузіць асобна, і самым першым (калі такі стыль падрыхтаваны вамі, то можна не ўключаць функцыю стварэння крытычных стыляў);';
$_['help_pagespeed_css_min_download'] = 'Дадайце спасылку на css стыль які трэба спампаваць на свой сайт (спампуе пры захаванні налад або чысткі кэша, рэкамендуецца спачатку захаваць бягучыя налады). Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то перад спасылкай усталюеце \' ; \'.';
$_['help_pagespeed_css_min_exception'] = 'Дадайце спасылку на css стыль які жадаеце выключыць і адправіць па сваім шляху. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то перад спасылкай усталюеце \' ; \'. Калі вы жадаеце пазначыць свае атрыбуты, то пасля спасылкі ўсталюеце \' | \' і ўпішыце атрыбуты, напрыклад, catalog/style.css|type=&quot;text/css&quot; rel=&quot;preload&quot;<br />Таксама можна паказаць у пачатку спасылкі наступныя параметры (атрыбуты маюць уверх над параметрамі, акрамя параметраў перасоўвання):<br />[header] - адправіць спасылку ў самы верх сайта;<br />[footer] - адправіць спасылку ў самы ніз сайта;<br />[async] - просіць браўзэр загрузіць асінхронна;<br />[defer] - просіць браўзэр загрузіць адразу пасля пабудовы структуры DOM;<br />[prelod] - просіць браўзэр папярэдне загрузіць;<br />[prefetch] - просіць браўзэр адкласці загрузку ў канец;<br />[dns-prefetch] - просіць браўзэр загадзя выканаць рэзалінг DNS для дамена;<br />[preconnect] - просіць браўзэр загадзя падлучыцца да дамену;<br />[event] - адкласці загрузку па падзеі любога дзеяння;<br />[event-2000] - адкласці загрузку па часе;<br />[critical] - гэты стыль з\'яўляецца крытычным і яго загрузіць асобна, і самым першым (калі такі стыль падрыхтаваны вамі, то можна не ўключаць функцыю стварэння крытычных стыляў);';
$_['help_pagespeed_css_min_font'] = 'Дадайце спасылку на шрыфт ці малюнак на якую лаецца Pagespeed - просіць, каб перадзагрузілі. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то перад спасылкай усталюеце \' ; \'. Дамену іншых шрыфтоў аўтаматычны будзе ўсталяванае падлучэнне з атрыбутамі (dns-prefetch, preconnect).';
$_['help_pagespeed_css_min_convert'] = 'Пакажыце тыпы MIME кода файлаў у url() якія трэба перанесці ў асобны файл.';
$_['help_pagespeed_css_min_display'] = 'Уключыце гэтую функцыю, каб 100% для шрыфтоў была ўсталявана ўласцівасць font-display каб не паказваць нябачны тэкст.';
$_['help_pagespeed_css_inline_transfer'] = 'Выберыце варыянт перасоўвання css-кода.<br />Уверх - адразу перад </head>;<br />Уніз - адразу перад </body>;<br />У файл сціску - у самы ніз файла які загружаецца адразу;</head>;';
$_['help_pagespeed_css_inline_exception'] = 'Пакажыце роўт або keyword (seo_url) старонкі, потым пасля \' | \' укажыце радок або частку радка css-кода, тады ўвесь блок кода ў &lt;style&gt;&lt;/style&gt; не будзе крануты функцыяй пераносу кода. Значэнне задаецца пачынаючы з новага радка. Калі хочаце на ўсіх старонках, то замест роўту пазначце \' # \'. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_pagespeed_css_events'] = 'Пазначце пры якіх падзеях запускаць css-код, па-змаўчанні падзея выклікаецца 1 раз. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_pagespeed_css_critical'] = 'Уключэнне гэтай функцыі будзе збіраць неабходныя стылі пры першай загрузцы старонкі і адпраўляць на сервер, пазней усе стылі будуць загружацца па ўзаемадзеянні. У мэтах бяспекі збор стыляў будзе даступны пры загрузцы старонкі адміністратарам. Дадзеная функцыя будзе працаваць толькі пры ўключаным сціску і рэкамендуецца ў такім выпадку не адкладаць стылі па падзеі (нават сэнсу не мае).';
$_['help_pagespeed_css_critical_all'] = 'Калі так, то будуць збірацца стылі па ўсіх элементах старонкі.';
$_['help_pagespeed_css_critical_offset'] = 'Пакажыце лік наколькі адсоткаў захопліваць элементы больш вашага экрана па вышыні.';
$_['help_pagespeed_css_critical_time'] = 'Адтэрміноўка часу спрацоўвання зборшчыка стыляў.';
$_['help_pagespeed_css_critical_elements'] = 'Пазначце назву элементаў (тэгі, класы, ідэнтыфікатары) якія трэба змясціць у файл крытычных стыляў з асноўнага. Дадзеная функцыя будзе працаваць пры ўключаным сціску і рэкамендуецца ў такім разе не адкладаць стылі па падзеі. Значэнне паказваецца з новага радка.';
$_['help_pagespeed_css_critical_links'] = 'Вызначце спасылкі на старонкі для якіх трэба стварыць крытычныя стылі. Крытычныя стылі залежаць ад роўту і назваў стыляў. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то перад спасылкай усталюеце \' ; \'.';
$_['help_pagespeed_css_style'] = 'Тут вы можаце задаць стылі для адаптацыі стыляў модуля пад дызайн свайго сайта. Указваць тэгі &lt;style&gt;&lt;/style&gt; ня трэба.';
$_['help_pagespeed_js_replace_before'] = 'Пазначце роўт або keyword (seo_url) старонкі, потым пасля \' | \' укажыце радок кода які трэба замяніць, потым пасля \' | \' укажыце на які радок замяніць. Калі хочаце на ўсіх старонках, то замест роўту пазначце \' # \'. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'. Перанос радкоў замяняйце на [\r] або [\r][\n].';
$_['help_pagespeed_js_replace_after'] = 'Пазначце роўт або keyword (seo_url) старонкі, потым пасля \' | \' укажыце радок кода які трэба замяніць, потым пасля \' | \' укажыце на які радок замяніць. Калі хочаце на ўсіх старонках, то замест роўту пазначце \' # \'. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'. Перанос радкоў замяняйце на [\r] або [\r][\n].';
$_['help_pagespeed_js_min'] = 'Абярыце варыянт сціску js-кода. Калі ўключана, то ўсе файлы скрыптоў, якія апрацоўвае OpenCart па стандарце, будуць злучаныя ў адзін файл і максімальна сціснутыя.';
$_['help_pagespeed_js_min_links'] = 'Дадайце спасылку на js скрыпт які не патрапіў у агульны файл скрыптоў. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то перад спасылкай усталюеце \' ; \'. Калі вы жадаеце пазначыць свае атрыбуты, то пасля спасылкі ўсталюеце \' | \' і ўпішыце атрыбуты, прыклад, catalog/script.js|type=&quot;text/javascript&quot;<br />Таксама можна паказаць у пачатку спасылкі наступныя параметры (атрыбуты маюць уверх над параметрамі, акрамя параметраў перасоўвання):<br /> [header] - адправіць спасылку ў самы верх сайта;<br />[footer] - адправіць спасылку ў самы ніз сайта;<br />[async] - просіць браўзэр загрузіць асінхронна;<br />[defer] - просіць браўзэр загрузіць адразу пасля пабудовы структуры DOM;<br />[prelod] - просіць браўзэр папярэдне загрузіць;<br />[prefetch] - просіць браўзэр адкласці загрузку ў канец;<br />[dns-prefetch] - просіць браўзэр загадзя выканаць рэзалінг DNS для дамена;<br />[preconnect] - просіць браўзэр загадзя падлучыцца да дамена;<br />[event] - адкласці загрузку па падзеі любога дзеяння;<br />[event-2000] - адкласці загрузку па часе;';
$_['help_pagespeed_js_min_download'] = 'Дадайце спасылку на js скрыпт які трэба спампаваць на свой сайт (спампуе пры захаванні налад або чысткі кэша, рэкамендуецца спачатку захаваць бягучыя налады). Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то перад спасылкай усталюеце \' ; \'.';
$_['help_pagespeed_js_min_exception'] = 'Дадайце спасылку на js скрыпт які жадаеце выключыць і адправіць па сваім шляху. Напрыклад, бываюць скрыпты якія цалкам незалежныя і не блакуюць рэндэр старонкі, таму не варта іх сціскаць з іншымі т.я. гэта можа пагоршыць аптымізацыю. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то перад спасылкай усталюеце \' ; \'. Калі вы жадаеце пазначыць свае атрыбуты, то пасля спасылкі ўсталюеце \' | \' і ўпішыце атрыбуты, прыклад, catalog/script.js|type=&quot;text/javascript&quot;<br />Таксама можна паказаць у пачатку спасылкі наступныя параметры (атрыбуты маюць уверх над параметрамі, акрамя параметраў перасоўвання):<br /> [header] - адправіць спасылку ў самы верх сайта;<br />[footer] - адправіць спасылку ў самы ніз сайта;<br />[async] - просіць браўзэр загрузіць асінхронна;<br />[defer] - просіць браўзэр загрузіць адразу пасля пабудовы структуры DOM;<br />[prelod] - просіць браўзэр папярэдне загрузіць;<br />[prefetch] - просіць браўзэр адкласці загрузку ў канец;<br />[dns-prefetch] - просіць браўзэр загадзя выканаць рэзалінг DNS для дамена;<br />[preconnect] - просіць браўзэр загадзя падлучыцца да дамена;<br />[event] - адкласці загрузку па падзеі любога дзеяння;<br />[event-2000] - адкласці загрузку па часе;';
$_['help_pagespeed_js_inline_event'] = 'Пазначце роўт або keyword (seo_url) старонкі, потым пасля \' | \' укажыце радок або частку радка js-кода, тады ўвесь блок кода ў &lt;script&gt;&lt;/script&gt; будзе абгорнута ў падзею запуску пры любым узаемадзеянні з сайтам. Значэнне задаецца пачынаючы з новага радка. Калі хочаце на ўсіх старонках, то замест роўту пазначце \' # \'. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_pagespeed_js_inline_event_time'] = 'Пакажыце час у мілісекундах, калі трэба, каб адкладзеныя скрыпты запусціліся самі не чакаючы любога ўзаемадзеяння з сайтам. Калі пазначана 0, то аўтазапуск не будзе працаваць.';
$_['help_pagespeed_js_inline_transfer'] = 'Выберыце варыянт перасоўвання js-кода.<br />Уверх - адразу перад </head>;<br />Уніз - адразу перад </body>;<br />У файл сціску - у самы ніз файла які загружаецца адразу.';
$_['help_pagespeed_js_inline_transfer_onrot'] = 'Пакажыце роўт або keyword (seo_url) старонкі, потым пасля \' | \' укажыце радок або частку радка js-кода, тады ўвесь блок кода ў &lt;script&gt;&lt;/script&gt; будзе пераносіцца (Пры запаўненні параметры выключэння дзейнічаць не будуць). Значэнне задаецца пачынаючы з новага радка. Калі хочаце на ўсіх старонках, то замест роўту пазначце \' # \'. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_pagespeed_js_inline_exception'] = 'Пакажыце роўт або keyword (seo_url) старонкі, потым пасля \' | \' укажыце радок або частку радка js-кода, тады ўвесь блок кода ў &lt;script&gt;&lt;/script&gt; не будзе крануты функцыяй пераносу кода. Значэнне задаецца пачынаючы з новага радка. Калі хочаце на ўсіх старонках, то замест роўту пазначце \' # \'. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_pagespeed_js_events'] = 'Пазначце пры якіх падзеях запускаць js-код, па-змаўчанні падзея выклічацца 1 раз. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_pagespeed_js_script'] = 'Тут вы можаце задаць скрыпты для адаптацыі стыляў модуля пад дызайн свайго сайта. Указваць тэгі &lt;script&gt;&lt;/script&gt; ня трэба.';
$_['help_database_status'] = 'Пасля правядзення прац адключыце. Пры ўключэнні з боку фронта будзе прымацца працоўны GET параметр \'bus_cache_database\' са адмысловымі значэннямі для адключэння кэша і высновы неабходнай інфармацыі хуткасці працы замест html кода з імітацыяй госця, аўтарызаванага карыстача і адміністратара.';
$_['help_database_links'] = 'Укажыце поўную цікавую спасылку на свой сайт. Значэнне задаецца пачынаючы з новага радка. Калі не жадаеце выдаляць, то ў пачатку радка ўсталюеце \' ; \'.';
$_['help_database_columns'] = 'Пакажыце слупок які трэба індэксаваць, потым пасля \' | \' укажыце памер калі трэба. Значэнне задаецца пачынальна з новага радка.';
$_['help_cron_pregeneration'] = 'Калі так, то будзе працаваць прэгенерацыя кэша па кроне ці ручным запуску.';
$_['help_cron_pregeneration_query_count'] = 'Укажыце колькі рабіць запытаў у секунду. Рэкамендуецца глядзець нагрузку сервера для адзнакі колькасці. Таксама магутнасці сервера проста не дазволяць рабіць вялікую колькасць запытаў.';
$_['help_support_stats_status'] = 'Калі так, то пры наведванні налад модуля, будзе праводзіцца падлік памеру і колькасць файлаў на сайце. Статыстыка кэшуецца на 10 хвілін.';
$_['help_support_disc_size_limit'] = 'Укажыце даступны памер дыска вашага сервера ў Мегабайтах. Па змаўчанні 0 - памер усёй кружэлкі сервера. Гэта максімальны памер для кэша і выяваў WebP.';
$_['help_support_disc_warning'] = 'Калі так, то для адміністратара пры ўваходзе ў адмін панэль будзе выводзіцца паведамленне.';
$_['help_support_session_fix'] = 'Калі так, то пладзіраванне сесій будзе спынена. OpenCart мае праблему стварэння сесій, калі сайт наведвае карыстач не які прымае сесіі, у выніку пры кожным наведванні ствараецца новая сесія. Функцыя робіць так, што захоўвае IP карыстальніка і не дае OpenCart ствараць сесію. Файл блакавання захоўваецца ў тэчцы сесій (калі яна ёсць) ці кэша.';
$_['help_support_debug'] = 'Калі так, то для адміністратара над шапкай сайта будзе выводзіцца інфармацыя аб часе загрузкі старонкі, таксама кэш пачне дзейнічаць.';

// Doc
$_['doc'] = '<b>Усе значэнні зняволеныя ў двукоссі разумейце без прабелаў усярэдзіне (прыклад: \' | \' такім чынам => \'|\'). Таксама не дапушчайце пакіданне ў наладах пустых радкоў, каб модуль не выконваў лішніх умоў праверак. Усе налады прыводзяцца ў адзіны стыль напісання, але будзьце пільныя і пазірайце ў інструкцыю пры навядзенні на гурток са знакам пытання.</b><br /><br /><b>Роўт</b> - гэта значэнне GET параметру ў адраснай радку браўзэра пасля знака \' = \' (прыклад: route=product/category => product/category), або пры загрузцы кантролера ў кодзе першы параметр (прыклад: $this->load->controller(\'product/category\') => product/category), або пры загрузцы мадэлі (прыклад: $this->model_catalog_category->getCategories() => catalog/category/getCategories). У OpenCart 4 перад функцыяй кантролера ўжо ставіцца \' | \' ці \'. \', але вы ўсё-роўна стаўце \' / \'.<br />Роўт і keyword старонкі можна даведацца пры ўключэнні дэбаг рэжыму ў самым уверсе. <b>Роўтам можа быць таксама іншы параметр з слупка query табліцы oc_url_alias, oc_seo_url (калі ў радку браўзэра няма роўту, а ёсць keyword замест роўту product/category будзе, напрыклад, path=20_27) - гэтыя паводзіны плануецца змяніць у будучыні. роўты праз коску, напрыклад, для кэшавання катэгорый product/category,path=,category_id=)</b>.<br /><br />
Рэкамендую выкарыстоўваць гэты модуль <a href="https://liveopencart.ru/index.php?route=product/product&product_id=2519" | br />
Чыстка кэша HTML, DATA:<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&caches=1<br /><br />
Чистка кэша TWIG:<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&twig=1<br /><br />
Чыстка кэша HTML, DATA + CSS, JS:<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&minify= 1<br /><br />
Чыстка кэша HTML, DATA + IMAGES:<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&images=1< br /><br />
Чыстка кэша HTML, DATA + UPDATE MODIFICATIONS, EVENTS:<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&modifications =1<br /><br />
Чыстка LOGS:<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&logs=1<br /><br />
Чыстка VIEW PRDOCUTS (прагледжаныя тавары):<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&view_products=1<br /><br />
Чыстка CUSTOMER SEARCH QUERY (пошукавыя запыты):<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&customer_search=1<br /><br />
Чыстка CUSTOMER BLOG SEARCH QUERY (пошукавыя запыты па блогу OpenCart.Pro 2.3.0.2.6):<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token ]&redirect=[route]&customer_blog_search=1<br /><br />
Чыстка CUSTOMER ACTIVITY (інфармацыя аб актыўнасці карыстальнікаў):<br /> https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&customer_activity=1< br /><br />
Чыстка CUSTOMER AND API SESSION (file or DB) (сесійныя дадзеныя карыстальнікаў і падлучэнняў па REST API OpenCart): https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token= [user_token]&redirect=[route]&customer_session=1<br /><br />
Чыстка GUEST CART SESSION (сесійныя дадзеныя кошыка гасцей):<br />https://mysite.by/admin/index.php?route=extension/module/bus_cache/clear&user_token=[user_token]&redirect=[route]&cart_session=1 <br /><br />';
$_['doc_status'] = '<b>Статус</b> - гэта стан працы модуля ці яго функцыяналу.<br />Уключана - усе функцыі модуля будуць працаздольныя.<br />Адключана - усе функцыі модуля будуць непрацаздольныя. <br />Паміж зменамі статуту і захаванні налад будзе чысціцца кэш OpenCart у system/storage/cache, абнаўляцца мадыфікатары і(ці) падзеі.<br />Мадыфікатары і(ці) падзеі модуля ў завісімасці ад статуту будуць уключацца і адключацца.' ;
$_['doc_store'] = '<b>Крама</b> - гэта стан працы модуля або яго функцыяналу на старонках абранай крамы.<br />Спіс крам размешчаны ў Адмін панэль/Сістэма/Налады. Уключэнне працы вызначаецца ўсталёўкай галачкі.';
$_['doc_cache_status'] = '<b>Уключыць кэшаванне старонак</b> - гэты стан працы функцыяналу модуля якія адносяцца да кэшавання старонак цалкам.<br />Так - функцыі кэша старонак будуць працаздольныя.<br />Не - функцыі кэша старонак будуць непрацаздольныя.<br />Функцыі якія адносяцца да гэтай налады будуць знікаць пры адключаным статуце.<br />Не рэкамендуецца кэшаваць сайт, калі ў вас назапашвальная памяць HDD, а не SSD (NVMe). У цэлым не арандуйце хостынг ці сервер, калі на ім не ўсталяваны NVMe.';
$_['doc_cache_con'] = '<b>Параметры config</b> - гэта параметры радка або масіва атрымоўваныя з $this->config->get(). Разнастайнасць кэша па гэтых параметрах будзе дзейнічаць для кэша ўсіх старонак, кантролераў, мадэляў. Уручную трэба адчыняць зыходны код і адшукваць $this->config->get() які можа быць розным пры вызначаных умовах (гэта значыць трэба ствараць новы кэш пры змене $this->config->get()).';
$_['doc_cache_ses'] = '<b>Параметры session</b> - гэта параметры масіва атрымоўваныя з $this->session->data. Разнастайнасць кэша па гэтых параметрах будзе дзейнічаць для кэша ўсіх старонак, акрамя кэша кантролераў, мадэляў. Уручную трэба адчыняць зыходны код і адшукваць $this->session->data які можа быць розным пры вызначаных умовах (гэта значыць трэба ствараць новы кэш пры змене $this->session->data).';
$_['doc_cache_cok'] = '<b>Параметры cookie</b> - гэта параметры масіва атрымоўваныя з $this->request->cookie. Разнастайнасць кэша па гэтых параметрах будзе дзейнічаць для кэша ўсіх старонак, акрамя кэша кантролераў, мадэляў. Уручную трэба адчыняць зыходны код і адшукваць $this->request->cookie які можа быць розным пры вызначаных умовах (гэта значыць трэба ствараць новы кэш пры змене $this->request->cookie).';
$_['doc_cache_par'] = '<b>Параметры абмежавання</b> - гэта параметры масіва атрымоўваныя з $this->request->get і $this->request->post. Абмежаванне кэша па гэтых параметрах будзе дзейнічаць для кэша ўсіх старонак, акрамя кэша кантролераў, мадэляў. Уручную трэба адчыняць зыходны код і адшукваць $this->request->get ($_GET) і $this->request->post ($_POST) які можа быць розным пры вызначаных умовах (гэта значыць трэба ствараць новы кэш пры змене $this ->request->get і $this->request->post).';
$_['doc_cache_onrot'] = '<b>Параметры працы</b> - гэтая функцыя адказвае за кэшаванне старонак цалкам для вузкай налады (магчымасць наладзіць кэш для асобных старонак па роўце і keyword, паказаць індывідуальныя налады: час кэша, параметры config , session, cookie, get і post для разнастайнасці кэша).';
$_['doc_cache_rot'] = '<b>Параметры выключэння</b> - гэтая функцыя адказвае за выключэнне кэшавання старонак цалкам па роуце і keyword.';
$_['doc_cache_customer'] = '<b>Кэшаваць для аўтарызаваных карыстачоў?</b> - гэтая функцыя адказвае за разнастайнасць кэша старонак паводле $this->customer->isLogged(). Калі не настройваеце тонка кэшаванне старонак цалкам, не ўключайце гэтую функцыю.';
$_['doc_cache_cart'] = '<b>Кэшаваць кошык</b> - гэтая функцыя адказвае за кэшаванне кошыка $this->cart->getProducts().';
$_['doc_cache_cart_count'] = '<b>Кэшаваць пры наяўнасці тавара ў кошыку</b> - гэтая функцыя адказвае за разнастайнасць кэша старонак паводле $this->cart->getProducts().';
$_['doc_cache_controller'] = '<b>Кэшаванне функцый кантролераў</b> - гэтая функцыя адказвае за кэшаванне кантролераў загружаных у кодзе праз $this->load->controller();. Для кожнага кантролера можна паказаць індывідуальныя налады: час кэша, параметры config (па змаўчанні бярэ з агульных налад), session, cookie, get і post для разнастайнасці кэша.';
$_['doc_cache_controller_ajax'] = '<b>Ajax загрузка функцый кантролераў</b> - гэтая функцыя адказвае за загрузку кантролераў ajax спосабам загружаных у кодзе праз $this->load->controller();. Гэтую функцыю трэба выкарыстоўваць, калі трэба схаваць інфармацыю ад пошукавых робатаў, калі з-за модуля на старонцы шмат аднолькавых слоў ці калі модуль нельга кэшаваць пры кэшаваньні старонкі цалкам.';
$_['doc_cache_model'] = '<b>Кэшаванне функцый мадэляў</b> - гэтая функцыя адказвае за кэшаванне мадэляў загружаных у кодзе праз $this->model_[шлях файла мадэлі]->[назва функцыі]();. Для кожнай мадэлі можна паказаць індывідуальныя налады: час кэша, параметры config (па змаўчанні бярэ з агульных налад), session, cookie, get і post для разнастайнасці кэша.';
$_['doc_cache_engine'] = '<b>Апрацоўшчык кэша</b> - гэтая функцыя адказвае за выбар апрацоўшчыка кэша якія пастаўляюцца модулем.<br />Апрацоўшчык Буслік і OpCache - фалавы кэш - рэкамендуецца для слабых хостынгаў, іншыя апрацоўшчыкі ўжываюць дадаткова у сваіх алгарытмах аператыўную памяць для кэшавання.';
$_['doc_cache_engine_mine'] = '<b>Свой апрацоўшчык кэша</b> - гэтая функцыя адказвае за ўсталёўку свайго апрацоўшчыка кэша. Гэта можа спатрэбіцца, калі ў вас ёсць сваё рашэнне апрацоўкі кэша ці трэба, напрыклад, змяніць апрацоўшчык кэша які пастаўляецца з модулем і прадухіліць перазапіс кода пры абнаўленні модуля.';
$_['doc_cache_oc'] = '<b>Кантраляваць кэш OpenCart</b> - гэтая функцыя адказвае за ўсталёўку апрацоўшчыка кэша, як апрацоўшчык па змаўчанні для стандартнага кэша OpenCart.';
$_['doc_cache_expire'] = '<b>Час жыцця кэша OpenCart</b> - гэтая функцыя адказвае за ўсталёўку часу стандартнага кэша OpenCart, калі апрацоўшчык усталяваны для яго.';
$_['doc_cache_expire_controller'] = '<b>Час жыцця кэша кантролераў</b> - гэтая функцыя адказвае за ўсталёўку часу кэша кантролераў па змаўчанні.';
$_['doc_cache_expire_model'] = '<b>Час жыцця кэша мадэляў</b> - гэтая функцыя адказвае за ўсталёўку часу кэша мадэляў па змаўчанні.';
$_['doc_cache_expire_all'] = '<b>Час жыцця кэша старонак</b> - гэтая функцыя адказвае за ўсталёўку часу кэша старонак па змаўчанні.';
$_['doc_cache_size_limit'] = '<b>Памер кэша</b> - гэтая функцыя адказвае за абмежаванне стварэння кэша, калі сканчаецца памяць сервера ці свайго ўсталяванага ліміту дыска.';
$_['doc_cache_clear'] = '<b>Аўтаматычная чыстка кэша</b> - гэтая функцыя адказвае за чыстку кэша ў выпадку абраных галачкай.';
$_['doc_pagespeed_status'] = '<b>Уключыць аптымізацыю (PageSpeed)</b> - гэты стан працы функцыяналу модуля якія адносяцца да аптымізацыі старонак.<br />Так - функцыі аптымізацыі старонак будуць працаздольныя.<br />Не - функцыі аптымізацыі старонак будуць непрацаздольныя.<br />Функцыі якія адносяцца да гэтай налады будуць знікаць пры адключаным статуце.';
$_['doc_pagespeed_onrot'] = '<b>Параметры працы</b> - гэтая функцыя адказвае за ўключэнне аптымізацыі старонак па роуце і keyword, калі на старонцы адсутнічае &lt;!DOCTYPE html';
$_['doc_pagespeed_rot'] = '<b>Параметры выключэння</b> - гэтая функцыя адказвае за выключэнне з аптымізацыі старонак па роуце і keyword, калі з-за працы модуля ўзнікаюць розныя памылкі.';
$_['doc_pagespeed_image_lazy_load'] = "<b>Уключыць Lazy load малюнкаў</b> - гэтая функцыя адказвае за ўстаноўку атрыбуту loading=\"lazy\" або bus-loading=\"lazy\" у тэгі &lt;img, &lt;iframe, &lt;frame. У некаторых шаблонах неабходна праз мадыфікатары ці функцыянал замены ў html-кодзе зрабіць замену data-src на src (натыўны варыянт браўзэра) або data-busloadinglazy-src (універсальны варыянт модуля).<br /><textarea class=\"form-control\">// api bus_loading_lazy.js
/*
busLoadingLazy.browser['name'] - атрымаць назву браўзэра
busLoadingLazy.browser['version'] - атрымаць версію браўзэра
busLoadingLazy.setting['browser']['name'] - запускаць толькі для назвы браўзэра (пасля выканання кода трэба зняць абмежаванне)
busLoadingLazy.setting['browser']['version'] - запускаць толькі для версіі браўзэра і навей (пасля выканання кода трэба зняць абмежаванне)
busLoadingLazy.setting['elements'] - апрацоўваць элементы старонкі, па змаўчанні '[loading=\"lazy\"][data-busloadinglazy-src], [loading=\"lazy\"][data-busloadinglazy-id]'
busLoadingLazy.setting['element'] - апрацоўваць элемент старонкі, па змаўчанні ''
busLoadingLazy.setting['fps'] - частата дзеянняў любых падзей пасля якіх спрацуе ваш код у падзеі busLoadingLazy, па змаўчанні 10
busLoadingLazy.setting['offsetTop'] - адлегласць ад акна браўзэра да элемента які пачынае загрузку, па змаўчанні 50
busLoadingLazy.setting['width'] - мінімальная шырыня для запуску элемента старонкі, па змаўчанні 0
busLoadingLazy.setting['lazy'] - прымусовая загрузка элемента, па змаўчанні false
busLoadingLazy.setting['start'] - пачаць загрузку элемента са знойдзеных з нумара, па змаўчанні 0
busLoadingLazy.setting['quantity'] - апрацаваць колькасць элементаў з усіх знойдзеных, па змаўчанні 10
busLoadingLazy.setting['exception'] - масіў утрымоўвальныя значэнні data-busloadinglazy-src і data-busloadinglazy-id для выключэння з апрацоўкі, па змаўчанні {}

// Прыклад:
window.addEventListener('busLoadingLazyBefore', function() {
	busLoadingLazy.setting['status'] = false; // не загружаць модуль
	busLoadingLazy.setting['start'] = 0; // пачаць загружаць з
	busLoadingLazy.setting['quantity'] = 20; // загружаць столькі-то
	busLoadingLazy.setting['exception'] = {'https://mysite.by/image.png':true}; // не загружаць гэты малюнак пры загрузкі старонкі
	busLoadingLazy.start(); // загрузіць яшчэ выявы і iframe пры загрузкі старонкі пачынаючы ад 50 у колькасці 5 штук
	busLoadingLazy.setting['exception'] = {}; // прыбіраем выключэнні
});
*/

// скрыпт bus_loading_lazy.js запускаецца пры поўнай загрузкі старонкі па падзеі load т.я. у гэты момант ён можа атрымаць даставерную вышыню і г.д.
// выканаць код па скроллу, рэсайзу паводле налад частаты запуску busLoadingLazy.setting['fps']
window.addEventListener('busLoadingLazy', function() {
	/* ваш код */
});

// выканаць код перад запускам скрыпту busLoadingLazy
window.addEventListener('busLoadingLazyBefore', function() {
	/* ваш код */
});

// выканаць код пасля запуску скрыпту busLoadingLazy
window.addEventListener('busLoadingLazyAfter', function() {
	/* ваш код */
});

// выканаць код пры з'яўленні адкладзенага блока
window.addEventListener('busLoadingLazyId-93fd76d319a4d202930d925a170c45ff', function() {
	/* ваш код */
})

// апрацаваць html элемент зараз (калі хочаце загрузіць па кліку)
busLoadingLazy.start({element:'[data-busloadinglazy-id=\'93fd76d319a4d202930d925a170c45ff\']', lazy:true});

// Больш правільны варыянт запуску па кліку
function myclick() {
	if ('busLoadingLazy' in window) {
		busLoadingLazy.start({element:'[data-busloadinglazy-id=\'93fd76d319a4d202930d925a170c45ff\']', lazy:true});
	} else {
		window.addEventListener('busLoadingLazyBefore', function() {
			busLoadingLazy.start({element:'[data-busloadinglazy-id=\'93fd76d319a4d202930d925a170c45ff\']', lazy:true});
		});
	}
}</textarea>";
$_['doc_pagespeed_image_first_boot_status'] = 'Спасылка будзе мець абаронены выгляд "https://mysite.by/?bus_cache_first_boot=qwert123" з дапамогай функцыяналу $this->encryption.';
$_['doc_pagespeed_image_w_h'] = '<b>Уключыць атрыбуты шырыні і вышыні</b> - гэтая функцыя адказвае за ўключэнне атрыбут шырыні і вышыні ў выявах. Калі не былі прастаўлены дадзеныя атрыбуты дзесьці, то скарыстайцеся функцыяналам замены ў html-кодзе.';
$_['doc_pagespeed_image_webp_status'] = '<b>Уключыць подджержку WebP малюнкаў</b> - гэтая функцыя адказвае за ўключэнне падтрымкі webp фармату (загрузка малюнкаў у файл менеджэр).<br />Функцыі якія адносяцца да гэтай налады будуць знікаць пры адключаным статусе.<br />Паміж зменамі статуту і захаванні налад будзе чысціцца кэш OpenCart у system/storage/cache, абнаўляцца мадыфікатары і(ці) падзеі.<br />Мадыфікатары і(ці) падзеі модуля ў завісімасці ад статуту будуць уключацца і адключацца .';
$_['doc_pagespeed_image_webp_convert'] = '<b>Канвертаваць выявы ў WebP і назад</b> - гэтая функцыя адказвае за канвертаванне png,jpg,gif малюнкаў у webp і назад, калі браўзэр не падтрымлівае webp.<br />Рэкамендуецца GD Version 2.2.5+ (у версіі ніжэй няма падтрымкі празрыстага фону і праблема з сінім колерам - модуль ставіць замест празрыстасці белы колер і вырашае праблему з адсутнасцю сіняга колеру) і php 7.1+ (у версіі ніжэй адсутнічае праверка тыпу IMAGETYPE_WEBP).';
$_['doc_pagespeed_image_webp_quality'] = '<B>Сціск WebP малюнкаў</b> - гэтая функцыя адказвае за якасць малюнка пры яго стварэнні.';
$_['doc_pagespeed_html_lazy_load'] = '<b>Уключыць Lazy load html</b> - гэтая функцыя адказвае за абгортванне html-кода кантролера ў &lt;div loading="lazy" data-busloadinglazy-id="93fd76d319a4d busloadinglazy-res="1200"&gt;&lt;noscript&gt;код кантролера&lt;/noscript&gt;&lt;/div&gt;<br />З дапамогай функцыяналу замены ў html-кодзе можна загарнуць у гэтыя тэгі любы html-код, галоўнае задаць індывідуальны ідэнтыфікат .<br /><br />data-busloadinglazy-id - гэта ідэнтыфікатар кантролера па роўце і назову модуля.<br />data-busloadinglazy-res - гэта мінімальная шырыня экрана для запуску модуля. Майце на ўвазе, што шырыня экрана чыста для PageSpeed на мабільных тэлефонах з вялікім дазволам будзе запускацца html-код.<br />
data-busloadinglazy-remove - гэта ўсталёўваецца модулем у абраным кантролеры на замену тэга &lt;noscript&gt; для выдалення пры запуску скрыпту bus_loading_lazy.js.<br /><br />Пры адкладанні каруселі, можа запатрабавацца паўторна запусціць код каруселі - змесціце код запуску каруселі ў код падзеі з\'яўлення html-кода пры скролінгу. Код падзеі гледзіце ў дакументацыі функцыі модуля вышэй.<br /><br />';
$_['doc_pagespeed_html_replace_before'] = '<b>Замена ў html-кодзе да сціску</b> - гэтая функцыя адказвае за замену ў html-кодзе да яго сціску, каб можна было падправіць код для якога-небудзь функцыяналу.<br> />У асноўным патрабуецца замена калі бракуе якога-небудзь элемента ў кодзе з-за чаго пасля сціску ў браўзэры з\'яўляецца памылка, ці трэба ўсталяваць атрыбуты шырыні і вышыні на малюнкі, ці трэба прыбраць атрыбут loading="lazy" і г.д. <br />Каб прыбраць у патрэбных месцах loading="lazy" выкарыстайце мадыфікатары для ўсталёўкі які пазначае атрыбуту на патрэбных малюнках перад атрыбутам src, каб у модулі можна было да яго падчапіцца.';
$_['doc_pagespeed_html_replace_after'] = '<b>Замена ў html-кодзе пасля сціску</b> - гэтая функцыя адказвае за замену ў html-кодзе пасля яго сціску, каб можна было падправіць код для функцыяналу сціску.<br /> Галоўным чынам патрабуецца замена калі бракуе якога-небудзь элемента ў кодзе з-за чаго пасля сціску ў браўзэры з\'яўляецца памылка, ці трэба ўсталяваць атрыбуты шырыні і вышыні на малюнкі, ці трэба прыбраць атрыбут loading="lazy" і т.д.<br> />Каб прыбраць у патрэбных месцах loading="lazy" выкарыстайце мадыфікатары для ўсталёўкі які пазначае атрыбуту на патрэбных малюнках перад атрыбутам src, каб у модулі можна было да яго падчапіцца.';
$_['doc_pagespeed_html_min'] = '<b>Сціскаць html-код</b> - гэтая функцыя адказвае за памяншэнне памеру старонак шляхам выдалення каментар, лішніх прабелаў, перанос радкоў.<br />Таксама для памяншэння памеру выкарыстайце па магчымасці перанос інлайн кода ў файл сціску і не змяшчайце зыходны код svg малюнкаў у код старонкі. Чым лягчэй старонка, тым менш памяці запатрабуецца на апрацоўку і захоўванне кэша.';
$_['doc_pagespeed_html_min_tags'] = '<b>Выдаленне водступаў злева ад тэгаў</b> - гэтая функцыя адказвае за выдаленне адсутпаў паміж &gt;&lt;, гэта значыць вы вырашаеце паміж якімі тэгамі і на якой старонцы можна выдаліць \s, \h,\t,\r,\n і г.д. паводле правіл рэгулярных выразаў у квадратных дужка [].';
$_['doc_pagespeed_css_replace_before'] = '<b>Замена ў css-кодзе да сціску</b> - гэтая функцыя адказвае за замену ў css-кодзе да яго сціску, каб можна было падправіць код для якога-небудзь функцыяналу.<br> />У асноўным патрабуецца замена калі бракуе якога-небудзь элемента ў кодзе з-за чаго крывіцца дызайн сайта, ці жадаеце што-небудзь выдаліць лішняе.';
$_['doc_pagespeed_css_replace_after'] = '<b>Замена ў css-кодзе пасля сціску</b> - гэтая функцыя адказвае за замену ў css-кодзе пасля яго сціску, каб можна было падправіць код для якога-небудзь функцыяналу.<br> />У асноўным патрабуецца замена калі бракуе якога-небудзь элемента ў кодзе з-за чаго крывіцца дызайн сайта, ці жадаеце што-небудзь выдаліць лішняе.';
$_['doc_pagespeed_css_min'] = '<b>Сціскаць css-код</b> - гэтая функцыя адказвае за памяншэнне памеру старонак шляхам выдалення каментар, лішніх прабелаў, перанос радкоў, збор файлаў у адзін.';
$_['doc_pagespeed_css_min_links'] = '<b>Спасылкі на css файлы</b> - гэтая функцыя адказвае за аб\'яднанне файлаў css у адзін файл. Па змаўчанні збіраюцца файлы з $this->document->getStyles(), таму астатнія трэба пазначыць уручную.';
$_['doc_pagespeed_css_min_download'] = '<b>Спасылкі на css файлы для запампоўкі</b> - гэтая функцыя адказвае за захаванне файлаў css на свой сервер пасля захавання налад модуля. Гэта карысна для сайта, бо са свайго сервера файл будзе загружацца хутчэй.';
$_['doc_pagespeed_css_min_exception'] = '<b>Выключэнне са сціску css</b> - гэтая функцыя адказвае за выключэнне файлаў css з аб\'яднання ў адзін файл якія аб\'ядноўваюцца аўтаматычны з $this->document->getStyles().';
$_['doc_pagespeed_css_min_font'] = '<b>Перадзагрузка шрыфтоў ці малюнкаў</b> - гэтая функцыя адказвае за ўсталёўку прыярытэту загрузкі для шрыфтоў і малюнкаў, што дасць магчымасць мінімізаваць скокі стыляў і дадатна паўплывае на \'Cumulative Layout Shift\'.';
$_['doc_pagespeed_css_min_convert'] = '<b>Канвертацыя з кода ў файл</b> - гэтая функцыя карысная, для памяншэння памеру файла стыляў і дае магчымасць кэшаваць браўзэрам такія файлы.';
$_['doc_pagespeed_css_min_display'] = '<b>Font-Display</b> - гэтая функцыя адказвае за ўсталяванне рэжыму працы шрыфтоў.';
$_['doc_pagespeed_css_inline_transfer'] = '<b>Перамясціць інлайн css-код</b> - гэтая функцыя адказвае за перанос кода.';
$_['doc_pagespeed_css_inline_exception'] = '<b>Выключэнне з пераносу інлайн css-кода</b> - гэтая функцыя адказвае за выключэнне кода з пераносу.';
$_['doc_pagespeed_css_events'] = '<b>Падзеі для запуску css-кода</b> - гэтая функцыя адказвае за запуск адкладзенага css-кода (інлайн код і файлы).';
$_['doc_pagespeed_css_critical'] = '<b>Уключыць збор крытычных стыляў</b> - гэтая функцыя адказвае за збор неабходных стыляў для паказаных старонак. Дадзеная магчымасць памяншае час загрузкі для \'First Contentful Paint\' і \'Largest Contentful Paint\'.';
$_['doc_pagespeed_css_critical_all'] = '<b>Збіраць стылі па ўсіх элементах</b> - гэтая функцыя адказвае за збор стыляў без уліку вышыні экрана.';
$_['doc_pagespeed_css_critical_offset'] = '<b>Адсечка збору ад вышыні экрана</b> - гэтая функцыя адказвае за карэкціроўку вышыні старонкі сайта для збору крытычных стыляў.';
$_['doc_pagespeed_css_critical_time'] = '<b>Адтэрміноўка часу</b> - гэтая функцыя адказвае за запуск збору стыляў праз неабходны для вас прамежак часу.';
$_['doc_pagespeed_css_critical_elements'] = '<b>Элементы стыляў</b> - гэтая функцыя адказвае за ўказанне дадатковых элементаў стыляў, калі не былі па якой-небудзь прычыне падхоплены. Элементы стыляў - азначае ідэнтыфікатар стылю (.class, #id, [attribute], tag ці поўная назва стылю).';
$_['doc_pagespeed_css_critical_links'] = '<b>Спасылкі на старонкі збору крытычных стыляў</b> - спасылкі неабходныя, каб модуль ведаў для якіх старонак трэба стварыць крытычныя стылі.';
$_['doc_pagespeed_css_style'] = '<b>Стыль</b> - гэтае поле для памяшкання свайго css-кода. Файл кода будзе загружацца пасьля асноўных.';
$_['doc_pagespeed_js_replace_before'] = '<b>Замена ў js-кодзе да сціску</b> - гэтая функцыя адказвае за замену ў js-кодзе да яго сціску, каб можна было падправіць код для якога-небудзь функцыяналу.<br> />У асноўным патрабуецца замена калі бракуе якога-небудзь элемента ў кодзе з-за чаго пасля сціску ў браўзэры з\'яўляецца памылка, ці жадаеце што-небудзь выдаліць лішняе.';
$_['doc_pagespeed_js_replace_after'] = '<b>Замена ў js-кодзе пасля сціску</b> - гэтая функцыя адказвае за замену ў js-кодзе пасля яго сціску, каб можна было падправіць код для якога-небудзь функцыяналу.<br> />У асноўным патрабуецца замена калі бракуе якога-небудзь элемента ў кодзе з-за чаго пасля сціску ў браўзэры з\'яўляецца памылка, ці жадаеце што-небудзь выдаліць лішняе.';
$_['doc_pagespeed_js_min'] = '<b>Сціскаць js-код</b> - гэтая функцыя адказвае за памяншэнне памеру старонак шляхам выдалення каментар, лішніх прабелаў, перанос радкоў, збор файлаў у адзін';
$_['doc_pagespeed_js_min_links'] = '<b>Спасылкі на js файлы</b> - гэтая функцыя адказвае за аб\'яднанне файлаў js у адзін файл. Па змаўчанні збіраюцца файлы з $this->document->getScripts(), таму астатнія трэба пазначыць уручную.';
$_['doc_pagespeed_js_min_download'] = '<b>Спасылкі на js файлы для запампоўкі</b> - гэтая функцыя адказвае за захаванне файлаў js на свой сервер пасля захавання налад модуля. Гэта карысна для сайта, бо са свайго сервера файл будзе загружацца хутчэй.';
$_['doc_pagespeed_js_min_exception'] = '<b>Выключэнне са сціску js</b> - гэтая функцыя адказвае за выключэнне файлаў js з аб\'яднання ў адзін файл якія аб\'ядноўваюцца аўтаматычны з $this->document->getScripts().';
$_['doc_pagespeed_js_inline_event'] = "<b>Адкласці загрузку інлайн js-кода</b> - гэтая функцыя адказвае за абкручванне інлайн js-кода ў window.addEventListener('busCache', function() {інлайн код}); У гэты код можна абгортваць любы код загрузку якога трэба адкласці па падзеях паказаных у поле 'Падзеі для запуску js-кода'.Адкладаць трэба скрыпты якія мяшаюць рэндэру старонкі: метрыкі, розныя чайты. /><textarea class=\"form-control\">// выканаць код, калі пры абнаўленні старонкі праскроліла ўніз
window.addEventListener('load', function() {
	if ('busCache' in window && busCache.status == false) {
		if (document.documentElement && document.documentElement.scrollTop > 0 ||  document.body.scrollTop > 0) {
			busCache.start();
		}
	}
});

// прыклад падлучэння метрыкі каб можна было адкласці рыпанне ў поле 'Спасылкі на js файлы'
<!-- Google Tag Manager -->
<script async src=\"https://www.googletagmanager.com/gtm.js?id=GTM-XXXXXX&l=dataLayer\" type=\"text/javascript\"></script>
<script type=\"text/javascript\">
	window.dataLayer = window.dataLayer || [];
	window.dataLayer.push({'gtm.start':new Date().getTime(),event:'gtm.js'});
</script>
<!-- Google Tag Manager -->
<!-- Google Tag Manager -->
<noscript><iframe src=\"https://www.googletagmanager.com/ns.html?id=GTM-XXXXXX\" height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe></noscript>
<!-- Google Tag Manager -->

<!-- Global site tag (gtag.js) - Google Analytics -->
<script async src=\"https://www.googletagmanager.com/gtag/js?id=UA-XXXXXXXX-X\" type=\"text/javascript\"></script>
<script type=\"text/javascript\">
	window.dataLayer = window.dataLayer || [];
	function gtag(){window.dataLayer.push(arguments);}

	gtag('js', new Date());
	gtag('config', 'UA-XXXXXXXX-X');
</script>
<!-- Global site tag (gtag.js) - Google Analytics -->

<!-- Yandex.Metrika -->
<script async src=\"https://mc.yandex.ru/metrika/tag.js\" type=\"text/javascript\"></script>
<script type=\"text/javascript\">
	//https://yandex.ru/support/metrica/code/counter-initialize.html
	window.ym = window.ym || function() {(window.ym.a = window.ym.a || []).push(arguments);};
	window.ym.l = 1*new Date();

	ym(00000000, \"init\", {
		clickmap:true,
		trackLinks:true,
		accurateTrackBounce:10
	});
</script>
<!-- Yandex.Metrika -->
<!-- Yandex.Metrika -->
<noscript><div><img src=\"https://mc.yandex.ru/watch/00000000\" style=\"position:absolute; left:-9999px;\" alt=\"\" /></div></noscript>
<!-- Yandex.Metrika -->

// запускаем скрыпт калі ён сапраўды патрэбен
if (!('owlCarousel' in $)) {
    (function($, window, document, undefined) {
        $.fn.owlCarousel = function(setting) {
            var self = this;
            return busCache.loadScript('catalog/view/javascript/jquery/owl-carousel/owl.carousel.min.js', function() {
                return $(self).owlCarousel(setting);
            });
        };
    })($, window, document);
}</textarea>";
$_['doc_pagespeed_js_inline_event_time'] = '<b>Час да аўтазапуску інлайн js-кода</b> - гэтая функцыя адказвае за ўсталяванне часу адтэрміноўкі спрацоўвання паказаных падзей у поле \'Падзеі для запуску js-кода\'.';
$_['doc_pagespeed_js_inline_transfer'] = '<b>Перамясціць інлайн js-код</b> - гэтая функцыя адказвае за';
$_['doc_pagespeed_js_inline_transfer_onrot'] = '<b>Пераносіць інлайн js-код</b> - гэтая функцыя адказвае за';
$_['doc_pagespeed_js_inline_exception'] = '<b>Выключэнне з пераносу інлайн js-кода</b> - гэтая функцыя адказвае за';
$_['doc_pagespeed_js_events'] = '<b>Падзеі для запуску js-кода</b> - гэтая функцыя адказвае за запуск адкладзенага js-кода (інлайн код і файлы).';
$_['doc_pagespeed_js_script'] = '<b>Скрыпт</b> - гэтае поле для памяшкання свайго js-кода. Файл кода будзе загружацца пасьля асноўных.';
$_['doc_database_status'] = '<b>Рэжым налады</b> - гэта стан працы модуля ў рэжыме налады індэксаў базы дадзеных. Не забывайце выключаць пасля правядзення прац.';
$_['doc_database_links'] = '<І>Цікаўныя спасылкі для праверкі</b> - гэта спіс спасылак па якіх модуль будзе праводзіць праверку хуткасці загрузкі.';
$_['doc_database_tables'] = '<b>Табліцы</b> - гэтая функцыя адказвае за';
$_['doc_database_indexs'] = '<b>Індэксы</b> - гэтая функцыя адказвае за';
$_['doc_database_columns'] = '<b>Стоўбцы</b> - гэтая функцыя адказвае за';
$_['doc_database_unique'] = '<b>Унікальны</b> - гэтая функцыя адказвае за';
$_['doc_database_unique_elements'] = '<b>Унікальных элементаў</b> - гэтая функцыя адказвае за';
$_['doc_database_packed'] = '<b>Упакаваны</b> - гэтая функцыя адказвае за';
$_['doc_database_index'] = '<b>Індэкс</b> - гэтая функцыя адказвае за';
$_['doc_database_index_name'] = '<b>Імя індэкса</b> - гэтая функцыя адказвае за';
$_['doc_database_index_key_block_size'] = '<b>Памер блока ключа</b> - гэтая функцыя адказвае за';
$_['doc_database_index_type'] = '<b>Тып</b> - гэтая функцыя адказвае за';
$_['doc_database_index_parser'] = '<b>Парсер</b> - гэтая функцыя адказвае за';
$_['doc_database_index_comment'] = '<b>Каментар</b> - гэтая функцыя адказвае за';
$_['doc_database_column'] = '<b>Стоўбец</b> - гэтая функцыя адказвае за';
$_['doc_support_update'] = 'Калі вы купілі версію з тэхнічнай падтрымкай - указанне дамена абавязкова пры пакупкі - інакш абнаўлення не атрымаць. Калі вы купілі версію без тэхнічнай падтрымкі, то пазначце ў адпаведнае поле нумар замовы пакупкі. Калі апынецца, што іншы дамен не ваш (іншая юр. інфармацыя на сайце ў параўнанні з першым даменам ці няма дадзеных наогул для магчымасці праверыць), тое абнаўленне не будзе даступна. Калі вы купілі версію на права перапродажу, то пазначце нумар замовы і дашліце аўтару модуля гатовы код стварэння ключоў на аснове даменаў вашых кліентаў, каб на серверы аўтара праходзіла праверка дакладнасці набыцця (далей сваім кліентам даяце нумар замовы і свой ключ - замест нумара замовы можна любы іншы ідэнтыфікатар - але яго трэба паказаць замест дамена пры пакупкі модуля). Абнаўленне недаступнае для тэставых даменаў.';
$_['doc_support_stats_status'] = '<b>Уключыць статыстыку</b> - гэтая функцыя адказвае за функцыі збору інфармацыі якія паказваюць памер кэша ў system/storage/cache, памер малюнкаў у image, памер сесій у system/storage/session і oc_session...';
$_['doc_support_disc_size_limit'] = '<b>Ліміт памяці дыска</b> - гэтая функцыя адказвае за ўсталёўку свайго ліміту памяці для кэша і малюнкаў webp.';
$_['doc_support_disc_warning'] = '<b>Уключыць папярэджанне аб не хватцы памяці</b> - гэтая функцыя адказвае за абвестку адміністратара аб недахопе памяці пры наведванні галоўнай старонкі адмін панэлі.';
$_['doc_support_debug'] = '<b>Уключыць адладку</b> - гэтая функцыя адказвае за інфармаванне адміністратара аб хуткасці працы модуля на баку сайта.';
$_['doc_support_debug_log'] = '<b>Уключыць лагіраванне павольных старонак</b> - гэтая функцыя адказвае за';

//Button
$_['button_files_clear'] = 'Выдаліць таксама файлы модуля? - калі не, проста абновіце старонку ад граху. Справаздачу аб выдаленні файлаў глядзіце ў логах мадыфікатараў.';
$_['button_add'] = 'Дадаць';
$_['button_edit'] = 'Рэдагаваць';
$_['button_delete'] = 'Выдаліць';
$_['button_copy'] = 'Скапіяваць';
$_['button_update'] = 'Абнавіць';
$_['button_clear'] = 'Ачысціць';
$_['button_clear_cache'] = 'Ачысціць кэш';
$_['button_save'] = 'Захаваць';
$_['button_apply'] = 'Ужыць';
$_['button_apply_piecemeal'] = 'Ужыць часткамі';
$_['button_export'] = 'Экспарт';
$_['button_import'] = 'Імпарт';
$_['button_start'] = 'Запуск загрузкі';
$_['button_continue'] = 'Працяг загрузкі з месца прыпынку';
$_['button_pause'] = 'Прыпыненне загрузкі';
$_['button_restart'] = 'Перазапуск загрузкі - пачаць спачатку';
$_['button_search'] = 'Знайсці';
$_['button_restore'] = 'Аднавіць';
$_['button_view'] = 'Прагледзець';

// Error
$_['error_permission'] = 'У вас нядосыць правоў для занясення змен!';
$_['error_warning'] = 'Уважліва праверце форму на памылкі!';
$_['error_install'] = 'Нешта пайшло не так!';
$_['error_uninstall'] = 'Нешта пайшло не так!';
$_['error_name'] = 'Назва павінна змяшчаць да 255 сімвалаў!';
$_['error_width'] = 'Пакажыце Шырыню!';
$_['error_height'] = 'Пакажыце Вышыню!';
$_['error_max_input_vars'] = '<b>Увага! Будзе перавышаны ліміт параметра %s</b>, калі перавысіць, дадзеныя могуць не захавацца. Павялічце значэнне на серверы або звярніцеся з дадзенай просьбай да хосцера для павелічэння ліміту. Або скарыстайцеся кнопкай ужывання часткамі.<br>Ліміт на серверы: %s <br>Ліміт ад модуля: %s - адсечка %s у пазбяганне страты дадзеных<br>Бягучае значэнне: ';
$_['error_setting_import'] = 'Файл не ўтрымоўвае налады модуля, імпарту адмоўлена!';
$_['error_setting_import_format'] = 'Модуль не ведае аб такім фармаце, імпарту адмоўлена! - модуль мякка вас паслаў.';
$_['error_not_required'] = 'Не патрабуецца!';
$_['error_cache_size_limit'] = '<b>Увага!</b> Будзе перавышаны ліміт памяці для кэша! Новы кэш будзе кэшавацца на 5 хвілін.';
$_['error_support_disc_size_limit'] = '<b>Увага!</b> Перавышаны ліміт памяці для кэша! Кэш адключаны.';
$_['error_curl'] = '<b>Увага!</b> Не ўсталявана бібліятэка curl.';
$_['error_update'] = '<b>Увага!</b> Памылка абнаўлення!%s';
$_['error_update_1'] = '<b>Увага!</b> Вы не з\'яўляецеся пакупніком модуля або ліцэнзія яшчэ не актываваная, абнаўленню адмоўлена!';
$_['error_update_2'] = '<b>Увага!</b> Перыяд тэхнічнай падтрымкі скончаны, абнаўленню адмоўлена!';
$_['error_update_3'] = '<b>Увага!</b> Вы парушылі ліцэнзійную дамову, абнаўленню адмоўлена!';
$_['error_update_4'] = '<b>Увага!</b> Вы карыстаецеся актуальнай версіяй!';
$_['error_update_clone'] = '<b>Увага!</b> Зафіксаваная падмена дадзеных, абнаўленню адмоўлена!';

// Success
$_['success_install'] = ' - паспяхова ўсталяваны!';
$_['success_uninstall'] = ' - паспяхова выдалены!';
$_['success_uninstall_data_base'] = '◄ База дадзеных выдалена ►: ';
$_['success_uninstall_modification'] = '◄ Мадыфікатар выдалены ►: ';
$_['success_uninstall_folder'] = '◄ Тэчка выдаленая т.к. файлаў няма ►: ';
$_['success_uninstall_file'] = '◄ Выдалены файл ►: ';
$_['success_update'] = ' - паспяхова абноўлены!';
$_['success_setting'] = 'Налады паспяхова зменены!';
$_['success_setting_apply'] = 'Налады паспяхова ўжытыя!';
$_['success_setting_save'] = 'Налады паспяхова захаваны!';
$_['success_setting_new'] = 'Новы модуль паспяхова дададзены!';
$_['success_setting_redirect'] = 'Вы былі перанакіраваны на патрэбную старонку налад!';
$_['success_setting_import'] = 'Налады модуля "%s" паспяхова імпартаваныя ў модуль, вам засталося іх прымяніць!';
$_['success_add'] = 'Паспяхова дададзена!';
$_['success_delete'] = 'Паспяхова выдалена!';
$_['success_clear'] = 'Паспяхова ачышчана!';